{"id":"10764459","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/10764459-dark-theme","title":"dark theme","body":"Add optional Visual Studio-like Dark theme. Eyes work harder going from VS Dark to F12 Tools light hundred of times a day. Less fatigue, more productivity.","votes":"215","user":"https://wpdev.uservoice.com/users/123649746-alfredo-ramirez","datetime":"2015-11-18","comments":[{"user":"https://wpdev.uservoice.com/users/869345347-joe","datetime":"2018-11-14","body":"Dark Theme, should just copy browsers settings to DevTools so you don't have to code a new settings menu."},{"user":"https://wpdev.uservoice.com/users/852644800-si-burgess","datetime":"2018-09-24","body":"This really needs a dark theme/option to save eye strain especially for us late night workers."},{"user":"https://wpdev.uservoice.com/users/796231657-michael-gaskin","datetime":"2018-06-06","body":"I thought for sure I was overlooking a setting someplace... Yes, please add a dark theme."},{"user":"https://wpdev.uservoice.com/users/792194350-subramanya-chakravarthy","datetime":"2018-05-29","body":"Please give us dark theme"},{"user":"https://wpdev.uservoice.com/users/791432908-wall-xa","datetime":"2018-05-27","body":"I'm really impressed with the Edge performance and UI but as a developer I'm not satisfied with the Developer Tools. Seriously, If Microsoft wants to bring back users for their web browser, they must care how the Dev thinks first, if they don't like it they will bring it to **** and normal users will never have chances to attempt it."},{"user":"https://wpdev.uservoice.com/users/763313767-scott-stauffer","datetime":"2018-03-05","body":"I absolutely love Edge. I'm the lead dev at work and always try to get my devs using it. I like the dark mode too, but it would also be awesome to have a dark mode option extended to the Developer Tools. It's such a beautiful browser, but when I press F12 I am instantly reminded of IE11."},{"user":"https://wpdev.uservoice.com/users/398563468-rob","datetime":"2017-06-20","body":"Yes. This. If you want us to take Edge seriously as a tool for development, we need a dark color theme for the dev tools. I'm really starting to enjoy Edge as a browser, but the dev tools are a literal headache when you have them open next to a dark IDE."},{"user":"https://wpdev.uservoice.com/users/157804557-%E6%AC%A7%E6%96%87","datetime":"2017-06-08","body":"Not a dark \"theme\" but an actual \"Dark Mode\" like Chrome's \"High Contrast\" mode... Intelligently invert colors..."},{"user":"https://wpdev.uservoice.com/users/359644414-darren-evans","datetime":"2017-04-17","body":"Edge dark theme available in-browser. Amazed that the 'dark theme' mindset for Edge browser UI rendering not retained for Dev tools. Is this an example of Edge team members separation between browser UI rendering and Dev tools functionality?"},{"user":"https://wpdev.uservoice.com/users/214442403-michael-konovaliuk","datetime":"2016-08-09","body":"In chrome we have Zero Dark Matrix extension. Really want to switch for development to Edge and I hope you'll add this feature soon"}]}