{"id":"10967505","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/10967505-allow-edge-to-be-updated-on-its-own","title":"Allow Edge to be updated on its own","body":"Microsoft isn’t updating Edge via the Store as originally promised. Edge updates seem to be held back for major new versions of Windows 10, unlike Windows 10’s other included apps, which are updated more regularly. A good example is the big Nov 2015 Windows update which is the only way to get Edge 25 with EdgeHTML 13 including the drag &amp; drop file fix.","votes":"2,671","user":"https://wpdev.uservoice.com/users/127809921-jade-ohlhauser","datetime":"2015-12-04","comments":[{"user":"https://wpdev.uservoice.com/users/106024266-jade-ohlhauser","datetime":"2019-08-30","body":"The new Edge which is based on Chromium is in Beta. In other words: MISSION ACCOMPLISHED. Thank-you everyone who voted this up or commented."},{"user":"https://wpdev.uservoice.com/users/868587715-aaron","datetime":"2018-11-13","body":"As a web developer, it is quite important that Edge can be updated more frequently than the core of Windows.  There are clear advantages when looking at other browsers as to why this would be needed, especially if Edge would auto update for all Windows 10 users that way developers can be confident that when a bug or new feature is announced in Edge, developers c an simply assume all users have that fix or feature and so make development much easier."},{"user":"https://wpdev.uservoice.com/users/826490137-gh","datetime":"2018-07-23","body":"Please make Edge a true \"evergreen\" browser by allowing it to be updated separately from Windows."},{"user":"https://wpdev.uservoice.com/users/725680982-anonymous","datetime":"2017-12-13","body":"Microsoft - Since IE 6 you're making web developers lives miserable. It's time that you align with the standards and stop lagging behind. With the advent of emscripten, asmjs and WASM, more and more products are porting C++ code, the standards are updated frequently and there's a real need for frequent browser updates. If you're looking to maintain or increase the ~8% market share, you'll have to step up. Please consider."},{"user":"https://wpdev.uservoice.com/users/720603883-tim-van-der-horst","datetime":"2017-12-03","body":"Edge is not \"Evergreen\" until it can update without an OS update :("},{"user":"https://wpdev.uservoice.com/users/98744994-ferdy-christant","datetime":"2017-09-21","body":"This issue is my biggest pet peeve right now. In this last year, I've finally seen the Edge team commit and pick up a lot of important issues that consist of core new web technologies with many votes. So the direction and focus overall seems positive."},{"user":"https://wpdev.uservoice.com/users/57670081-c%C3%A9dric-belin","datetime":"2017-08-21","body":"MS Edge is an excellent browser, yet I am still obliged to regularly tell my customers: install Chrome or Firefox. In fact, nothing has changed since IE 11 was abandoned : updating the OS to get the latest version is an option that most of my customers simply can't do."},{"user":"https://wpdev.uservoice.com/users/106024266-jade-ohlhauser","datetime":"2017-05-12","body":"Microsoft: No plans to separate Edge browser updates from Windows 10, \"but never say never\" <a rel=\"nofollow noreferrer\" href=\"https://www.neowin.net/news/microsoft-no-plans-to-separate-edge-browser-updates-from-windows-10-but-never-say-never\">https://www.neowin.net/news/microsoft-no-plans-to-separate-edge-browser-updates-from-windows-10-but-never-say-never</a>"},{"user":"https://wpdev.uservoice.com/users/293938000-bystander","datetime":"2017-05-03","body":"My company is still running on Win 10 RTM.\n<br>Not being able to upgrade Edge makes web dev a nightmare as I have to do everything in VMs with more recent Win 10 releases.\n"},{"user":"https://wpdev.uservoice.com/users/106024266-jade-ohlhauser","datetime":"2017-04-30","body":"<a rel=\"nofollow noreferrer\" href=\"https://mspoweruser.com/rumour-microsoft-to-fix-edges-biggest-problem-with-redstone-3/\">https://mspoweruser.com/rumour-microsoft-to-fix-edges-biggest-problem-with-redstone-3/</a>"},{"user":"https://wpdev.uservoice.com/users/172387878-claude-pache","datetime":"2017-03-14","body":"“As a web developer I can safely assume Firefox and Chrome users are on the latest version...” Uh, as a web developer, I surely know that a significant proportion of Firefox and Chrome installations are out-of-date, even some of them are obsolete for more than a year."},{"user":"https://wpdev.uservoice.com/users/57620331-matthias-kurz","datetime":"2016-10-06","body":"\"... but the engine of Edge will always be updated with Windows Update.\"\n<br>So does this mean also in future the EdgeHTML engine will be updated like only once or twice per year? This sucks. Compare this to the six weeks release cycle that Firefox and Chrome follow."},{"user":"https://wpdev.uservoice.com/users/106024266-jade-ohlhauser","datetime":"2016-10-06","body":"Update: <a rel=\"nofollow noreferrer\" href=\"https://www.thurrott.com/windows/windows-10/82752/microsoft-clarifies-will-update-edge-windows-store\">https://www.thurrott.com/windows/windows-10/82752/microsoft-clarifies-will-update-edge-windows-store</a>"},{"user":"https://wpdev.uservoice.com/users/258386557-aj","datetime":"2016-10-04","body":"100% needs to be updated outside of the OS - I don't care if it's updated in Windows Update or Store Update, but it needs to be independent of the OS. My company is on 1511 and will be for 12+ months because of the required SCCM upgrades to support 1607+, so we are stuck on OEM 1511 Edge 13... just like we are stuck on IE 11... no wonder why all my users just want Chrome."},{"user":"https://wpdev.uservoice.com/users/241087150-art","datetime":"2016-09-13","body":"meant to say \"edge versions*\" and \"force updates\" as in background updates so the end user doesn't need to know. And I would say this common experience should be updated monthly or so, even if this month only :placeholder-shown was added etc."},{"user":"https://wpdev.uservoice.com/users/241087150-art","datetime":"2016-09-13","body":"Please make the version of Rendering in Edge irrelevant. Do this by updating the rendering engine to a common engine across all edge version, and force updates if the user connects to the internet. "},{"user":"https://wpdev.uservoice.com/users/220753692-nils","datetime":"2016-08-17","body":"Would be nice to get a comment from Microsoft on this issue, as it is pretty crucial to modern development. Otherwise it seems like the post-IE era is pretty similar to the regular IE area."},{"user":"https://wpdev.uservoice.com/users/106024266-jade-ohlhauser","datetime":"2016-08-12","body":"Paul Thurrott: Microsoft, It’s Time to Treat Edge Like a Real App\n<br><a rel=\"nofollow noreferrer\" href=\"https://www.thurrott.com/windows/windows-10/75945/microsoft-time-treat-edge-like-real-app\">https://www.thurrott.com/windows/windows-10/75945/microsoft-time-treat-edge-like-real-app</a>"},{"user":"https://wpdev.uservoice.com/users/212226024-khs","datetime":"2016-08-11","body":"+1. please quicken the release cycle."},{"user":"https://wpdev.uservoice.com/users/71236264-leonidev","datetime":"2016-05-31","body":"Edge is not tied to the OS, but is a choise to align major platform updates to the Windows release cadence, as you can read in a comment of a Program Manager of Edge under this blog post: <a rel=\"nofollow noreferrer\" href=\"https://blogs.windows.com/msedgedev/2015/11/16/introducing-edgehtml-13-our-first-platform-update-for-microsoft-edge/\">https://blogs.windows.com/msedgedev/2015/11/16/introducing-edgehtml-13-our-first-platform-update-for-microsoft-edge/</a>\n"}]}