{"id":"11370033","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/11370033-website-shortcuts-on-pc-desktop-using-edge","title":"Website shortcuts on PC desktop using Edge?","body":"With Edge have you dropped the great IE feature of being able to drag and drop a shortcut for a website to our PC desktops for future quick and easy access? I and everyone I know are so used to saving our most visited websites to our desktops as shortcuts and are most annoyed to find that we can't do this with your new Edge browser - please include this feature in Edge otherwise we will have no alternative other than to revert to using IE11 (some of us have already done this).","votes":"57","user":"https://wpdev.uservoice.com/users/136233348-c-smith","datetime":"2016-01-10","comments":[{"user":"https://wpdev.uservoice.com/users/878265796-thecooldave","datetime":"2019-01-04","body":"Here we are, 2019... This is STILL not addressed. Edge is finally at a point where I could use it for everything but, with out this basic feature of EVERY OTHER BROWSER (including Internet Explorer) I stopped using it. "},{"user":"https://wpdev.uservoice.com/users/777347941","datetime":"2018-04-15","body":"lack of this feature is why I don't use edge"},{"user":"https://wpdev.uservoice.com/users/765675301-nash","datetime":"2018-03-12","body":"Yet another reason I don't use Edge. My guess for why they haven't address this, is data mining. They can track what you're bookmarking when you use the way Edge provides, and they can monetize that information. If they allowed you to save a favorite locally then you'd be bypassing their data mining goals they've set with Windows 10."},{"user":"https://wpdev.uservoice.com/users/747607792","datetime":"2018-01-30","body":"Completely agree. This one feature prevents me from using Edge as my primary browser. Back to Chrome and Firefox for me."},{"user":"https://wpdev.uservoice.com/users/745714306-john","datetime":"2018-01-26","body":"yep the feature is pretty useful don't know why the heck they didn't implement it on edge. There is no excuse to this action.\n<br>Other than that it is very annoying to be forced to name the shortcuts in the favorite bar. As form most sites it has a very distinguishable icon that can be easily associated with the web you want. And forcing us to put a name in it will only take space from the favorite bar. I like them to have just icons for my most used one so i can save space in the favorite bar."},{"user":"https://wpdev.uservoice.com/users/403432519-cfuller","datetime":"2017-07-03","body":"I can't believe that CSmith only has 20 votes on this issue! And Mr. Love, doesn't understand what they are asking for???!\n<br>Why would any sane person want to pin a URL to the start menu for a PC??\n<br>The Developers need to put in the old IE Menu bar, with the option to send a URL to the desktop.\n<br>It is much easier to just click on a URL shortcut Icon, on the desktop or folder, than open up the web browser, click on favorites, search for the URL, then click it. \n<br>Having the shortcut to the URL on the desktop is a one, or two click if you are not using one click, to get to the website faster.\n<br>I remember when IE didn't have that option. But the Developers put in after a while. It can't be that hard of a program add feature. I have been using MS since it was DOS, Windows since it was 3.1. The \"Better\" the try to make Windows it seems the more they make it more difficult to work with.\n"},{"user":"https://wpdev.uservoice.com/users/57616277-chris-love","datetime":"2017-01-13","body":"Currently you can pin a URL to the start menu. I know not exactly what you are asking for. "},{"user":"https://wpdev.uservoice.com/users/177137190-peter-fattore","datetime":"2017-01-03","body":"Tried to give Edge a shot, but I use browser to create shortcut files when organizing my files/downloads/etc. I can manually create a link and copy/paste the URL from Edge, but that's a hassle."},{"user":"https://wpdev.uservoice.com/users/166111338-anonymous","datetime":"2016-05-10","body":"Because of this feature being intentionally not included I see no reason to use edge asset all. I never used ie, so I'll just keep using Chrome."}]}