{"id":"11392869","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/11392869-negociate-with-other-major-browsers-maufacturers-o","title":"Negociate with other major browsers maufacturers over a common IL","body":"I think Microsoft, Google and Mozilla should find a table where to sit together and develop a common IL for their browsers. I'm tired of being trapped in javascript and this will leverage a whole lot of languages flavors to be used on the browser scripting side. Furthermore it will be probably easier to cross-browse, to keep a background compatibility and to address security and it will enhance, for sure, the productivity. The learning curves for programmers coming from different languages - that would find something more familiar to work with - will decrease, also the attraction to the client-side coding.\n<br>I think that if half of the effort spent in developing more and more libraries for javascript, to make it decent, would be spent in this direction, in a very short time the VM's for all the major browsers can be done over a common IL, and our chains will broke. It's absolutely abnormal to be forced to load tons of external libraries to make a language efficient, not to mention all criticism around javascript.\n<br>And, of course, one of the languages that will compile to this IL should be javascript.\n<br>Is it so impossible?","votes":"104","user":"https://wpdev.uservoice.com/users/136759839-horatiu-ripa","datetime":"2016-01-12","comments":[{"user":"https://wpdev.uservoice.com/users/151320066-rafa%C5%82-nowak","datetime":"2016-03-13","body":"Look up WebAssembly."},{"user":"https://wpdev.uservoice.com/users/136701327-anonymous","datetime":"2016-02-21","body":"I welcome this idea"},{"user":"https://wpdev.uservoice.com/users/142955280-gt","datetime":"2016-02-04","body":"Why do we need that, there is already a processor and that processor has instructions already :)"},{"user":"https://wpdev.uservoice.com/users/67197968-mike-eee","datetime":"2016-01-30","body":"+1 to the comments so far.  Related vote (from MSFT's/.NET's side, at least): <a rel=\"nofollow noreferrer\" href=\"http://visualstudio.uservoice.com/forums/121579-visual-studio-2015/suggestions/10027638-create-a-ubiquitous-net-client-application-develo\">http://visualstudio.uservoice.com/forums/121579-visual-studio-2015/suggestions/10027638-create-a-ubiquitous-net-client-application-develo</a>"},{"user":"https://wpdev.uservoice.com/users/78011670-stijn-de-witt","datetime":"2016-01-29","body":"Javascript *is* that common IL."},{"user":"https://wpdev.uservoice.com/users/137707479-jason-bock","datetime":"2016-01-15","body":"I absolutely agree with this. There's already something in the works called WebAssembly that should accomplish what you're talking about:"}]}