{"id":"12300414","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/12300414-support-chacha20-poly1305-cipher-suites-in-edge-sc","title":"Support ChaCha20/Poly1305 cipher suites in Edge/Schannel","body":"ChaCha20/Poly1305 cipher suites are considered as the best stream cipher replacement for the obsolete RC4 stream cipher suites. It's also the only AEAD alternative to AES-GCM cipher suites right now.","votes":"193","user":"https://wpdev.uservoice.com/users/32411334-martin-suchan","datetime":"2016-02-11","comments":[{"user":"https://wpdev.uservoice.com/users/162230481-bernd-p","datetime":"2018-08-06","body":"Maybe this is something new for those who are interested. - as update to my former post.\n<br>I recently have reinstalled a Windows 7 Professional box right using a Windows 7 Pro OEM CD with SP 1 integrated - 64bit Version. It was just to test a newer machine.\n<br>Thereafter applied all Patches - also recommended and optional ones - including all Rollups (and the second \"after SP1 Servicepack\" (which is the Windows 7 Convenience Rollup from MS) \n<br>and then continued to patch until it had the current status as of July 2018)."},{"user":"https://wpdev.uservoice.com/users/369811225","datetime":"2017-05-07","body":"An even more general solution would be for Microsoft to expose a .Net interface to add a custom cipher to the cipher suite support for Schannel.  So if I had a C# implementation of chacha20/poly1305, or any future cipher algorithm, I would like to be able to implement the generic cipher  interface to add support in Schannel for the new algorithm  IIS/Edge etc. "},{"user":"https://wpdev.uservoice.com/users/162230481-bernd-p","datetime":"2016-04-25","body":"I also strongly recommend the Addition of ChaCha20-Poly1305 because recently the AES Suites are the only usable modern Cipher Suites within TLS currently . MS also should consider the removal of 3DES Suites (which have no forward Secrecy) on the medium Haul as well as finally remove RC4 and weaker Algorithms everywhere this is possible. Unluckliy there are still too many Servers around providing NO Forward Secrecy and on TLS 1.0 only so we cannot quit using RSA Suites w/o AEAD for now."}]}