{"id":"12506010","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/12506010-add-print-margin-setting-of-none-to-correctly-prin","title":"Add print margin setting of None to correctly print full page HTML5 and PDFs.","body":"I work for a large well known Office Products company. Edge is not capable of correctly printing sheets of labels, business cards, and other products because of the inability to print full sized sheets correctly. This is because the \"Narrow\" margin choice clips the border of the sheet. With a setting of \"None\" this would be corrected. Google Chrome notices that if a page is exactly the size of the sheet of paper it does not rescale. Scaling of 100% could be applied without any margins. Newer printers are capable of having very small margins and even some print to the edge of the paper. Currently we have to tell our clients to open the document with IE 11 to print it correctly. This should not be a difficult change to implement.","votes":"94","user":"https://wpdev.uservoice.com/users/148400682-bn","datetime":"2016-02-28","comments":[{"user":"https://wpdev.uservoice.com/users/866656225","datetime":"2018-11-05","body":"We print many different labels and custom documents that require setting page size and margins.\n<br>IE 11 works fine but edge is useless."},{"user":"https://wpdev.uservoice.com/users/780304351-mike-moxcey","datetime":"2018-04-24","body":"I need it, too. April 2018 now."},{"user":"https://wpdev.uservoice.com/users/750368686","datetime":"2018-02-02","body":"My company needs to print to pre printed forms.  The only option we have with Edge is to print to PDF or give a set of instructions for print settings to remove the URL, Date and Page numbers.  With 100s of thousands of customers, this would mean constant support calls so it is a no-go."},{"user":"https://wpdev.uservoice.com/users/329991481-fix-edge","datetime":"2017-02-12","body":"This is needed badly. Scaling and margin options are critical for many documents. This is a deal breaker for many trying to use edge."},{"user":"https://wpdev.uservoice.com/users/326504353-pete","datetime":"2017-02-07","body":"I have the same issue.  Thanks very much for raising this concern.  Print margins can be adjusted appropriately in Google Chrome, IE 11, Firefox, and Safari. "}]}