{"id":"13777173","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/13777173-will-proxy-api-be-supported-in-microsoft-edge-ex","title":"Will `proxy` API be supported in Microsoft Edge extensions","body":"I currently manage a top Proxy extension in Chrome, and will like to port it to the new Microsoft Edge.","votes":"536","user":"https://wpdev.uservoice.com/users/165458661-steven-g","datetime":"2016-05-08","comments":[{"user":"https://wpdev.uservoice.com/users/873870244-hasyidan-paramananda","datetime":"2018-12-02","body":"Yes, because it easier to on off it with extension than going through windows network setting. For Our General User who don't know how to use or don't have basic in computer, opening proxy setting in network on windows it's hard and too complicated and if we use detailed setting, it will take their time too much..."},{"user":"https://wpdev.uservoice.com/users/855421894-wesley-ranger","datetime":"2018-10-04","body":"Yeah, there are lots of users who need to visit different sites via different proxies. Using a *.pac file is not convenient enough, especially when you have to switch the option rapidly.\n<br>Believe me, that is not for developing purposes, but for regular users (e.g. for those in the mainland China)."},{"user":"https://wpdev.uservoice.com/users/772586530-eric","datetime":"2018-04-01","body":"This is why Microsoft keep losing browser market all the time. Such a basic feature had never been implemented."},{"user":"https://wpdev.uservoice.com/users/762082973","datetime":"2018-03-01","body":"Hi,\n<br>I would have wanted to convert the Nordvpn extension to the used on Edge, but the API"},{"user":"https://wpdev.uservoice.com/users/730076080-shiweiliang","datetime":"2017-12-26","body":"Hi, Steven! What's your extension in Chrome? I really need proxy extensions on Edge like SwitchyOmega, but found that Edge still relies on the system level proxy settings. So sad..."},{"user":"https://wpdev.uservoice.com/users/721835620","datetime":"2017-12-05","body":"I would also like this to be implemented mainly because Browsec requires a proxy API to be able to work on MS Edge.  "},{"user":"https://wpdev.uservoice.com/users/663719767-rustam","datetime":"2017-09-05","body":"Any further information about this API? FF and Chrome already supports it"},{"user":"https://wpdev.uservoice.com/users/397327849-kang-m-x","datetime":"2017-06-18","body":"Hi, Steven! What's your extension in Chrome? I really need proxy extensions on Edge like SwitchyOmega, but found that Edge still relies on the system level proxy settings. So sad..."}]}