{"id":"15241830","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/15241830-at-least-allow-norton-extensions","title":"At least allow Norton extensions","body":"Allow Norton extensions","votes":"637","user":"https://wpdev.uservoice.com/users/192754536","datetime":"2016-07-16","comments":[{"user":"https://wpdev.uservoice.com/users/881650171-todd","datetime":"2019-01-26","body":"WT*!  Support Norton so that we can use Norton products in Edge!"},{"user":"https://wpdev.uservoice.com/users/829963582","datetime":"2018-08-04","body":"Norton Safe Web available on the App Store - a progressive step"},{"user":"https://wpdev.uservoice.com/users/815459764-s-vale","datetime":"2018-06-16","body":"GitHub will no longer support IE11 from july 2018 - its time Microsoft and Norton resolved the regressive experience on Edge, which is a massive inconvenience to users at very least."},{"user":"https://wpdev.uservoice.com/users/782230417-pat-berry","datetime":"2018-04-30","body":"Norton is one of the most popular Internet Security and Antivirus applications that there is. So, why doesn't Microsoft work with Norton?"},{"user":"https://wpdev.uservoice.com/users/772238785-lord-skudley","datetime":"2018-03-30","body":"Until Microsoft Edge supports Norton extensions I will not be using it. "},{"user":"https://wpdev.uservoice.com/users/766570321-concerned-parent","datetime":"2018-03-14","body":"I agree.  It is really bad not to allow disabling of Edge and embedding it into the OS so much and not allowing extensions.  Kids are vulnerable and this aspect makes your OS unusable if you have children and care about trying to help them in their internet usage.  There is no current solution to this, if you do not change your product!  Please tell me if I am wrong on this."},{"user":"https://wpdev.uservoice.com/users/765514654","datetime":"2018-03-11","body":"Please allow Norton Extensions!"},{"user":"https://wpdev.uservoice.com/users/761398867","datetime":"2018-02-28","body":""},{"user":"https://wpdev.uservoice.com/users/744347887-suellen-stewart","datetime":"2018-01-23","body":"The lack of support for Norton extensions in Microsoft Edge is preventing me from using Edge for any important tasks. If you really want users to adopt this browser, you need to fix this issue."},{"user":"https://wpdev.uservoice.com/users/743433667","datetime":"2018-01-21","body":"I am not happy about the fact that windows edge does not allow extentions for from Norton , this would make me very happy if they did so I can feel secure while on the internet"},{"user":"https://wpdev.uservoice.com/users/737239009","datetime":"2018-01-12","body":"Make it compatible with Norton Family please!!!! How am I supposed to protect my family from gross websites when I can't block them on Edge? And with Edge so deeply embedded into the operating system, I can't remove the browser. It's a serious flaw and I expect a simple solution soon to allow Norton to run.  This should be a priority!!!"},{"user":"https://wpdev.uservoice.com/users/735995815-david","datetime":"2018-01-10","body":"you need to allow Norton extensions etc with Edge.  a lot of us use Norton's products.  for now I guess I will stick with firefox and explorer."},{"user":"https://wpdev.uservoice.com/users/343203991","datetime":"2018-01-05","body":"I hope that microsoft are going to let Norton Utilities and security to be allowed to support Edge and windows 10 mail"},{"user":"https://wpdev.uservoice.com/users/277334623","datetime":"2017-12-31","body":"Please get Norton extensions working in Edge as smoothly as they work in Chrome because I really would like to switch my default browser from Chrome to Edge. My Norton Identity Safe extension does install in Chrome, but it's behavior is really quite clunky and not worth fooling with. Please fix this ASAP!\n<br>Thanks!\n<br>Kenn McDermott\n<br>LT, USN (Ret)\n<br>Submarine Qualified"},{"user":"https://wpdev.uservoice.com/users/731074765","datetime":"2017-12-28","body":"Microsoft needs to allow Norton extensions.  If I must use Edge rather than Explorer, then I need to know that I have adequate security.  Thank you. "},{"user":"https://wpdev.uservoice.com/users/727405687","datetime":"2017-12-18","body":"Need you guys to address the Norton extension problem with MS Edge"},{"user":"https://wpdev.uservoice.com/users/727405687","datetime":"2017-12-18","body":"I have been a Norton user for thirty years but may have to switch if you can not support MS Edge."},{"user":"https://wpdev.uservoice.com/users/717613021","datetime":"2017-11-30","body":"We need a Windows 10 update to enable Symantec's Norton Internet Security extension to run on Win 10 -been waiting 1 year already - time to get this fixed guys!  "},{"user":"https://wpdev.uservoice.com/users/713447137","datetime":"2017-11-21","body":"I have been using norton since I purchased my first computer and that was along time ago since it does not work with edge I have tuned it off . That is not a reflection of what I think of edge it is simply A reflection of my age and understanding of computers which I would gues that I am not the only one of my generation the so sooner norton can be used with edge the better for us old fellows "},{"user":"https://wpdev.uservoice.com/users/712795828","datetime":"2017-11-20","body":"I like your new browser but with all the attacks out there i am afraid to use it without the Norton Protection insert. Are there plans to allow for the Norton Extension?? "}]}