{"id":"30929959","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/30929959-ms-edge-extension-with-native-messaging-on-desktop","title":"MS Edge Extension with Native Messaging on Desktop PC - Run UWP App in Background / no UI","body":"We have a classic desktop application on Windows which needs to communicate with the web browsers. Therefore we created web browser extensions and use the native messaging technology to pass messages between the JavaScript on a web page and the native desktop application. This way of communication is currently supported in Google Chrome, Mozilla Firefox and Opera. Now we want to perform the same task in Microsoft Edge. But unfortunately Microsoft Edge supports native messaging in a different way the other browsers do. In Chrome/Firefox/Opera simply a serialized JSON string can be passed to a native messaging host application via stdin/stdout.","votes":"12","user":"https://wpdev.uservoice.com/users/174151581-dominik","datetime":"2017-08-21","comments":[{"user":"https://wpdev.uservoice.com/users/724055287-kuldeep-desai","datetime":"2017-12-10","body":"Hi, We developed something very similar recently. We have the UWP running always, but instead of console app, I am using windows app, and that will automatically run UWP in background and no UI. If there is no need for your user to view UI, you can run something similar, else if that is not the case you can subscribe to disconnect event and show appropriate message to user to run the extension again."},{"user":"https://wpdev.uservoice.com/users/701652376-rram","datetime":"2017-10-29","body":"Hi Dominik, I have nothing to share about the solution to your problem. \n<br>   We are trying to develop something similar to your extension design and want to support windows 10 anniversary edition. So, want to know if you were able to deploy the native messaging extension on windows 10 anniversary update (version 1607) or only after windows 10 creators update ??"}]}