{"id":"35414815","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/35414815-hi-microsoft-peeps-i-m-an-owner-designer-and-pr","title":"Hi Microsoft peeps! I'm an owner, designer and Project manager for VirtualCaseManagement.com I KNOW browsers, our CRM has to work w/ 4 (","body":"Ref:  1. Ability to Stretch data field.  2. Ability to print 'background graphics.     Hi Microsoft peeps!  I'm an owner, designer and Project manager for VirtualCaseManagement.com, I KNOW browsers!!  Our CRM works w/ 4 (Chrome, Edge, FF, Safari).  I'd use Edge and would rather but can't based on two (2) issues.  This means all our customers that user our VCM product are having to use other browsers than Edge due to this.  Please fix these two issues, PLEASE.  ISSUE 1.  My other business 25 yrs. (Counter-Intelligence.com) where I'm an Investigator and use VCM to type within Case Logs and note sections.  When the GUI graphic box isn't wide enough I need to stretch the box so I can see and type.  Chrome lets you do this... while a simple feature... its a huge issue when working within a CRM and most businesses today use a CRM.  I would think you would want to fix this ASAP.  2.  When our CRM prints reports or invoices... we have some gray shadowing (I can share an image if you like).  That gray shadowing really makes a big difference into how the document prints.  The shadowing shows on the screen and GUI within Edge, but when you print the report or invoice... the shadowing goes away, looking bad!  In Chrome for example, when you PRINT... in their options next to margins there is a checkbox (radio button) to turn on or off background graphics.   Can you please address these two issues... if you did... I would use Edge and push Edge to all of our customers.  FYI:  On a side note, I guess I'm an 80's kid and love MS and I'm also a USAF Vet and I do NOT like how Google searching appears to be biased along with them snubbing congress when they asked them to show.  I say take them down and gain market share, perfect timing.  Lastly congrats, I see you bypassed them in value recently... you got that back now crush them arrogant fools ;)  Just my tidbit for the day.  Thanks MS... I'll share this on <a rel=\"nofollow noreferrer\" href=\"mailto:MSWish@Microsoft.com\">MSWish@Microsoft.com</a> if that's still around these days.  Peace","votes":"1","user":"https://wpdev.uservoice.com/users/850736584-darren-epstein","datetime":"2018-09-15","comments":[]}