{"id":"36189295","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/36189295-please-be-careful-with-making-edge-chromium-based","title":"Please be careful with making Edge Chromium-based","body":"I've recently read articles about the engine of Edge is being replaced by Chromium.","votes":"103","user":"https://wpdev.uservoice.com/users/874163035-highbaser","datetime":"2018-12-04","comments":[{"user":"https://wpdev.uservoice.com/users/242025415-gpotter2","datetime":"2019-05-06","body":"&gt; please optimize Google's bloated rendering"},{"user":"https://wpdev.uservoice.com/users/726022756","datetime":"2019-02-28","body":"What does it even mean for Edge to be \"Chromium-based\"? Do we still turn to wpdev.uservoice.com to request new features?"},{"user":"https://wpdev.uservoice.com/users/746717608-hm-the-gold-link","datetime":"2018-12-17","body":"Edge has failed to implement some standards like CSS Blend Modes so chromium May be better for Edge"},{"user":"https://wpdev.uservoice.com/users/875500843-jacinto-ossatur","datetime":"2018-12-13","body":"It's really sad to know that. I use Edge because it's fast and takes less memories. "},{"user":"https://wpdev.uservoice.com/users/874623121","datetime":"2018-12-07","body":"Today I tried Facebook's web UI with the latest version of Edge and the latest version of Chrome. Edge is much more performant, faster, scrolls smoothly and more responsive than Chrome. And it's not because Edge has a semi-animated scrolling effect when smooth scrolling is enabled. It's just seamless. Without any jagging during preloading further posts to an infinite scroll area. Chrome is slower, has almost no usable hardware acceleration at all with ATI drivers and it's a step backwards to use it. It is a very bad idea to switch to Chromium. EdgeHTML should be kept."},{"user":"https://wpdev.uservoice.com/users/251788516-x-l","datetime":"2018-12-06","body":"Microsoft, please don't switch to Chromium. A lot of people love MS Edge, and want to use it. It's important that there are as many independent implementations of web engines as possible, to make the web standards more robust and more thoroughly tested. I really don't want to see Google Chromium to become too big, so that Google can solely dictate what the web spec looks like."}]}