{"id":"6508429","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/6508429-web-midi-api","title":"Web MIDI API","body":"Defines an API supporting the MIDI protocol, enabling web applications to enumerate and select MIDI input and output devices on the client system and send and receive MIDI messages.","votes":"1,212","user":"https://wpdev.uservoice.com/users/54127722-jonathan-sampson-msft","datetime":"2014-10-01","comments":[{"user":"https://wpdev.uservoice.com/users/910757557-ahmad-suhaib","datetime":"2019-07-14","body":"Hey I hope this helps someone! You guyz can also look at <a rel=\"nofollow noreferrer\" href=\"https://www.jlsprockets.com/\">https://www.jlsprockets.com/</a> as Jue Lang is expanding itself globally after collaborating with DID Chains in China.\n<br>Jue Lang manufactures sprockets, chains as well as many other things and sell its products across the world.\n<br>Now JL Sprockets is giving its distributorship. Check it out on the website. Click on the above link."},{"user":"https://wpdev.uservoice.com/users/852117115","datetime":"2018-09-22","body":"<a rel=\"nofollow noreferrer\" href=\"https://wpdev.uservoice.com\">https://wpdev.uservoice.com</a>"},{"user":"https://wpdev.uservoice.com/users/848126656-karan","datetime":"2018-09-10","body":"This is really nice and gool"},{"user":"https://wpdev.uservoice.com/users/287464238-darrick-west","datetime":"2018-01-28","body":"Another glaring example of a lack of consumer understanding/needs. MIDI is/has been a thing since 1981. Yet, MS has lagged in its support in modern implementations. Fix this!"},{"user":"https://wpdev.uservoice.com/users/398414329-michael-scott-cuthbert","datetime":"2017-10-10","body":"Microsoft edge is the only major browser that does not have some way of reading MIDI input either through the WebMIDI API (Chrome) or the Jazz-midi plugin (Safari, Firefox, IE).  Supporting the API is crucial for those of us working on music web applications.  Thanks!"},{"user":"https://wpdev.uservoice.com/users/679004143","datetime":"2017-10-03","body":"It is important to prepare the environment for music production."},{"user":"https://wpdev.uservoice.com/users/678769246-kazuhiro-hoya","datetime":"2017-10-03","body":"MIDI is not a standard to control the music instrument but to control and describe how machines and physical environments are to controlled.\n<br>Web MIDI API shall be a powerful tool in the era of IoT, or WEB-Machine synthesised entities are there."},{"user":"https://wpdev.uservoice.com/users/678663814-kazuhira-degawa","datetime":"2017-10-03","body":"I think there is demand in future MIDI devices environments that web application support MIDI protocol. I would like that will be realized."},{"user":"https://wpdev.uservoice.com/users/678509089-akira-inoue","datetime":"2017-10-02","body":"Hi, I am a technical evangelist for Microsoft Japan. As you know, we have a lot of partners like YAMAHA, Roland, KORG, etc, who are working for musical instruments, professional audio, musical education, etc, in Japan. And, the implementation of Web MIDI API on Edge is so important for them and our partner business. I definitely hope this support."},{"user":"https://wpdev.uservoice.com/users/338024062-kerem-goksel","datetime":"2017-02-27","body":"Any updates on this ? WebAudio support has been there for a bit, and WebMidi&nbsp;looks really promising&nbsp;on Chrome."},{"user":"https://wpdev.uservoice.com/users/161935896-andreas","datetime":"2016-04-23","body":"It's great that windows store apps support MIDI now, why dont go the next step and enable Web MIDI now."},{"user":"https://wpdev.uservoice.com/users/108023985-bj%C3%B6rn-melinder","datetime":"2015-10-03","body":"They do support web audio API now!!! This is really awesome and opens up a whole new world of audio apps on the web! So how about adding support for web midi api too? It is a fairly small and simple api to support, already supported in Chrome and (partly) Firefox. In Chrome it, \"just works\" so if you have a midi keyboard connected to your computer, you can go to any website with a web audio synth and start playing right away. Pretty amazing!"},{"user":"https://wpdev.uservoice.com/users/77413386","datetime":"2015-05-21","body":"yes Please!! a step toward the future"},{"user":"https://wpdev.uservoice.com/users/63468001-alexander","datetime":"2015-01-15","body":"Please.. ^______^"},{"user":"https://wpdev.uservoice.com/users/58090252","datetime":"2014-10-10","body":"Well, they're WAY behind to LEAD with audio/music innovation on the web.  In fact, they're the only browser without web audio today."},{"user":"https://wpdev.uservoice.com/users/58027632","datetime":"2014-10-09","body":"It would be *so* nice if MS could lead with audio/music innovation. Please..."}]}