{"id":"6508572","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/6508572-mathml","title":"MathML","body":"An application of XML for describing mathematical notations and capturing both its structure and content.","votes":"4,395","user":"https://wpdev.uservoice.com/users/54127722-jonathan-sampson-msft","datetime":"2014-10-01","comments":[{"user":"https://wpdev.uservoice.com/users/899030338-pedro-milliet","datetime":"2019-05-06","body":"As an accessibility expert for ABC (Accessible Books Consortium / WIPO) and DAISY Consortium, we need it!"},{"user":"https://wpdev.uservoice.com/users/296215408","datetime":"2019-03-05","body":"MathML is critical for all major browsers. Presentational MathML would do, Contextual (forgot the correct term) MathML would be even better. At least, a technology that is shared by all major browsers. TeX Math could be a candidate. Bottom line: We NEED math formulas in html. Images (png, jpg) is simply not enough!"},{"user":"https://wpdev.uservoice.com/users/57919249","datetime":"2019-01-09","body":"For those who missed it, Microsoft Edge is switching to Chromium:\n<br><a rel=\"nofollow noreferrer\" href=\"https://blogs.windows.com/windowsexperience/2018/12/06/microsoft-edge-making-the-web-better-through-more-open-source-collaboration/\">https://blogs.windows.com/windowsexperience/2018/12/06/microsoft-edge-making-the-web-better-through-more-open-source-collaboration/</a>"},{"user":"https://wpdev.uservoice.com/users/169703808-franklin-yu","datetime":"2018-09-18","body":"@Lynn AFAIK, Google Chrome does *not* support MathML (see <a rel=\"nofollow noreferrer\" href=\"https://developer.mozilla.org/en-US/docs/Web/MathML#Browser_compatibility\">https://developer.mozilla.org/en-US/docs/Web/MathML#Browser_compatibility</a> ). I'd love MathML in Edge (I voted), but please don't spread wrong information."},{"user":"https://wpdev.uservoice.com/users/851226019-lynn-holdsworth","datetime":"2018-09-18","body":"Dear Microsoft, please add MathML or get left behind. I work for an organisation that wants to use Edge to deliver maths tests to schoolchildren. But guess what? That's not possible. So we're recommending Google Chrome ... Just in case you missed it, that's GOOGLE CHROME. Why is Microsoft always dragging its feet when it comes to web standards? Can't you just for once do what almost every other browser vendor is doing? Are you incompetent or uncaring? It's one or the other."},{"user":"https://wpdev.uservoice.com/users/821270590-david-cardon","datetime":"2018-07-07","body":"Everyone in the physical and mathematical sciences, as well as engineers, need good support for math formulas."},{"user":"https://wpdev.uservoice.com/users/819002188","datetime":"2018-06-29","body":"This should be really implemented.\n<br>All that talk about creativity and work effectiveness in Windows 10 will appear ridiculous if you cannot even read a book with mathematical formulas."},{"user":"https://wpdev.uservoice.com/users/57825490-meteorhead","datetime":"2018-05-05","body":"This feature request is the 11th most wanted addition to Edge. 1803 has come and gone by and many commenters have added this feature also has accessibility implications. I'm just a low-life physicist and HPC programmer and I just find it ridiculous that in 2018 Wikipedia still has to serve equations as raster images as being the most reliable means of conveying math across the web."},{"user":"https://wpdev.uservoice.com/users/666975019-charles-lapierre","datetime":"2018-03-14","body":"Publishers (such as Macmillan Learning) are asking how to include math into their EPUB publications.  Since EDGE supports EPUB, adding support for MathML is critical.  Accessibility of math is a serious problem and support for MathML will be of great benefit  for students using AT.  Currently the only option for publishers is to add only an Image of the math and maybe a description of the math in alt but that puts on a tremendous cognitive load on the user especially for complex math equations.  Benetech's Global Certified Accessible to certify EPUBS as conforming to 1.0 Accessibility EPUB specification recommends publishers add the mathML to their EPUBs and Edge not supporting this will prevent students from using EDGE's EPUB reader to access these STEM books.\n<br>Thanks\n<br>Charles LaPierre\n<br>Technical Lead, Born Accessible\n<br>Benetech"},{"user":"https://wpdev.uservoice.com/users/240789214","datetime":"2018-02-27","body":"According to <a rel=\"nofollow noreferrer\" href=\"https://bugs.chromium.org/p/chromium/issues/detail?id=6606\">https://bugs.chromium.org/p/chromium/issues/detail?id=6606</a> Chromium will implement MathML on top of LayoutNG and Custom Layout, which are on development now."},{"user":"https://wpdev.uservoice.com/users/717112786","datetime":"2017-11-29","body":" As a STEM professional and mentor of others in the same area, this is imperative.  I have degrees in Engineering, Engineering Psychology, Human Computer Interaction, and Computer Science and this feature is sorely needed."},{"user":"https://wpdev.uservoice.com/users/683653258","datetime":"2017-10-13","body":"Please add Math ML, so folks who use screen readers have equal access to the same content as sighted people."},{"user":"https://wpdev.uservoice.com/users/682847689","datetime":"2017-10-11","body":"Adding this is highly important"},{"user":"https://wpdev.uservoice.com/users/682367020-popol","datetime":"2017-10-10","body":"Neeeeeeeeeeeeeeed !!! For my app, in a WebView.\n<br>Please ! "},{"user":"https://wpdev.uservoice.com/users/681941479","datetime":"2017-10-09","body":"Hello Microsoft:\n<br>    It'll be great if you add this MathML rendering feature in Edge so that it can be read by the assistive technology like JAWS and NVDA giving a wholistic user experience. I think more distinguishing feature would be to expose this MathML content to screen readers in other input file format like epub opened by edge browser for which most other  epub readers has no or very poor support."},{"user":"https://wpdev.uservoice.com/users/673765612","datetime":"2017-09-23","body":"As Microsoft has put a huge effort into accessibility matter, my humble submission is to continue support for standarisation of accessibility features of MathML in Edge that would be a great step in improving math accessibility for the Visual Impaired."},{"user":"https://wpdev.uservoice.com/users/673425550","datetime":"2017-09-22","body":"Accessible math. Of course!"},{"user":"https://wpdev.uservoice.com/users/672983368-deanna-mccusker","datetime":"2017-09-21","body":"Support for MathML in Edge would be a great step in improving math accessibility for the blind.  I've seen how Microsoft has put a huge effort into accessibility in the past few years, this is necessary to continue that effort."},{"user":"https://wpdev.uservoice.com/users/672910984-derek-riemer","datetime":"2017-09-21","body":"Dear Microsoft:\n<br>I continue to be impressed with your dedication to ensuring accessibility over the past couple of years. As a blind computer scientist, I can ensure you that access to math is one reason so many people who are blind drop out of college. It is not easy to pass math classes as a sighted person, and it is at least an order of magnitude harder for a blind person, especially in upper division math. Since I was doing my math classes both before, and after mathml started becoming ubiquitous in the mainstream, I can't even explain how much easier it was to find resources. Since a large chunk of the web uses mathjax to render math, and mathjax offers me access to mathml, I was able to access much more math on the web in an accessible way. The entirety of wikipedia uses mathml for accessibility, as an example. Once Edge can expose mathml to assistive technologies, Microsoft will open many many doors for education.\n<br>Cheers,\n<br>Derek"},{"user":"https://wpdev.uservoice.com/users/672895228-joe-martin","datetime":"2017-09-21","body":"Can you imagine trying to do math blind?  MathML at least makes this more feasible, and is a very important feature to a lot of people.  Please implement MathML into Microsoft Edge."}]}