{"id":"6509745","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/6509745-please-make-a-good-javascript-console-that-can-re","title":"Please, make a good javascript console that can really aid in the debugging process.","body":"There is a Debug tab that is very powerful. Glancing at the comments it seems most of you want what is in the debugger, not the console.","votes":"108","user":"https://wpdev.uservoice.com/users/57621969","datetime":"2014-10-01","comments":[{"user":"https://wpdev.uservoice.com/users/57616277-chris-love","datetime":"2017-01-13","body":"There is a Debug tab that is very powerful. Glancing at the comments it seems most of you want what is in the debugger, not the console."},{"user":"https://wpdev.uservoice.com/users/57679868-michal-kova%C5%99%C3%ADk","datetime":"2016-03-13","body":"To be honest. I absolutely hate working with Edges and/or Visual Studio console (they're basically the same). There's no stacktrace, no details, no nothing. Just random generic errors without any helpful description which makes developing app for Windows a nightmare."},{"user":"https://wpdev.uservoice.com/users/79756764-steven-johnson","datetime":"2015-06-05","body":"Full disclosure, I'm talking about IE11 dev tools here. I don't have Edge yet. Maybe some of this is cleaned up :-)"},{"user":"https://wpdev.uservoice.com/users/66240161-prehistoricman","datetime":"2015-04-03","body":"Basically the line where you type should be an IDE. It should have 4 space tabs, syntax error checking and syntax highlighting. This would make the console so nice to work with."},{"user":"https://wpdev.uservoice.com/users/61041011-joel-bennett","datetime":"2014-12-03","body":"I suspect they wish it works similar to the Chrome javascript console.  In Chrome, it's possible to edit the javascript directly, and have it re-run with those edits in place.  It makes it quite a bit faster to debug things when making small changes."},{"user":"https://wpdev.uservoice.com/users/58756845-david-stephens","datetime":"2014-10-23","body":"Hi, I work on the console. Always looking for ways to make it better! How is the current console getting in your way? What sorts of improvements are you picturing?"}]}