{"id":"6511939","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/6511939-open-source-core-components","title":"Open source core components","body":"Please open source the core components of Internet Explorer (Trident &amp; Chakra). Microsoft in a position to do some serious good in the world, please help move the web forward together as a team – you don't have to do this alone.","votes":"529","user":"https://wpdev.uservoice.com/users/57644448-tim-oxley","datetime":"2014-10-02","comments":[{"user":"https://wpdev.uservoice.com/users/359939050-amber","datetime":"2017-04-18","body":"Please make EdgeHTML layout engine open source the same way Chakra Core has been released to the public. We are keen to contribute to it's success."},{"user":"https://wpdev.uservoice.com/users/57666555-merih-akar","datetime":"2015-12-19","body":"I'm surprised that nobody ever mentioned the news here yet:"},{"user":"https://wpdev.uservoice.com/users/77392602","datetime":"2015-05-21","body":"When looking at the browsing landscape, we see a healthier ecosystem than even five years ago. A large part of that is due to Mozilla, Apple, and Google's competition with Microsoft's own browsers. This has created a lot of work for you guys, but the web is allowing us to do some amazing things we would never have thought of in the dark days. And it has forced you to being your A game."},{"user":"https://wpdev.uservoice.com/users/77392602","datetime":"2015-05-21","body":"I specifically would like to have Chakra open sourced. Use cases I can foresee? First, with the split of IO.js and node.js, and the Chakra compatability work that has gone into the Windows 10 implementation, Chakra as backed by Microsoft's commitment to updates represents a stable and fast implementation of the backbone of the web. It could be a real competitor."},{"user":"https://wpdev.uservoice.com/users/75170859","datetime":"2015-05-06","body":"open source means not always that the software is better or more secure."},{"user":"https://wpdev.uservoice.com/users/60742295-noah-collins","datetime":"2014-11-28","body":"Opening the IE core would be a major undertaking, but it's hard to overestimate the amount of sustained goodwill this move would generate, not to mention the knock-on effects for IE's long-term viability."},{"user":"https://wpdev.uservoice.com/users/59731850-hulk","datetime":"2014-11-13","body":"Worst and slowest? Huh! Did you use IE, my friend?"},{"user":"https://wpdev.uservoice.com/users/57702647-marco-kaiser","datetime":"2014-11-12","body":"@Hulk Are you crazy? Webkit is the worst and slowest Engine on the Market. "},{"user":"https://wpdev.uservoice.com/users/59731850-hulk","datetime":"2014-11-11","body":"The best what we can do with IE (when it will become with open source) - we can take webkit core and pull interface of IE on it."},{"user":"https://wpdev.uservoice.com/users/54127722-jonathan-sampson-msft","datetime":"2014-11-07","body":"Abdullah, I am sorry you feel this way. Our team is presently working intently to remedy the big issues that we feel developers have with Internet Explorer, namely compatibility and application of standards. We continue to make great progress in both of these areas, but are always interested in where you (the community) feel we could improve. What specific issues make Internet Explorer \"horrible\"? We genuinely care, and are motivated to improve."}]}