{"id":"6513417","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/6513417-change-development-cycle-for-frequent-updates","title":"Change development cycle for frequent updates","body":"IE falling behind before it was released. All major browsers has release cycles less than IE has between announcement and release.\n<br>Also, old version do not get updates.\n<br>Drop version from name and start actively supporting IE.","votes":"378","user":"https://wpdev.uservoice.com/users/57663507-vlad-svoka","datetime":"2014-10-02","comments":[{"user":"https://wpdev.uservoice.com/users/59869407-manumanu","datetime":"2015-07-09","body":"Agreed ! Edge MUST be a standalone (not updating via Windows Update !!) AND have a short cycle development ! Not just minor updates, but implement new things all over the time, like Chrome and Firefox. They proved it's the better way for a browser to evolve. You can't let Edge getting the same long, unchanging cycle as IE."},{"user":"https://wpdev.uservoice.com/users/54127722-jonathan-sampson-msft","datetime":"2014-11-08","body":"Internet Explorer has been receiving regular updates through \"patch Tuesday\" updates for some time now. A couple of days ago we published a response to the top request \"Auto Update Older IE Versions\" that shared more detail: <a rel=\"nofollow noreferrer\" href=\"https://wpdev.uservoice.com/forums/257854-internet-explorer-platform/suggestions/6509607-auto-update-older-ie-versions\">https://wpdev.uservoice.com/forums/257854-internet-explorer-platform/suggestions/6509607-auto-update-older-ie-versions</a>."},{"user":"https://wpdev.uservoice.com/users/59485306-ariel-scarpinelli","datetime":"2014-11-06","body":"You have to release monthly, as other mainstream browsers are doing"},{"user":"https://wpdev.uservoice.com/users/57817155-lv","datetime":"2014-10-05","body":"And updates out of integrated \"Windows Update\" center so updates are not dependent on system settings (big problem in company computers where users just have some old version from their company)."},{"user":"https://wpdev.uservoice.com/users/57701174-andrey","datetime":"2014-10-03","body":"Development cycle shall be more frequent and updates shall be available for all supported Windows versions. For example, currently it's impossible to install IE11 on Windows 8 without updating to 8.1. But platform update is much more complicated way in enterprises."},{"user":"https://wpdev.uservoice.com/users/57663507-vlad-svoka","datetime":"2014-10-02","body":"By updates, I mean automatic and frequent updates, user can opt out from."}]}