{"id":"6720031","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/6720031-gamepad-api-support-gamepad-vibration-force-fee","title":"Gamepad API: Support Gamepad Vibration & Force Feedback effects","body":"There is the proposed Gamepad API <a rel=\"nofollow noreferrer\" href=\"http://caniuse.com/#search=gamepad\">http://caniuse.com/#search=gamepad</a> in development, however the specification does not have any planned means of utilizing vibration in gamepads.\n<br> \n<br>It is a rather basic feature that enhances the gaming experience.\n<br>There should be a recommendation for it or prefixed functionality for IE. A complementary function to the API like myGamepad.setVibration(leftMotor, rightMotor) would be ideal.","votes":"8","user":"https://wpdev.uservoice.com/users/59240855-alexander-vourtsis","datetime":"2014-11-14","comments":[{"user":"https://wpdev.uservoice.com/users/308187559-david","datetime":"2017-01-16","body":"How about enabling the use of a Game Pad to control the browser itself?\n<br>I find that using a mouse can be very difficult at times due to my inability to control my arm movements; I am losing the feeling in my fingers and hands, along with having extreme muscle spasms during relatively minor arm movements.\n<br>Game Controllers, with their mini-joysticks and fingertip sized buttons allow me to (mostly) control my characters while playing games on my XBox and PS4 consoles.\n<br>Might there be a way to 'port this into my Edge Browser? \n<br>I've been told my folks in charge of the other two major browsers that they can't do anything for me, or with my idea. And, the different manufacturers of the various game controllers have all said that my idea is impossible. Is it?\n<br>Is this even the right place to post this? Nobody seems to consider those of us with such minor disabilities as worthy of consideration (just my own experiences here). "},{"user":"https://wpdev.uservoice.com/users/57613576-david-storey-msft","datetime":"2014-11-19","body":"As this isn’t part of the spec, I’d recommend checking with the W3C Working Group that is specifying the Gamepad API."}]}