{"id":"8437039","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/8437039-full-feature-support-for-indexeddb","title":"full feature support for Indexeddb","body":"IE support only basic feature of IndexedDB specification <a rel=\"nofollow noreferrer\" href=\"http://www.w3.org/TR/IndexedDB/\">http://www.w3.org/TR/IndexedDB/</a>. Data intensive web app using full specification are not able to run on IE. Specifically missing feature are compound index, complex key path, multiEntry index and storing blob.","votes":"678","user":"https://wpdev.uservoice.com/users/81637030-kyaw-tun","datetime":"2015-06-16","comments":[{"user":"https://wpdev.uservoice.com/users/908365156-johan-sottovia","datetime":"2019-06-24","body":"Need it or finally we will no longer provide support for Microsoft browsers for our Mobile application."},{"user":"https://wpdev.uservoice.com/users/845324287-doug-reeder","datetime":"2018-08-30","body":"multiEntry is required to implement full-text search in IDB, as seen at <a rel=\"nofollow noreferrer\" href=\"https://serenenotes.hominidsoftware.com/\">https://serenenotes.hominidsoftware.com/</a> , which works properly in all other modern browsers."},{"user":"https://wpdev.uservoice.com/users/787381504-evan-nowak","datetime":"2018-05-15","body":"We rely on compound keys for indexing large chunks of cached data.  Without this, this data needs to be re-transmitted on each load."},{"user":"https://wpdev.uservoice.com/users/692052025-jeff-barnes","datetime":"2018-02-27","body":"Now supported in every other browser except IEdge...\n<br>This is the only reason I'm blacklisting MS browsers currently."},{"user":"https://wpdev.uservoice.com/users/710411437-korn%C3%A9l-tak%C3%B3","datetime":"2017-11-15","body":"1 Vote more to get indexedDB 2 also in MS Browsers "},{"user":"https://wpdev.uservoice.com/users/307293589-luke-mcdougald","datetime":"2017-11-04","body":"This really shouldn't still be under review. If this isn't rectified by the next feature release I'll likely have to blacklist the browser for my application."},{"user":"https://wpdev.uservoice.com/users/664678006-rinsheed","datetime":"2017-09-07","body":"Hi, I am facing a weird issue related to indexeddb. I have a function that gets the records from the indexeddb. It works fine while I call it from the console or by binding the function call to an element using jquery.click. "},{"user":"https://wpdev.uservoice.com/users/400450225-joe","datetime":"2017-06-26","body":"Can Microsoft update the status page? Safari has full support for these features, but the status page indicates that it is not supported in Safari. It would also be helpful to update your MSDN documentation on IndexedDB to indicate that Edge and IE do not currently support these features. It is really confusing to only partially support an HTML5 spec and not indicate that in your documentation."},{"user":"https://wpdev.uservoice.com/users/65133755-ryan","datetime":"2017-04-29","body":"Come on guys - this is nuts you don't have this fixed yet.  It's been years.  Safari has gone from WebSQL, which you never had - have removed it, introduced their horrible bug in their implementation of indexeddb and have already fixed that.  MS is moving the slowest of any browser on this - and it's been years now I've been up voting this issue..."},{"user":"https://wpdev.uservoice.com/users/287074265-benny-neugebauer","datetime":"2016-11-23","body":"Any update on this? Compound indexes would be really nice to have! :)"},{"user":"https://wpdev.uservoice.com/users/53133982-microsoft-edge-developer-uservoice","datetime":"2015-08-18","body":"This can be tracked on our status page at <a rel=\"nofollow noreferrer\" href=\"https://dev.modern.ie/platform/status/indexeddbarraysandmultientrysupport/\">https://dev.modern.ie/platform/status/indexeddbarraysandmultientrysupport/</a>"},{"user":"https://wpdev.uservoice.com/users/83732767-nolan-lawson","datetime":"2015-06-28","body":"Why do you say storing blobs? In PouchDB, we haven't seen any issues storing blobs in either IE10 or IE11, and according to HTML5Test they are supported: "}]}