{"id":"9467958","link":"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/9467958-edge-extensions-net-compatibility","title":"EDGE EXTENSIONS .NET COMPATIBILITY","body":"I see that this vote was taken down (which is completely against the spirit of a *community* telling YOU what THEY want).\n<br><a rel=\"nofollow noreferrer\" href=\"https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/6545194-better-net-based-extensions\">https://wpdev.uservoice.com/forums/257854-microsoft-edge-developer/suggestions/6545194-better-net-based-extensions</a>","votes":"244","user":"https://wpdev.uservoice.com/users/67197968-mike-eee","datetime":"2015-08-24","comments":[{"user":"https://wpdev.uservoice.com/users/146006067-zaryab-haider","datetime":"2016-02-17","body":"Well Unfortunately I have an web application basically developed in ASP classic and is rich with ActiveX controls to access hardware.. So basically the problem is Edge brings the end of ActiveX support and also other browsers are ending up support for NPAPI plugins as well. \n<br>We are going for cross browsers so I need a suggestion is there any way to replace those ActiveX controls with some other tech to make it work with compatibility of cross browsing platform? "},{"user":"https://wpdev.uservoice.com/users/144226356-jason-r","datetime":"2016-02-09","body":"If you're going to emulate flash, you should also emulate .net/silverlight as well."},{"user":"https://wpdev.uservoice.com/users/112821327-some-idiot","datetime":"2016-02-03","body":"Thanks for your feedback, Kai.  To be sure, this ask is for tooling around the Extensions API exactly like you suggest in regards to an asm.js/WebAssembly.  "},{"user":"https://wpdev.uservoice.com/users/67944573-kai1457","datetime":"2016-02-03","body":"I don't think this is a good idea. It'll be another ActiveX style situation."},{"user":"https://wpdev.uservoice.com/users/67197968-mike-eee","datetime":"2015-10-03","body":"OK I have spent the past few months putting a site together to better articulate my position around this concept and the general ask here.  The core of the issue is that promoting HTML5/JS is an incompatible strategy with other Microsoft properties.  Namely, the Windows Store and ... well, pretty much every technology under its IP portfolio, LOL.  However, that doesn't mean it's incompatible or that there isn't a solution."},{"user":"https://wpdev.uservoice.com/users/67197968-mike-eee","datetime":"2015-09-04","body":"Wow, that was a LOT longer post than I thought it was, LOL!"},{"user":"https://wpdev.uservoice.com/users/67197968-mike-eee","datetime":"2015-09-04","body":"There has been some great discussions here and I (again) want to thank the Edge team and in particular David Storey for providing input and perspective.  It's helped shaped my own thoughts around this and also made me realize that what I am after is bigger than the Edge group in particular (although they should most definitely be involved in some capacity)."},{"user":"https://wpdev.uservoice.com/users/74991999-cyprien-autexier","datetime":"2015-09-04","body":"I think the original suggestion has been taken down because discussion was becoming non constructive."}]}