{"id":"11669709","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/11669709-smb-network-file-shares-should-be-supported-on-a","title":"SMB (Network file shares) should be supported on all device families other than just Desktop","body":"It is really sad that I cannot just grab my phone, go to file explorer and tap on a video I want to play that is on my local network. This is ridiculous.","votes":"84","user":"https://wpdev.uservoice.com/users/15024431-daniel-armstrong","datetime":"2016-02-01","comments":[{"user":"https://wpdev.uservoice.com/users/376088833-jose-m","datetime":"2017-05-16","body":"This feature will be specially interesting for xbox! It's really frustrating we can't access our media library from xbox"},{"user":"https://wpdev.uservoice.com/users/54077101-lukas","datetime":"2017-02-08","body":"Agreed, it is very disappointing that you buy a new WP device and you are not able to connect to Homegroup PCs on your local WiFi network... This should be possible for end users (file explorer) as well as developers (API)."},{"user":"https://wpdev.uservoice.com/users/231676795-william-bradley","datetime":"2016-10-11","body":"We need the ability to access SMB files on platforms such as Windows 10 Mobile and Xbox, currently, when attempting to access from anywhere other than the desktop, it doesn't show up in any FilePicker, and attempting it via code, results in FileNotFound Exceptions."},{"user":"https://wpdev.uservoice.com/users/174928635-d21mike","datetime":"2016-06-12","body":"This is definitely NOT a customer \"only\" feature.  All of my source code and scripts are on Network Shares.  We have multiple developers with access to these Shares."},{"user":"https://wpdev.uservoice.com/users/15024431-daniel-armstrong","datetime":"2016-02-01","body":" This is not consumer feature as windows phone 8 platform itself can not access smb shares. This is missing feature for developers!"},{"user":"https://wpdev.uservoice.com/users/112153788-jens-olander","datetime":"2015-10-19","body":"It should be possible to access shared folders in a local network using the smb-protocol from windows mobile phones"},{"user":"https://wpdev.uservoice.com/users/71714145-cedric-haegeman","datetime":"2015-04-14","body":"As long as WP does not support browsing shared folders and streaming content from them out of the box (I really feel like it should!) it would be nice to have an SMB API so developers can create third party apps capable of doing this."},{"user":"https://wpdev.uservoice.com/users/58048274-anonymous","datetime":"2014-10-09","body":"Dear. WP dev support... I this is not consumer feature as windows phone 8 platform itself can not access smb shares, so no one can write app that can access network drives.... Should have brought android..."},{"user":"https://wpdev.uservoice.com/users/22868936-anonymous","datetime":"2012-04-04","body":"I have a file server which hosts a lot of my documents, pictures and music. With Android it´s easy to browse the server with \"ES File Explorer\". This is single reason why I keep my Android phone around.\n<br>I really wish it was possible to access my file server from my Lumia 800 too.\n<br>It´s not only tedious to use Zune for copying my files over, it´s also creating redundancy by keeping copies on another device.\n<br>Yet another reason - it uses valuable space on my Lumia 800 which wouldn´t be necessary if I could acces the file on the file server.\n<br>Yet yet another reason - it makes sense for a company/university to share docxs/pdfs for instance to be accessed by the employees from one shared location."}]}