{"id":"13052589","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/13052589-uwp-input-validation","title":"UWP Input Validation","body":"As an enterprise developer we need a richer set of Line of Business features. Input validation is fundamental to business applications and should not require us to roll our own or find a 3rd party solution.","votes":"172","user":"https://wpdev.uservoice.com/users/153050619-brian-hussey","datetime":"2016-03-20","comments":[{"user":"https://wpdev.uservoice.com/users/158611122-thomas-claudius-huber","datetime":"2019-01-27","body":"Note that I've added an issue on the Github page for this item: <a rel=\"nofollow noreferrer\" href=\"https://github.com/Microsoft/microsoft-ui-xaml/issues/179\">https://github.com/Microsoft/microsoft-ui-xaml/issues/179</a>. "},{"user":"https://wpdev.uservoice.com/users/95868186-hannes-preishuber","datetime":"2018-12-13","body":"doing today a demo in front of Windows Desktop Developers and have to say, after more than 5 years, Microsoft have not finished such a basic task in their own UWP stack. Data Annotations are fine, doesn't need some ne kind of DI whatever"},{"user":"https://wpdev.uservoice.com/users/158611122-thomas-claudius-huber","datetime":"2018-09-20","body":"Looking forward to it. Releasing this as a backwards compatible version is great and really important for enterprises. Especially enterprises usually don't switch to the latest Windows 10 version immediately after it was released."},{"user":"https://wpdev.uservoice.com/users/347422432-david","datetime":"2018-09-19","body":"Thanks for the update.  I'm just an observer for now, but I'd love to start programming with UWP-XAML one day.  I keep googling UWP in conjunction with other important keywords like INotifyDataErrorInfo, OutlookBar, Ribbon, AdornerLayer, DataGrid, etc.   My searches typically turn up nothing month after month (although there is now a datagrid!)  . These are the types of things that seem critical for normal line-of-business desktop applications.  "},{"user":"https://wpdev.uservoice.com/users/347422432-david","datetime":"2018-09-14","body":"Any word on this?  It would be great to see an estimated ETA as well.  INotifyDataErrorInfo is something that would be very handy, and a UWP developer shouldn't be reinventing it for themselves."},{"user":"https://wpdev.uservoice.com/users/135744462-melbournedeveloper","datetime":"2018-04-10","body":"Thanks Harini! Glad to hear this because I know that you're trying to make XAML as standard as possible across the board so hopefully the solution will use INotifyDataErrorInfo like the other platforms.\n"},{"user":"https://wpdev.uservoice.com/users/158611122-thomas-claudius-huber","datetime":"2018-01-29","body":"Are there any news around this idea?"},{"user":"https://wpdev.uservoice.com/users/91043263-jerry-nixon","datetime":"2017-10-27","body":"I believe that INotifyDataInfo is simply too limiting. Here's a prototype of what I believe we really need: <a rel=\"nofollow noreferrer\" href=\"https://github.com/Windows-XAML/Template10.Validation/blob/master/Library/Validation/Property.cs\">https://github.com/Windows-XAML/Template10.Validation/blob/master/Library/Validation/Property.cs</a>"},{"user":"https://wpdev.uservoice.com/users/135744462-melbournedeveloper","datetime":"2017-06-15","body":"This item is too broad. Specifically, Microsoft needs to implement functionality on UWP controls so that when an object is bound to a control, and that object implements INotifyDataErrorInfo, the control should listen to error changes, and display them accordingly. This is excellent functionality in Silverlight and WPF. "},{"user":"https://wpdev.uservoice.com/users/395101084-danny-hooser","datetime":"2017-06-13","body":"+1 @Karl. Please make this happen. All LOB applications I write heavily rely on this feature in WPF/Silverlight. This is a major blocking issue to move forward with UWP for our company."},{"user":"https://wpdev.uservoice.com/users/99516912-anthony-johnston","datetime":"2017-04-23","body":"I have been struggling with this too, not a fan of data annotations.\n<br>Came up with this as a starter for 10 <a rel=\"nofollow noreferrer\" href=\"https://gist.github.com/MrAntix/f1fad919e06fc812e374c07c70a748ec\">https://gist.github.com/MrAntix/f1fad919e06fc812e374c07c70a748ec</a>"},{"user":"https://wpdev.uservoice.com/users/349517098-sjb","datetime":"2017-03-29","body":"Template 10 (and Prism before it) is great as a demonstration of some key concepts. We have Validator, IValidatable, and validation attributes in uwp. "},{"user":"https://wpdev.uservoice.com/users/153050619-brian-hussey","datetime":"2017-02-09","body":"It seems like they are okay with 3rd parties filling this role. During yesterdays win10 creative update webinar they had a rep from telerik speaking about all their enterpise features(datagrid/form validation) for uwp. I have been using syncfusion's datagrid with some success but I find 1st party controls have more polish and are better tested."},{"user":"https://wpdev.uservoice.com/users/65060214-noemata","datetime":"2017-02-09","body":"Has there been any progress on this?  I am somewhat baffled by the fact that we had Prism as an official Microsoft framework, and it was quite capable.  Then when Sinofsky started running the show, Prism fell off the futures road map.  It eventually came back and was subsequently released into the wild as an open source initiative no longer officially supported by Microsoft."},{"user":"https://wpdev.uservoice.com/users/300810514-anonymous","datetime":"2016-12-26","body":"Prism doesn't work well in uwp because x:Bind doesn't allow string indexers. "},{"user":"https://wpdev.uservoice.com/users/153050619-brian-hussey","datetime":"2016-09-13","body":"Thanks anonymous, I will check it out. Jerry Nixon is doing good work on template 10."},{"user":"https://wpdev.uservoice.com/users/241104853-anonymous","datetime":"2016-09-13","body":"Use the excellent Template10 Validation library:"},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2016-08-05","body":"Brian / Karl, why i didn't close this out :)  Just gave a possible framework to unblock."},{"user":"https://wpdev.uservoice.com/users/153050619-brian-hussey","datetime":"2016-08-05","body":"I have looked at the prism documentation on input validation and it would work but I think most of us are looking for an implementation similar to the wpf/silverlight methods."},{"user":"https://wpdev.uservoice.com/users/210200922-karl-shifflett","datetime":"2016-08-05","body":"Clint,"}]}