{"id":"13279557","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/13279557-replace-xamarin-forms-xaml-syntax-with-latest-uwp","title":"Replace Xamarin.Forms Xaml syntax with latest UWP Xaml","body":"Now that Microsoft has bought Xamarin, integrated it in Visual Studio and made it free, it would be awesome to replace Xamarin.Forms Xaml syntax with current UWP so that Devs can benefit from all the new rich features such as RelativePanel, x:Bind, Adaptive Triggers, Live Visual Tree etc and also no learning curve for Xamarin.Forms-specific naming conventions (e.g StackLayout instead of StackPanel)","votes":"266","user":"https://wpdev.uservoice.com/users/156059709-syed-hassaan-ahmed","datetime":"2016-04-01","comments":[{"user":"https://wpdev.uservoice.com/users/95820222-shimmy-weitzhandler","datetime":"2018-10-20","body":"Anything ever gonna happen with Xamarin's ugly XAML? I've started exploring Platform.Uno, takes UWP to Android, iOS and Web!\n<br>XAML standard looks hopeless."},{"user":"https://wpdev.uservoice.com/users/158611122-thomas-claudius-huber","datetime":"2017-05-29","body":"Note that Microsoft has anounced XAML Standard 1.0 at last BUILD conference. When XAML Standard evolves, we will have the same XAML dialect across UWP and Xamarin Forms. So indeed, Microsoft is working on this item as part of XAML Standard."},{"user":"https://wpdev.uservoice.com/users/16719738-planetarian","datetime":"2017-05-25","body":"Xamarin.Forms is kind of a huge pain to use. Between the syntax that's different enough to be annoying, the lower flexibility, and the fact that there's NO designer support, it has slowed down my multiplatform development to the point where I'm seriously considering just writing platform-specific UIs... At least then I'd have decent tooling support. \n<br>I love UWP as a windows developer, but I've grown accustomed to calling it the Useless Windows Platform since it's not particularly \"universal\". At least making UWP XAML usable on other platforms with Xamarin would be a step in the right direction."},{"user":"https://wpdev.uservoice.com/users/361994023-mos-dja","datetime":"2017-05-05","body":"oh really is not Xamarin.forms and UWP XAML of the same company?  so why we have to learn several ways to do the same thing, instead of making several things in the same way"},{"user":"https://wpdev.uservoice.com/users/177695205-rolf-van-kuijen","datetime":"2016-12-13","body":"I hope the 'fine feedback' means that Xamarin.Forms will use the full UWP syntax and not even add more garbage to Xamarin.Forms."},{"user":"https://wpdev.uservoice.com/users/230311542-marco-murray","datetime":"2016-10-12","body":"Agreed with the others, you are better off voting for the GitHub issue, which at this point nearly has as many reactions as this vote alone.  This group is responsible for taking something that worked very well in WPF and Silverlight, and then has actively spent the past decade ensuring a subpar, mediocre replacement. I wouldn't be surprised to learn that management over there used to work for Google or Apple, and are guilty of corporate sabotage.  How anyone over there has managed to continue getting paid during all this time of doing essentially nothing is indeed a mystery, and something shareholders and press should inquire."},{"user":"https://wpdev.uservoice.com/users/36484535-guillaume","datetime":"2016-10-06","body":"Of course ! It is the ONLY way to give life back to Windows Mobile !\n<br>This is the KEY !"},{"user":"https://wpdev.uservoice.com/users/243269170-titus-rockefeller","datetime":"2016-09-15","body":"Truly a disgrace to see how watered-down and incompetent the Xaml systems have become.  WPF and Silverlight are still so much better, and if we could get away with still using them, we would.  We are instead held ******* by these very limited subsets of Xaml.  Might as well be using JSON!  I am in agreement with others that the GitHub vote is probably the better way to go.  It takes years before this group can even decide on something, nevermind actually doing something about it."},{"user":"https://wpdev.uservoice.com/users/242001412-bradley-masterson","datetime":"2016-09-14","body":"Incredible that users are asking for the obvious, and it still takes over a year to even acknowledge that there is even a problem.  Talk about corporate cruft and malfeasance!  The GitHub issue has my upvote, and is probably a better place to focus our energies.  This place and the UWP group is a joke."},{"user":"https://wpdev.uservoice.com/users/234970156-josh-mcfadden","datetime":"2016-09-08","body":"GitHub issue has over 100 reactions, by far and away the most popular and active request in that repo!  If you don't listen to your developers, why even bother having a voting site?!\n<br><a rel=\"nofollow noreferrer\" href=\"https://github.com/dotnet/corefx/issues/5766\">https://github.com/dotnet/corefx/issues/5766</a>"},{"user":"https://wpdev.uservoice.com/users/148220826-rj-wilco","datetime":"2016-05-26","body":"Yes, consolidate all Xaml flavors and take the best from all models, please.  This vote and the GitHub issue have my upvote!!!"},{"user":"https://wpdev.uservoice.com/users/91433263-francisco","datetime":"2016-05-24","body":"And, please, Support Windows 7!. Thanks!."},{"user":"https://wpdev.uservoice.com/users/149269074-mike-eee","datetime":"2016-05-24","body":"FWIW there is a conversation happening on CoreFX's GitHub around porting System.Xaml over to .NETCore.  It would be awesome to unify efforts and create a new cross-platform Xaml system that combines the best aspects from all flavors (System.Xaml, OmniXaml, Portable.Xaml, Xamarin.Xaml &amp; UWP Xaml)."},{"user":"https://wpdev.uservoice.com/users/155922975-anson","datetime":"2016-05-23","body":"That's make perfect sense"},{"user":"https://wpdev.uservoice.com/users/168068643-anonymous","datetime":"2016-05-18","body":"please unify both xaml and allow to use blend to design xamarin.forms apps. You just need UWP xaml that can be deployed to ios and android"}]}