{"id":"14808999","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/14808999-the-installed-centennial-executable-does-not-know","title":"The installed Centennial executable does not know about its installed folders and cannot find them.","body":"For example, if in the msi/ appx is added folder, like Samples or Projects, it cannot be found by the open/ save dialogs, with set \"Initial Directory\", opened by the installed executable, even if the folder is installed in the installed executable's folder. Actually, initially I constructed the msi by placing the folder in the Documents folder, but the Centennial does not install it there, but in the VFS\\.... It will be hard for the user to find these kind of folders too.","votes":"12","user":"https://wpdev.uservoice.com/users/160461816-bozhidar-hinkov","datetime":"2016-06-14","comments":[{"user":"https://wpdev.uservoice.com/users/160461816-bozhidar-hinkov","datetime":"2016-11-23","body":"Thank you, Vlad.\n<br>You have a marking system, indicating what is going on and what is the status regarding the feedbacks and the suggestions (like \"backlog\", \"complete\", etc.) - could you, please, mark this for easy tracking?\n<br>Thank you."},{"user":"https://wpdev.uservoice.com/users/170319330-windows-project-centennial-team","datetime":"2016-11-11","body":"Thanks for your feedback Bozhidar.\n<br>I added your suggestion to our backlog to automatically copy from a pre-defined location.\n<br>Meanwhile please copy it on the first run of the app."},{"user":"https://wpdev.uservoice.com/users/160461816-bozhidar-hinkov","datetime":"2016-08-16","body":"...\n<br>4. Here the suggestion could be: All the content from the VFS\\...\\Documents dir to be automatically copied in the actual Documents dir."},{"user":"https://wpdev.uservoice.com/users/160461816-bozhidar-hinkov","datetime":"2016-08-16","body":"I am on all Anniversary updates (OS, SDK, Centennial 0.1.24):\n<br>1. %appdata% and %localappdata% dirs are in VFS\\... and have no access permissions to write, and for the MASS USER of Win and PC to find and read in them.\n<br>2. And regarding the above: It is not true that with the appx packaging it is not necessary to write installers/uninstallers for every software, when we have to write code that copy the content of %appdata% folders (or any other VFS folders) to the Documents folder!\n<br>3. I think that you have to do that, because the msi already do that."},{"user":"https://wpdev.uservoice.com/users/160461816-bozhidar-hinkov","datetime":"2016-07-21","body":"What is the status?"},{"user":"https://wpdev.uservoice.com/users/192843030-qing-xu","datetime":"2016-07-16","body":"I have the similar problem. My app create some document, when I click save, the save dialog pop up, then a error dialog pop up too, saying some folder is missing. I don't know what the root cause yet. "},{"user":"https://wpdev.uservoice.com/users/160461816-bozhidar-hinkov","datetime":"2016-07-01","body":"What happens with this?"}]}