{"id":"15321789","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/15321789-shell-context-menus","title":"Shell Context Menus.","body":"Please add Shell Context Menus API for UWP apps. \n<br>We need way to integration with Windows Explorer context menu.","votes":"72","user":"https://wpdev.uservoice.com/users/167483334-%D0%B2%D0%B0%D0%BB%D0%B5%D1%80%D0%B0-%D0%B2","datetime":"2016-07-21","comments":[{"user":"https://wpdev.uservoice.com/users/57644613-emiliano-magliocca","datetime":"2019-02-08","body":"@ryan for me for example could be 7zip (or similar app) i like to have default settings for. Zip,. Iso ecc... But I want to be always able to right click and use 7zip context menu"},{"user":"https://wpdev.uservoice.com/users/882524251-ryan-p","datetime":"2019-02-08","body":"Hi all, thanks for your feedback. @Colin, what specific UWP app were referencing that lacks Explorer context menus? Please feel free to file feedback in the Feedback Hub and post the link to your comment here so we can pass it over to the right teams appropriately. "},{"user":"https://wpdev.uservoice.com/users/882070978-bob-b","datetime":"2019-01-29","body":"This is a very important capability that is missing for UWP apps.  At present VS allows UWP apps to be added to the file explorer’s “Open With” listing but only for selected file types.  Please enable context menu support for all file types and for multiple files. I also agree with Lukas, there needs to be an ease way for users to disable context menu entries."},{"user":"https://wpdev.uservoice.com/users/855224866-colin","datetime":"2018-10-04","body":"At least one beloved app, ported from desktop to UWP so it's available in the Store as requested by many users, is getting 1-star ratings and reviews specifically because it lacks the Explorer integration the original desktop version had. Specifically, for this app, users need to be able to select multiple files and choose to open them with the app (so just adding to Open With doesn't work, because that only applies to a single file). Please enable some form of support for context menus. It would be fine, as Lukas suggested, if the user has a Settings override to remove unwanted entries."},{"user":"https://wpdev.uservoice.com/users/173418966-henning","datetime":"2018-07-25","body":"This missing API effectively precludes most utilities from being a UWP app. :-("},{"user":"https://wpdev.uservoice.com/users/369905551-me","datetime":"2017-05-07","body":"Please add it!"},{"user":"https://wpdev.uservoice.com/users/54077101-lukas","datetime":"2017-02-08","body":"This is very important, it is one of the features that prevents using UWP for a whole class of applications... If this is done, make sure that it is easily possible for users to disable context menu entries for an app via settings. The various ways how desktop apps add stuff to context menus with no way for normal users to remove them is just horrible."},{"user":"https://wpdev.uservoice.com/users/167483334-%D0%B2%D0%B0%D0%BB%D0%B5%D1%80%D0%B0-%D0%B2","datetime":"2017-01-14","body":"It can be added to Desktop family UWP API"},{"user":"https://wpdev.uservoice.com/users/167483334-%D0%B2%D0%B0%D0%BB%D0%B5%D1%80%D0%B0-%D0%B2","datetime":"2016-11-09","body":"Please add API for UWP apps with possibility adding commands to right click Explorer menu."},{"user":"https://wpdev.uservoice.com/users/80457237-me","datetime":"2016-08-08","body":"I dont want it. Many apps add many items to this context menu, and it is complete junk after a while.\n<br>It'd be better as an option in Settings to customize this menu. "},{"user":"https://wpdev.uservoice.com/users/149036856-martin","datetime":"2016-08-03","body":"Consider that not all Devices which can run UWP Apps got the classic Windows File Explorer"},{"user":"https://wpdev.uservoice.com/users/167483334-%D0%B2%D0%B0%D0%BB%D0%B5%D1%80%D0%B0-%D0%B2","datetime":"2016-07-21","body":"\nPlease add Shell Context Menus API for UWP apps.\n<br>We need way to integration with Windows Explorer context menu."},{"user":"https://wpdev.uservoice.com/users/167483334-%D0%B2%D0%B0%D0%BB%D0%B5%D1%80%D0%B0-%D0%B2","datetime":"2016-07-21","body":"No, this is wrong sample. We need way to integration with Windows Explorer context menu."},{"user":"https://wpdev.uservoice.com/users/167483334-%D0%B2%D0%B0%D0%BB%D0%B5%D1%80%D0%B0-%D0%B2","datetime":"2016-05-16","body":"Please add Shell Context Menus API for UWP apps."}]}