{"id":"15673041","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/15673041--bug-audiograph-gaps-and-clicks-during-playback","title":"[Bug] AudioGraph: Gaps and clicks during playback","body":"To reproduce you may start with official AudioCreation sample from <a rel=\"nofollow noreferrer\" href=\"https://github.com/Microsoft/Windows-universal-samples/tree/master/Samples/AudioCreation/cs/AudioCreation\">https://github.com/Microsoft/Windows-universal-samples/tree/master/Samples/AudioCreation/cs/AudioCreation</a>\n<br>Use file playback sample or custom effects sample. Depending on hardware, you may hear gaps right after start or you may need load CPU with some additional work, like scrolling UI or running some work in background threads. \n<br>I guess it is result of extremely short quantum size (10ms; even switching between threads could take more time) and too low buffer length (2 quants), but it could be just some synchronization issue.","votes":"10","user":"https://wpdev.uservoice.com/users/104961126-oleg","datetime":"2016-08-15","comments":[{"user":"https://wpdev.uservoice.com/users/887783032-pavel-vitner","datetime":"2019-03-09","body":"Hello, I have exactly the same problem. The solution using GC.TryStartNoGCRegion () partially works in the AudioCreation-FrameInput example, except for large memory consumption. In an application I've been working on for several years, unfortunately, this solution is inadequate. Does Microsoft work to solve this problem directly in AudioGraph? Thank you very much for the reaction!"},{"user":"https://wpdev.uservoice.com/users/866770810-nicolas-s%C3%A9veno","datetime":"2019-02-21","body":"Hi,"},{"user":"https://wpdev.uservoice.com/users/884765467-h%C3%A5kan-berg","datetime":"2019-02-18","body":"Seems like this thread is now 3½ years old."},{"user":"https://wpdev.uservoice.com/users/866770810-nicolas-s%C3%A9veno","datetime":"2019-02-11","body":"Hi,"},{"user":"https://wpdev.uservoice.com/users/30695654","datetime":"2017-08-09","body":"Hi Clint!"},{"user":"https://wpdev.uservoice.com/users/415163164-jack-stephenson","datetime":"2017-07-14","body":"I am getting it too."},{"user":"https://wpdev.uservoice.com/users/19217957-tom","datetime":"2017-04-16","body":"I hoped it will be better in Creator's Update, but it's still the same. Because of this AudioGraph is pretty much unusable on mobile."},{"user":"https://wpdev.uservoice.com/users/30695654","datetime":"2017-04-13","body":"I have the same problem. Any news about it?"},{"user":"https://wpdev.uservoice.com/users/19217957-tom","datetime":"2017-03-13","body":"I am also experiencing gaps and clicks, although only on mobile, probably because of lower power. I would expect AudioGraph to work correctly at least on high-end smartphones, but this is not the case.\n<br>From my observations this is caused by GC. Audio often freezes in exact moments when GC is invoked. It is invoked every few seconds to clean something from event AudioFrameInputNode.QuantumStarted. Probably old AudioFrame and something else. I managed to lower down number of GCs by reusing AudioFrames, but they are still happening, every 30-60 seconds. There is nothing else going on in the app, memory is low, so GC seems unnecessary. Could we delay GC somehow? It would be great to invoke it only when AudioGraph is stopped or when memory is near upper limit."}]}