{"id":"15817099","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/15817099-allow-subpixel-font-smoothing-directwrite-in-uwp","title":"Allow subpixel font smoothing (DirectWrite) in UWP apps","body":"Currently UWP have less readable grayscale font smoothing. It makes UWP apps look worse than desktop apps on standard DPI screens. Allowing subpixel font rendering would make them look on par with desktop apps.   ","votes":"88","user":"https://wpdev.uservoice.com/users/227664778","datetime":"2016-08-25","comments":[{"user":"https://wpdev.uservoice.com/users/876364969-alex-smith","datetime":"2018-12-20","body":"This would probably have much stronger support if more people knew about the terminology. I wouldn't necessarily label it a dealbreaker, but it definitely makes the idea of just creating LOB apps in Chromium much more appealing."},{"user":"https://wpdev.uservoice.com/users/388618483-charles-roddie","datetime":"2018-08-16","body":"This is still not here in 2018. This is a major regression from WPF. This seriously impacts usability on screens with normal dpi."},{"user":"https://wpdev.uservoice.com/users/349286155-rolf","datetime":"2017-03-28","body":"and how can i use ist?"},{"user":"https://wpdev.uservoice.com/users/318964345-laith","datetime":"2017-02-01","body":"I can't believe this doesn't have thousands of votes."},{"user":"https://wpdev.uservoice.com/users/211182684-gavin-williams","datetime":"2016-08-29","body":"Yep, this is another shortcoming of UWP unfortunately. Subpixel anti-aliasing is almost universally loved. And excluding it from UWP, is another nail in the coffin. Sure UWP is not in the ground yet, and I am normally one to defend it vigorously. But this issue - and it's consequence - worse looking text is a platform killer. Text is so important, and 1920x1080 displays are almost ubiquitous - 37% on steam and rising. And i have to say on my 27\" 1920x1080 display text is not too good even with subpixel AA. And high DPI displays for desktop are too expensive for most people. Even if i spent 3X what my display is worth, I still wouldn't end up with a high DPI display. "}]}