{"id":"16685545","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/16685545-donationware-ability-for-windows-store","title":"Donationware ability for Windows Store","body":"It's a lot easier to build a following when it's free.  Keeping this in mind, was thinking of making some of my products donationware.  Would it be feasible to somehow make this type of offering as part of the store?","votes":"66","user":"https://wpdev.uservoice.com/users/264699325-john-leone","datetime":"2016-10-16","comments":[{"user":"https://wpdev.uservoice.com/users/868052254-martin-prikryl","datetime":"2018-11-12","body":"See <a rel=\"nofollow noreferrer\" href=\"https://stackoverflow.com/q/42941232/850848#51908344\">https://stackoverflow.com/q/42941232/850848#51908344</a>"},{"user":"https://wpdev.uservoice.com/users/104786655","datetime":"2018-05-21","body":"I tried to setup donations with in app purchases and i got my app rejected from certification of the store because they say donations must be done with third party services, which is really disappointing as this user voice suggests I can do it with in app purchases."},{"user":"https://wpdev.uservoice.com/users/296233279","datetime":"2016-12-13","body":"Donation Apps are a great idea."},{"user":"https://wpdev.uservoice.com/users/264699325-john-leone","datetime":"2016-10-27","body":"You might want to download it again now.  Had a nasty bug that I hadn't noticed until it was published. It's all fixed now."},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2016-10-24","body":"neat, downloading it now"},{"user":"https://wpdev.uservoice.com/users/264699325-john-leone","datetime":"2016-10-24","body":"<a rel=\"nofollow noreferrer\" href=\"https://www.microsoft.com/en-us/store/p/essential-video-recorder/9nblggh5260t\">https://www.microsoft.com/en-us/store/p/essential-video-recorder/9nblggh5260t</a>"},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2016-10-22","body":"Awesome!   Glad to hear you are unblocked.  Would love to see your app, please post a link!"},{"user":"https://wpdev.uservoice.com/users/264699325-john-leone","datetime":"2016-10-22","body":"I have the prototype functioning!  I posted my first donation to myself.  Only way I could test it.  Worked good though, just needed to adjust some of the wording.  But now I'm just in a holding pattern until the program to pass certification and in the store.  Thanks!"},{"user":"https://wpdev.uservoice.com/users/264699325-john-leone","datetime":"2016-10-21","body":"Hi Clint, I think I got this set up, but am not sure.  I have the three in app purchases, 1,2,3 dollars, or .99, 1.99, and 2.99.  I also have the code running in Beta 5 of the Video Recorder.  Although it says the addons are certified, if I run my new code from the program using the new id's it says not found.  Is it once they've been published can I see them.  Can't really figure out how I'm going to test them.  Also does the StoreID have to remain private.  I currently am distributing this as open souce, but I will somehow remove them, if it is to be kept that way"},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2016-10-21","body":"John, that would be up for you to implement how you'd want to set up payment, it currently isn't variable.  One reason why i'm keeping this open.  I suggest having a few IAP for donation at different, increasing amounts."},{"user":"https://wpdev.uservoice.com/users/264699325-john-leone","datetime":"2016-10-21","body":"That sounds great, but I'm not sure how to proceed.  How do I set up an In app purchase?  Also, would there be the ability to have a variable amount, so that the user would only pay the amount that is comfortable for them?  Many Thanks, John."},{"user":"https://wpdev.uservoice.com/users/36508681-rp-interactive","datetime":"2013-05-22","body":"Yes, actually all you need to change for that is the \"try\" and \"buy\" buttons. What about \"install\" and \"sponsor\"? (And maybe show the app among the free apps). I am unsure about this idea, but I have the feeling I need to know more about this."},{"user":"https://wpdev.uservoice.com/users/25491630-phildaub","datetime":"2012-06-12","body":"With WP7 we have the unique ability to offer Trails for Paid Apps, which is great. However, it would be nice if developers could offer Free Apps with a possibility to users for voluntary donations. Some devs do the workaround and offer a Paid app, with the trial version having no restrictions at all (if the user clicks 'buy', he essentially donates to the dev)."}]}