{"id":"17341234","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/17341234-midi-port-enumeration-returning-undescriptive-port","title":"MIDI Port enumeration returning undescriptive port names","body":"Using DeviceInformation::FindAllAsync in my C++/CX application to enumerate existing MIDI ports on the system. I'm using the result of MidiOutPort::GetDeviceSelector() for the device selector string. The DeviceInformation for some of the virtual software ports on the system are returning with generic device names. A user of yMidi contacted me about this problem. He’s using loopMidi, a virtual MIDI loopback from Tobias Erichsen. <a rel=\"nofollow noreferrer\" href=\"http://www.tobias-erichsen.de/software/loopmidi.html\">http://www.tobias-erichsen.de/software/loopmidi.html</a>\n<br> \n<br>The problem is the output port names are enumerated by the UWP API as just MIDI and not the name of the port as defined when they were setup. Reaper and other desktop programs are displaying the proper name. \n<br> \n<br>Have you seen this behavior before? I’m using the property DeviceInformation::Name in my application to display the port name. I see a DeviceInformation::ItemNameDisplay property, but that seems to be the same as the property I’m currently using.\n","votes":"7","user":"https://wpdev.uservoice.com/users/292954663","datetime":"2016-12-05","comments":[{"user":"https://wpdev.uservoice.com/users/431725870-a","datetime":"2018-12-11","body":"It would nice to know what MS plans to do about this.  It's been far too long without even a response."},{"user":"https://wpdev.uservoice.com/users/701431108-parker-snell","datetime":"2018-12-11","body":"Hey, just a reminder this is still a problem. Here is my device name list using UWP:"},{"user":"https://wpdev.uservoice.com/users/818760256","datetime":"2018-06-28","body":"Come on Microsoft - pull your finger out :-) This has been broken since the introduction of the new API, and despite plaguing us with updates, this never gets fixed. Please give the MIDI API some love so it becomes useable and we don't have to stick with MME..."},{"user":"https://wpdev.uservoice.com/users/701431108-parker-snell","datetime":"2018-04-14","body":"This is still not fixed. MIDI is used by musicians every day to control software synths with hardware such as keyboards, launchpads, fader banks, and more, as well as sending feedback to those devices from software."},{"user":"https://wpdev.uservoice.com/users/712430803-ct","datetime":"2017-11-19","body":"up - I need an answer to this as well!"}]}