{"id":"17364901","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/17364901-apis-to-control-volume","title":"APIs to control volume","body":"I would like to programmatically set and get the volume for Windows.  If my app is currently playing audio, it would be nice if my app could control the experience and interact how i would want it to outside of the system experience.  I want my user to stay inside my app.","votes":"24","user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2016-12-07","comments":[{"user":"https://wpdev.uservoice.com/users/908784670","datetime":"2019-06-27","body":"Absolutely necessary I am working on app that is going to run in kiosk mode user should be able to make changes to the master sound level"},{"user":"https://wpdev.uservoice.com/users/834925492-tom-jenkinson","datetime":"2018-08-14","body":"Just being able to access the current level would be useful. Without this information it is impossible to have a completely javascript app that uses &lt;audio /&gt;, &lt;video /&gt;, MSE because users cannot change the volume with the system volume control. There is also no way to disable the system volume slider."},{"user":"https://wpdev.uservoice.com/users/360922495","datetime":"2018-08-14","body":"I'm working on a music app that works with mobile phone as a secondary device (change titles, etc). The secondary device is extremly handy when the app is in background mode. However, right now there is no way to programmatically change the volume on Xbox. This really sucks (PS supports that)."},{"user":"https://wpdev.uservoice.com/users/189335055-wim-bokkers","datetime":"2018-01-23","body":"I'm working on an app that needs to play a sound with a guaranteed volume. So, I need to change the 'muted' state and the volume of the system. "},{"user":"https://wpdev.uservoice.com/users/426438910-benjamin-rapp","datetime":"2017-07-31","body":"We need the ability to control the volume output from the application to the computer volume mixer (or) internal volume control."},{"user":"https://wpdev.uservoice.com/users/187651806-dmitry-k","datetime":"2017-05-28","body":"It would be useful to have API to get and set system volume, as well as get its updates when user is changing system volume with device volume buttons or with volume slider."},{"user":"https://wpdev.uservoice.com/users/141350616-emiruyunka","datetime":"2017-04-09","body":"I am trying to create a UWP app that automatically mutes the system volume on certain weekdays during certain hours."},{"user":"https://wpdev.uservoice.com/users/187651806-dmitry-k","datetime":"2016-11-10","body":"For music apps it may be useful to be able to reflect hardware volume changes in its UI and change hardware volume from its UI. "},{"user":"https://wpdev.uservoice.com/users/167727564-saurabh-saraswat","datetime":"2016-05-17","body":"Please add more common api for access system information and which open more hardware interaction .ex provide api for accessing cpu overall usage , overall memory usage and many more .......  "}]}