{"id":"1739465","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/1739465-show-a-paid-app-w-a-trial-option-in-the-free-a","title":"Show a paid app w/ a \"trial\" option in the \"free apps\" category","body":"When I create a paid app with a trial option, many users blow right by it because it doesn't show up in the \"free\" category even though a light version of the app is free (via the trial). ","votes":"713","user":"https://wpdev.uservoice.com/users/12932474-matthias","datetime":"2011-04-19","comments":[{"user":"https://wpdev.uservoice.com/users/36960004-till","datetime":"2015-11-08","body":"Back in Wp7 times, there were no in-app-purchases. Thus, people often had to create two apps. A paid one and a free one. They are essentially the same, but the paid app may have unlocked certain features. With in-app-purchases, it was possible to unlock these features om the free app, rendering the second app useless. Still one has to update and manage both apps in the Dev Center, which is very time-consuming and error prone. It would be very helpful if a developer could merge the app so that he only has to manage one package and one set of descriptions."},{"user":"https://wpdev.uservoice.com/users/67197968-mike-eee","datetime":"2015-09-01","body":"1500+ votes, and it's been over a year since the last MSFT response on this... what is the status of this (popular -- currently rated #5) feature request?\n"},{"user":"https://wpdev.uservoice.com/users/81751009","datetime":"2015-06-17","body":"That is not a good idea. A trial app is not a free app. \n<br>In the end there would be only \"free\" apps on the store and everybody would loose with this idea."},{"user":"https://wpdev.uservoice.com/users/14605872-christopher-snazell","datetime":"2014-09-19","body":"There's movement afoot within the EU against app stores advertising apps that are free to download but are subsequently monetised being listed as \"free\". Google's apparently already agreed to remove the use of \"free\" in this context. "},{"user":"https://wpdev.uservoice.com/users/54864193-anonymous","datetime":"2014-08-07","body":"Please add this Feature!"},{"user":"https://wpdev.uservoice.com/users/49768510-christos-matskas","datetime":"2014-05-08","body":"I frequently download trial apps to test before I buy and I agree with most comments so far that trials apps should be visible to the user. In most free-to-try cases, you want users to play around with your app before deciding whether to ditch it or buy it. Listing trial apps in the paid section seriously harms downloads because most users want free stuff and only pay for apps that add value. A separate section \"Free-to-try\" makes more sense and leaves free and paid categories untouched. "},{"user":"https://wpdev.uservoice.com/users/26329122-thomas","datetime":"2014-02-13","body":"Allow for a Migration path from Paid App to Free App with In-App-Purchase so users of the paid app don't lose their Features when changing to the free app."},{"user":"https://wpdev.uservoice.com/users/13015829-robert-mclaws","datetime":"2013-09-15","body":"Not sure why your reply was so snarky, Morten, but there are plenty of apps that are paid that shouldn't have ads. I have an app for New Relic in certification that doesn't have ads in the trial or paid versions, the trial limits functionality so you can see how it works a few times, and then pay for it. While I agree that IAP is a good use case for removing ads, it does not solve the problem I just described."},{"user":"https://wpdev.uservoice.com/users/12932642-morten-nielsen","datetime":"2013-09-14","body":"Terrible terrible idea. This is what we have in-app purchases for. Make your app free-free, and use in-app purchases to remove the ads (this seem to be the main usecase people here blabber on about)"},{"user":"https://wpdev.uservoice.com/users/39046002-gary-ritter","datetime":"2013-08-02","body":"I do the same thing Jeff B. \"NOTE: Trial is FULL VERSION but with ads.\" is the leading line in all my description."},{"user":"https://wpdev.uservoice.com/users/14217957-jeff-b","datetime":"2013-05-10","body":"I started putting the text \"Trial version is non-expiring (ad supported)\" as the very first line in my description and it has helped somewhat with downloads.  However, I am strongly considering adding a second \" - FREE\" version of the app as well, although I really don't want to have to do that.  Being able to include these in the \"free\" section (or another section such as \"Ad Supported\") would be a great improvement."},{"user":"https://wpdev.uservoice.com/users/35040765-graham-o-neale","datetime":"2013-04-12","body":"Also solution I see is free+paid should be a category. Honestly, in the end they are both free to download. If you wish to upgrade the features, or remove ads, or something like that, then you can pay. It should still initially be listed under free because it is (at whatever functionality level has been set by the developer)."},{"user":"https://wpdev.uservoice.com/users/35040765-graham-o-neale","datetime":"2013-04-12","body":"If Microsoft haven't realised this is a massive problem and oversight yet, I don't know what hope we have of it been done in the future :( I too release two versions, free and paid, get about 20x more downloads (honestly) than trials."},{"user":"https://wpdev.uservoice.com/users/13981003-vsevolod-alekseyev","datetime":"2013-04-08","body":"I feel I'm losing trial downloads to sticker shock. My app is perfectly functional in trial mode, but I feel that when people see the price tag, they don't even consider that - they're scared away. Compared to other platforms (that are neither Android nor iOS), my WP8 trial download count is miniscule."},{"user":"https://wpdev.uservoice.com/users/25415012-mayur","datetime":"2012-06-11","body":"I buy sm app and nxt tym i see d same app, it gives two option either try or buy."},{"user":"https://wpdev.uservoice.com/users/13472265-rico","datetime":"2012-02-11","body":"Another suggested options (should be visible in free and not called trials): \n<br>- Free with option to donate for the app...\n<br>- Free with ads, paid without ads"},{"user":"https://wpdev.uservoice.com/users/18925068-bunthorn89","datetime":"2012-02-01","body":"how can i get it"},{"user":"https://wpdev.uservoice.com/users/18904173-anetics","datetime":"2012-01-23","body":"An app is either FREE or its not, there is no grey area"},{"user":"https://wpdev.uservoice.com/users/16461408-david-lorenzin","datetime":"2012-01-20","body":"Best solution is to have 3 sub-choices\n<br>in case of Trial\n<br>PAID:\n<br> Trial:\n<br> - time expires\n<br> - time unlimited but feature limited (in this case to be listed on FREE too!)\n<br> - with banner"},{"user":"https://wpdev.uservoice.com/users/17729755-josh","datetime":"2011-11-22","body":"Free = no cost and no strings.  Creating a new category is a better option."}]}