{"id":"1767317","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/1767317-provide-ability-to-transfer-ownership-of-app-inclu","title":"Provide ability to transfer ownership of app including IAP transfer","body":"Some people have had other developers submit apps to the marketplace on their behalf for many reason. They may have been in a country that is not supported for example. More then one developer may have worked on the app and are now splitting. Some people may sell their apps to others.","votes":"290","user":"https://wpdev.uservoice.com/users/12884240-nick-avery","datetime":"2011-04-27","comments":[{"user":"https://wpdev.uservoice.com/users/134365755-ed-andersen","datetime":"2019-05-17","body":"Over 3 years later and the IAP issue has not been addressed. You need a warning on the Dashboard when adding IAPs - \"you will not be able to migrate this app ever\"."},{"user":"https://wpdev.uservoice.com/users/883800952-denis","datetime":"2019-02-11","body":"Hi All, can someone please update, does this feature works ?"},{"user":"https://wpdev.uservoice.com/users/727365301-ryan","datetime":"2017-12-18","body":"Are there any updates on this?"},{"user":"https://wpdev.uservoice.com/users/726447649--deleted-user","datetime":"2017-05-21","body":"Hi. Developers should be able to Transfer ownership of their apps in Windows Store to another dev accounts. Play Store and App Store have similar possibilities, while nothing is available for Windows Store devs. Even if this were possible only by a manual process through email certifications, it would already be so great."},{"user":"https://wpdev.uservoice.com/users/329043412-schumi1331","datetime":"2017-02-10","body":"Transferring an app should also transfer all statistic data, downloads, acquisitions etc."},{"user":"https://wpdev.uservoice.com/users/309807241-jyri","datetime":"2017-01-20","body":"Still waiting for the possibility to transfer apps with IAP from personal account to new business account."},{"user":"https://wpdev.uservoice.com/users/19029810-ray","datetime":"2016-10-03","body":"Still useless if you move app from company account to personal one. Why the **** Apple and Google can do it without any signed by attorney documents, but you cannot!???"},{"user":"https://wpdev.uservoice.com/users/214918980-dt","datetime":"2016-08-10","body":"This feature is currently in Preview. \n<br>When will this feature implemented from \"In Preview\" to \"Implemented\" state?\n<br>Also what about the investigation of apps with IAP to transfer to another account?"},{"user":"https://wpdev.uservoice.com/users/134365755-ed-andersen","datetime":"2016-02-14","body":"Thank you guys for this important step. Please look into IAP!"},{"user":"https://wpdev.uservoice.com/users/84032848-sergey-b","datetime":"2016-02-05","body":"All our applications has IAP to activate Pro features (I think others have the similar situation). When could we expect transferring apps with IAP too?"},{"user":"https://wpdev.uservoice.com/users/142030212-vf","datetime":"2016-02-04","body":"Also if you have no IAP you could not transfer your app, because it is still \"in preview\""},{"user":"https://wpdev.uservoice.com/users/104877432","datetime":"2016-01-21","body":"And what about permissions? I want to move one app to my new account, but old account has special permission given by Microsoft. I think this is not possible to move permission?"},{"user":"https://wpdev.uservoice.com/users/135819723-chris-dorland","datetime":"2016-01-08","body":"MS really needs to work this out. I am working for a publisher that recently acquired a major website. We have a third party that manages all our app submits for the iOS, Android and Windows platforms. We wanted to transfer the app from the store accounts of the old publisher that we acquired to the third party accounts that mange our store submits. On the iOS and Android platforms this was al standard procedure and arranged within a day or 2."},{"user":"https://wpdev.uservoice.com/users/131773257-michal","datetime":"2015-12-21","body":"I'am also thinking that this is very important functionality and should be implemented asap! Unfortunatelly I'am in situation that I need to transfer application but I can't (and I can't belive that this is not supported even when contact with MS Support)."},{"user":"https://wpdev.uservoice.com/users/131338896-eversor","datetime":"2015-12-19","body":"We have just escalated from an individual company to a corporation entity and have over 3 million downloads of apps and relative 4.7 star rating that we need to transfer to our new company.\n<br>The owner of the previous account is now CEO of the newborn company. We had a way to switch payments and tax infos in all other stores, via email or via automatic procedure, but we cannot do so on microsoft..."},{"user":"https://wpdev.uservoice.com/users/127509018-gg","datetime":"2015-12-04","body":"After I change to another country I could not add my bank account from this new country, because bank account only accepted from the registered country!! \n<br>So if it is not supported, I will have no monetary reson to support the Windows Store and PubCenter(Microsoft Advertising)"},{"user":"https://wpdev.uservoice.com/users/127509018-gg","datetime":"2015-12-03","body":"\"Working on it to be added in the future\" =&gt; When?\n<br>Are you still working on it???\n<br>Please give some life-sign!"},{"user":"https://wpdev.uservoice.com/users/125819415-anonymous","datetime":"2015-11-26","body":"What is the current state of this?"},{"user":"https://wpdev.uservoice.com/users/121525746-anonymous","datetime":"2015-11-12","body":"Please also provide ability to transfer pubCenter account to another country!"},{"user":"https://wpdev.uservoice.com/users/121525746-anonymous","datetime":"2015-11-12","body":"Please also provide ability to transfer pubCenter account to another country!"}]}