{"id":"18145291","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/18145291-dynamically-load-assembly","title":"Dynamically Load Assembly","body":"Add the Assembly.Load method which accepts byte[] as a parameter in order to load an assembly in to the app domain. All the other platforms support this: .Net, Silverlight, Android (Xamarin), and even iOS (Xamarin)!","votes":"95","user":"https://wpdev.uservoice.com/users/135744462-melbournedeveloper","datetime":"2017-02-13","comments":[{"user":"https://wpdev.uservoice.com/users/826902409","datetime":"2019-04-03","body":"Yes this feature would be extremely useful. At bare minimum, make App extensions have similar functionality. That way you can still sign/approve packages before they are released to the store, while at the same time give developers the flexibility to create extension hosts."},{"user":"https://wpdev.uservoice.com/users/884421262","datetime":"2019-02-15","body":"I think this functions is required for many developer too."},{"user":"https://wpdev.uservoice.com/users/792250318-xpinkspider","datetime":"2018-05-30","body":"It could not implement a flexible plugin-architecture on UWP Platform because so many limitations like this."},{"user":"https://wpdev.uservoice.com/users/752508418-nguyen-thanhluan","datetime":"2018-02-07","body":"that is one reason, we don't want to develop Application to target UWP."},{"user":"https://wpdev.uservoice.com/users/383132296","datetime":"2017-05-24","body":"I  think this functions is required for many developer too."},{"user":"https://wpdev.uservoice.com/users/135744462-melbournedeveloper","datetime":"2017-02-20","body":"This feature is clearly necessary. As mentioned here, we can dynamically load assemblies on iOS, and Android with Xamarin. Why can't we do the same with UWP?"},{"user":"https://wpdev.uservoice.com/users/178774104-james-croft","datetime":"2016-06-20","body":"A lot of developers coming from the likes of WPF to UWP are hitting a wall when it comes to dynamically loading assemblies as this is not possible in the self-contained architecture of UWP applications. "},{"user":"https://wpdev.uservoice.com/users/66300045-oneonce","datetime":"2015-03-24","body":"I think Windows not only let user acceptance, but also need to let developers to feel more convenient than the development of Android or iOS.But does not reflect the current Windows platform application development more convenient than Android or iOS."},{"user":"https://wpdev.uservoice.com/users/66300045-oneonce","datetime":"2015-03-04","body":"Is there anybody? windows store app why not support dynamic load DLL?\n<br>Why not support change UI display language at runtime? why need restart app?"},{"user":"https://wpdev.uservoice.com/users/66300045-oneonce","datetime":"2015-03-02","body":"I think the windows desktop program do well, can be dynamically loaded DLL user-defined, but windows store app does not. a lot of APP need dynamically load DLL when they need, if can not dynamically loaded DLL, will greatly reduce the number of windows store app. it will also be very frustrating thing."},{"user":"https://wpdev.uservoice.com/users/251668606-paulo-ferro","datetime":"2014-01-17","body":"There should be a way to publish Addins to a windows store.\n<br>These Addins would be related to a specific app and follow the same compliance rules as any other artifact published."},{"user":"https://wpdev.uservoice.com/users/19056525-samtim","datetime":"2011-12-29","body":"First,I want to download dll from webservice,So load assembly from stream"}]}