{"id":"18362032","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/18362032-classic-main-menu","title":"Classic Main Menu","body":"When building line-of-business-apps for enterprises, we often focus on desktop only. Today we're using WPF for these tasks. But if we want to use UWP for it, we would need a classic menu like we have it in Visual Studio and serveral other \"expert applications\" (=app with a lot of functionality) that require more than just a hamburger menu or some flyouts","votes":"103","user":"https://wpdev.uservoice.com/users/158611122-thomas-claudius-huber","datetime":"2017-02-17","comments":[{"user":"https://wpdev.uservoice.com/users/158611122-thomas-claudius-huber","datetime":"2018-06-08","body":"Thanks Windows Developer team, fantastic news! I highly appreciate this. With all the features you're bringing to UWP, it will become the superior platform to build enterprise desktop applications! These new features like the menu, datagrid, UI density and also the XAML islands will make it possible to migrate WPF or even WinForms apps to UWP. "},{"user":"https://wpdev.uservoice.com/users/427685143-davel","datetime":"2017-08-02","body":"A menu should be built into UWP as standard. It should not be necessary to need to use additional toolkits for something so fundamental. Also, this hypothetical standard menu should have a standard way of accessing it with a keyboard - like the Alt key perhaps?"},{"user":"https://wpdev.uservoice.com/users/352036801-vijay-nirmal","datetime":"2017-07-07","body":"UWPCommunityToolkit has released Menu controls for UWP. <a rel=\"nofollow noreferrer\" href=\"https://github.com/Microsoft/UWPCommunityToolkit/tree/master/Microsoft.Toolkit.Uwp.UI.Controls/Menu\">https://github.com/Microsoft/UWPCommunityToolkit/tree/master/Microsoft.Toolkit.Uwp.UI.Controls/Menu</a>"},{"user":"https://wpdev.uservoice.com/users/376149913-zcyzcy88","datetime":"2017-05-19","body":"+1"},{"user":"https://wpdev.uservoice.com/users/60848421-speednet","datetime":"2017-04-17","body":"Importantly, such a menu needs great MOUSE HOVER support.  The UWP menus are terrible with a mouse because there is no hover support.  You open a menu, then hover over another menu... and nothing happens.  You need to click to close the first menu, then click to open the second one -- even if your \"close click\" occurred directly over the second menu!"},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2017-04-01","body":"@neme, open a new issue with the scenario you are trying to solve for with your focus scope."},{"user":"https://wpdev.uservoice.com/users/339939613-neme","datetime":"2017-04-01","body":"Not only that, we need FocusScope for all sorts of menu-like controls. Right now the experience is terrible when making any of these features and using keyboard to navigate."},{"user":"https://wpdev.uservoice.com/users/158611122-thomas-claudius-huber","datetime":"2017-02-17","body":"Yes, with Buttons and Flyouts you can achieve it, but it feels odd and its not styled correct. Also you don't get the mnemonics support (and all the stuff Martin Suchan mentioned), so that the user can navigate to items by using the ALT-key with a character:"},{"user":"https://wpdev.uservoice.com/users/32411334-martin-suchan","datetime":"2017-02-17","body":"We need either full featured classic menu, or the MenuFlyout updated to support common menu features like:\n<br>- menu icons\n<br>- easy definition of keyboard shortcuts with letter underline and the shortcut name displayed on the right\n<br>- full keyboard navigation: left/right between sections, or in the nested section if applicable\n"},{"user":"https://wpdev.uservoice.com/users/14913141-hermit-dave","datetime":"2017-02-17","body":"Interesting idea.. can we not replicate the functionality by Flyout ?"}]}