{"id":"18496081","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/18496081-allow-all-developers-to-access-restricted-capabili","title":"Allow all developers to access restricted capabilities, not just company accounts","body":"I recently browsed the UWP docs and found some interesting APIs about Accessory Management etc. Since I developed an application which could massively profit from those APIs as they allow volume control etc, I wanted to use them. Unfortunately for me, I cannot use those APIs as they are restricted for use and getting access is only possible with a company developer account which I do not have.\n<br>Please allow private developers to access those capabilities. For me it is perfectly acceptable to request access to them so they are still under control but I do not want to create a company account for this.\n<br>Without APIs you are losing customers to Android/iOS as many people would love to have apps which can control their volume, system theme etc. Providing thos apps would boost UWp as platform and thus create more possibilities for Users and Developers together.","votes":"17","user":"https://wpdev.uservoice.com/users/339020188-mirco-klein","datetime":"2017-03-02","comments":[{"user":"https://wpdev.uservoice.com/users/777155605-jeff-lewis","datetime":"2018-04-14","body":"BTW, the 'get a company account if you think you can make enough money from it' argument neatly assumes that everyone is trying to make money from their work."},{"user":"https://wpdev.uservoice.com/users/777155605-jeff-lewis","datetime":"2018-04-14","body":"And this is why, as much as I love UWP as a concept, I'll probably never, ever write for it. I'm mainly a utility developer. The one main capability I need is something like 'broadFileSystemAccess', but with a restriction on accessing the System folder, DLLs and EXEs."},{"user":"https://wpdev.uservoice.com/users/733040155-joshua-todd-cowper","datetime":"2018-01-03","body":"@Clint, I'm going through the process of opening a company account now to access a restricted capability, but it has been very inconvenient that once an individual account has been closed, the same Microsoft account can't be used to open the new company account."},{"user":"https://wpdev.uservoice.com/users/337167343-internetfreak","datetime":"2017-04-10","body":"As I said earlier, I do not see any use in getting a company account now as I don't know if the estimated profit is worth the effort. Of course, it could boost the app but it is not known if everything works as intended. Leaving the company account beside, there's at least one other blocker which I currently cannot solve: As it seems that you are now able to move apps between accounts, I could transfer my app to my future company account without requiring my users to get everything again as acquisition history is also transferred but any IAP the app has would be not transferred. Currently my app depends on IAP as part of the distribution strategy so as long as this problem is not solved, I could not transfer the app and make use of those APIs.\n<br>I would still appreciate it if you would rethink this policy but I will also evaluate whether getting a company account could be of use "},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2017-04-10","body":"If you believe you can massively profit from it, why would getting a company account be a blocker?"},{"user":"https://wpdev.uservoice.com/users/337167343-internetfreak","datetime":"2017-04-03","body":"Well, while I theoretically could take that approach, I have two problems which prevent me from doing so:\n<br>1. I do not have any company yet so I cannot create a company account. My app payouts are too small to justify creating a company at the moment, it would not be practical enough\n<br>2. My app for which I want access to those restricted capabilities is already published under my private developer account. Due to the fact that you cannot upgrade an account, I would be forced to republish the app with a new name using the company account. All my existing customers would then have to repurchase everything in order to use the new app with extended capabilities"},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2017-04-03","body":"ok, i now understand what the ask here is.  You want non-Company based accounts to have access to restricted APIs."},{"user":"https://wpdev.uservoice.com/users/337167343-internetfreak","datetime":"2017-04-03","body":"Hi Clint. I know that documentation. Although it indeed says that anyone can request access, the critical part is a bit hidden. Here is the part why it does not work: \"Apps that declare special-use capabilities require a company account to submit them to the Store. In contrast, restricted capabilities do not require a special company account for the Store. Restricted capabilities are available for developers to use in their app, but require approval for store submission.\""},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2017-04-02","body":"Did you see <a rel=\"nofollow noreferrer\" href=\"https://docs.microsoft.com/en-us/windows/uwp/packaging/app-capability-declarations\">https://docs.microsoft.com/en-us/windows/uwp/packaging/app-capability-declarations</a>.  Talks about getting permission."},{"user":"https://wpdev.uservoice.com/users/337167343-internetfreak","datetime":"2017-04-02","body":"Hi Clint. Sorry for the late response, I did not see the comment until now. I tried to use APIs from the AccessoryManager class. Indeed the APIs work when sideloaded but I want to publish the app within the store and I cannot do that as I do not have a company account so I cannot request access to those APIs, that's the point of my feedback.\n<br>It would be better if I do not have to require my users of the app to sideload it as not everyone knows how to do that."},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2017-03-05","body":"This should be possible for side loaded apps.  What restricted API are you trying to use?"}]}