{"id":"18505435","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/18505435-editable-combo-box","title":"Editable Combo Box","body":"Request for an editable combo box that allows:\n<br>- keyboard focus for the edit box\n<br>- ability to type a value that matches an item in the dropdown\n<br>- ability to type a value that does not match an item in the dropdown (enabled as a control option)\n<br>- auto complete of the item name while typing\n<br>- keyboard navigation for opening the dropdown using Alt + down arrow.\n<br>- keyboard navigation for moving through the list of items in the combo by using left and right arrow keys","votes":"77","user":"https://wpdev.uservoice.com/users/339383530-marcus-perryman","datetime":"2017-03-03","comments":[{"user":"https://wpdev.uservoice.com/users/341464465","datetime":"2018-04-10","body":"I would be nice if the searched item is not found, an optional and customizable  (Add button) appears."},{"user":"https://wpdev.uservoice.com/users/220495497-roland-weigelt","datetime":"2018-03-16","body":"Here's why I need a combobox (and autosuggest doesn't cut it):\n<br>In my application, I have list of objects (some list are grid-like, others tile-based). The objects have 5 - 10 properties each. Users can edit the currently selected object or add a new one.\n<br>In both cases a form pops up that is designed to be as compact as possible. The experience is \"pop up, enter data, confirm, done\" and feels nice. The small form size means that users don't feel too detached from the list below it and there's an overall feeling of speed - with one exception...\n<br>For some of the input fields, users most of the time have to pick a value from a list of values which they don't necessarily know (i.e. auto-suggest doesn't help here), but sometimes they have to add a new value.\n<br>Right now, for these input fields the form shows a dropdown list with an extra \"+\" button behind it (which opens a textbox with OK/Cancel). This solution gets criticized by the users as \"clumsy\" because they sometimes want to select a value from a list and then edit it (like adding \"(test)\" or \"(preview)\" behind the value). And of course they know the concept of a combobox from applications implemented in other UI technologies...\n"},{"user":"https://wpdev.uservoice.com/users/727526044-steven-moyes","datetime":"2017-12-18","body":"Thanks for this feedback. I'm a program manager who is currently investigating adding platform support for Editable ComboBox. The XAML platform has ComboBox and AutoSuggestBox controls which support the basic scenarios of choosing from a list, and entering a custom item already, so I'm trying to determine what scenarios cannot be achieved with the basic platform controls. "}]}