{"id":"18713362","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/18713362-futureaccesslist-bug-after-os-update","title":"FutureAccessList bug after OS update","body":"As the pervious post has been marked as completed: <a rel=\"nofollow noreferrer\" href=\"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/13364760-futureaccesslist-token\">https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/13364760-futureaccesslist-token</a> I'm rising the problem again. This is still happening - I've tested it myself now after the update to 10.0.14393.953. My users are also reporting the same problem and some of them say they resign of the app/platform (!) and I must say that I completely understand them. ","votes":"2","user":"https://wpdev.uservoice.com/users/41489265-romasz","datetime":"2017-03-24","comments":[{"user":"https://wpdev.uservoice.com/users/41489265-romasz","datetime":"2017-04-13","body":"Today I've received the update from 14393.953 to 14393.1066 on my Lumia 950 and I can't get access to files that were accessible yesterday - which means again app lost privileges."},{"user":"https://wpdev.uservoice.com/users/41489265-romasz","datetime":"2017-03-27","body":"Definitely not - the 14393 has been released in August 2016, the files that disappeared have been added at the end of December 2016. What means that the privileges has been lost after one of the updates from January to March - for sure it wasn't update from 10586."},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2017-03-27","body":"is this going from a build 10586 to 14393?"},{"user":"https://wpdev.uservoice.com/users/41489265-romasz","datetime":"2017-03-27","body":"I can't exactly say on what build the problem occurred. I got next review from the user about missing files and gave it a try after updating to 10.0.14393.953 (from one of previous - I update usually as soon as update is available). But it could also happen on earlier update, hence normally I work with beta version of the app, running release version seldom (thought the problem has been fixed). However from now I'm going to double check every update for the issue."}]}