{"id":"1871909","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/1871909-deploy-while-debugging-deployment-should-unlock-th","title":"Deploy while debugging/deployment should unlock the screen","body":"When developing with the phone connected via USB, having the screen lock itself is very annoying, and makes app deployment fail.","votes":"44","user":"https://wpdev.uservoice.com/users/13459741-steve-williams","datetime":"2011-05-26","comments":[{"user":"https://wpdev.uservoice.com/users/36202514-r-schutte","datetime":"2013-05-13","body":"Just set your screen time out to 5 minutes when developing. That will save you a lot of frustrations;)"},{"user":"https://wpdev.uservoice.com/users/14217019-simon-felix","datetime":"2013-05-13","body":"Just a small issue: When I work on my WP app the phone often times out and locks itself. When I hit the Play button, more often than not, I get the error message that I must first turn on and unlock my phone."},{"user":"https://wpdev.uservoice.com/users/24903753-sandy-armstrong","datetime":"2012-05-23","body":"This is hugely annoying.  My device is not PIN locked, so there is no security reason why deploying to the device should not automatically unlock the screen."},{"user":"https://wpdev.uservoice.com/users/16855558-dennis","datetime":"2012-05-10","body":"Obviously, the device would need to be dev unlocked, so I don't think there's any security risk with this feature. I would assume that Allan's comment is referring to a phone that has a lock screen password. Can you currently dev unlock a device who's screen is locked? I wouldn't think so."},{"user":"https://wpdev.uservoice.com/users/18467945-allan-agerholm-dahl","datetime":"2011-12-05","body":"Think about the scenario where I steal a phone from someone else and start deploying apps... Where is the security then?"},{"user":"https://wpdev.uservoice.com/users/13483203-esm","datetime":"2011-05-28","body":"Nobody looses anything by this feature. Moreover, an annoying need to rerrun the debug session will be removed and that definitely speeds debugging and development."}]}