{"id":"1877569","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/1877569-open-access-for-xbox-live-achievements","title":"Open access for XBOX Live achievements","body":"Give ability to create games that have access for xbox live achievements. It doesn't have to be full access. Still only partners can have a \"Xbox live\" mark on their game icon, but having a one place for achievements, leader boards and friends would be great (WP7 Live?)","votes":"20","user":"https://wpdev.uservoice.com/users/13472242-marcin-krupi%C5%84ski","datetime":"2011-05-27","comments":[{"user":"https://wpdev.uservoice.com/users/217006245-marc-andre-larouche","datetime":"2016-08-13","body":"I have cross platforms games that already use achievements/trophies on theses platforms and the number 1 request on Windows store is to implement Achievements (which I really want to do but are limited to id_xbox). I wanted to register at id_xbox but they declined. (My past experience included a company that had bad blood with MS, I'm not sure if it played in the refusal, but I'm sad that a company that treated their employees like ****, and misconducted themselves with Microsoft could hurt independent developer... I wasn't involved in the feud, but I fell shamed by Microsoft because of it."},{"user":"https://wpdev.uservoice.com/users/36508681-rp-interactive","datetime":"2013-05-22","body":"Actually, if the Xbox team wants out of this, it is fine, but Windows Phone Games still !need a concept! for having an achievement system, that is nice and stable."},{"user":"https://wpdev.uservoice.com/users/18846506-dastopher","datetime":"2013-03-07","body":"I agree."},{"user":"https://wpdev.uservoice.com/users/17150881-tim","datetime":"2011-11-16","body":"I disagree, keep achievements restricted. I like the fact that there's a sense of quality control around what can give you an achievement. It makes the achievement points actually mean more. Otherwise you end up with a load of free games of really really cheap games that are designed just to give you achievement points. Then peoples achievement score becomes less about achievements for playing games and more about who's spent time downloading rubbish just for the points."}]}