{"id":"1901813","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/1901813-sms-access-api","title":"SMS Access API","body":"Please provide an API that provides access to the texts to allow developers to implement an application to enable scenarios such as reading or archiving SMS messages.","votes":"4,251","user":"https://wpdev.uservoice.com/users/13607630-marco-mura","datetime":"2011-06-04","comments":[{"user":"https://wpdev.uservoice.com/users/345288469","datetime":"2017-03-18","body":"I want to build a software on Windows Phone that can access the user's messages."},{"user":"https://wpdev.uservoice.com/users/291927730","datetime":"2016-12-03","body":"windows phone looks great but had no apps i want windows look and android app insert the android app"},{"user":"https://wpdev.uservoice.com/users/172378341-rolf-van-kuijen","datetime":"2016-06-02","body":"Would really love to have this now, especially if Mobile wants to survive.\n<br>(Still amazing you all haven't fired that guy who is doing the marketing and business relations, worst manager(s) ever.)"},{"user":"https://wpdev.uservoice.com/users/172184541-jason-coley","datetime":"2016-06-02","body":"This seems crazy, Windows Phone needs an app that can respond to all sms messages with an automatic reply if setup. This needs to switched on and off as the user needs it. My wife is a, LMC (private) midwife, who requires this capability for after hours. She and two others handle the after hours on a roster. The sms tells the client that they can contact the midwife on-call if the matter is urgent, or it is just a non urgent question to wait until the next day. I am sure there are many other jobs that require this very basic of things also."},{"user":"https://wpdev.uservoice.com/users/64438801-jeremy-stafford","datetime":"2016-01-02","body":"I recall this being possible in pre 8.1 phone builds. We would also need access to the SMS history so that incoming push messages or periodic pulling from a server would be able to insert messages into a conversation for a seamless experience. In theory, this would allow user to switch between text messaging on a desktop/universal app and the phone itself without any interruption in the conversation."},{"user":"https://wpdev.uservoice.com/users/125604903","datetime":"2015-11-26","body":"Really 10000 votes and still not. This is strange what could possibly be the reason."},{"user":"https://wpdev.uservoice.com/users/105399792-sohail-hirani","datetime":"2015-10-30","body":"User text messages can be accessed via the ChatMessageManager api (<a rel=\"nofollow noreferrer\" href=\"https://msdn.microsoft.com/en-us/library/windows/apps/windows.applicationmodel.chat.chatmessagemanager)\">https://msdn.microsoft.com/en-us/library/windows/apps/windows.applicationmodel.chat.chatmessagemanager)</a>. Restricted capabilities may be used by company accounts by becoming microsoft partners and requesting the use of the capability for the scenario of the app."},{"user":"https://wpdev.uservoice.com/users/116600514-absolutesith","datetime":"2015-10-30","body":"Well only microsoft and its partners can use these API's, just great!"},{"user":"https://wpdev.uservoice.com/users/105399792-sohail-hirani","datetime":"2015-09-23","body":"Universal SMS API in windows 10 can be used to send and recive SMS. Here is the link for the sample application: <a rel=\"nofollow noreferrer\" href=\"https://github.com/Microsoft/Windows-universal-samples/tree/master/Samples/SmsSendAndReceive\">https://github.com/Microsoft/Windows-universal-samples/tree/master/Samples/SmsSendAndReceive</a> . It requires capability \"cellularMessaging\". While verifying the changes check if the device is unlocked: <a rel=\"nofollow noreferrer\" href=\"https://msdn.microsoft.com/library/windows/apps/xaml/dn706236.aspx\">https://msdn.microsoft.com/library/windows/apps/xaml/dn706236.aspx</a>.\n"},{"user":"https://wpdev.uservoice.com/users/96190278-matteo","datetime":"2015-09-03","body":"Still not there, ridicolous :/"},{"user":"https://wpdev.uservoice.com/users/100084014","datetime":"2015-09-03","body":"This needs to be there for simpler SMS registration. A user sends an SMS to a number designated for service registration and should get an automatic response in SMS threat could then be parsed out to check if registration worked. This is common in Android"},{"user":"https://wpdev.uservoice.com/users/67197968-mike-eee","datetime":"2015-09-01","body":"Wow... 10,000 votes, and it's been over a year since the last MSFT response on this... what is the status of this (very popular -- currently rated #1 by FAR) feature request?"},{"user":"https://wpdev.uservoice.com/users/84642349-andrew","datetime":"2015-08-26","body":"Yer, fingers crossed for this one. I've started on an android version of the app and hoping by the time I release that MS have this released the private API for public."},{"user":"https://wpdev.uservoice.com/users/67197968-mike-eee","datetime":"2015-08-26","body":"Wow... 10,000 votes, and it's been over a year since the last MSFT response on this... what is the status of this (very popular -- currently rated #1 by FAR) feature request?"},{"user":"https://wpdev.uservoice.com/users/91933732-sleerf","datetime":"2015-08-02","body":"By the way... This should be integrated with cortana so I can be typing on a document and say \"Hey cortana. Send a text to Cheryl to let her know I'll be leaving from work 20 minutes late\" and it gets sent in the background from my phone without me even having to stop typing my document. It's time for MS to  be Magnificent. :-)"},{"user":"https://wpdev.uservoice.com/users/91933732-sleerf","datetime":"2015-08-02","body":"This is the one thing holding me back from buying a windows phone. I HATE touch screen keyboards and whenever possible I use my tablet PC with a real keyboard to send and receive text messages via mightytext. There is absolutely no comparable capability with windows phone and I use this far too much to even consider changing although I REALLY REALLY want to move to a complete windows integrated environment with my phone, nokia 2570 tablet, fujitsu T904 tablet PC on WINX and home PC/home \"server\" with WINX. PLEASE open the API so people can develop this and I can move to a windows phone and buy the developer's software! "},{"user":"https://wpdev.uservoice.com/users/84642349-andrew","datetime":"2015-07-02","body":"Really hope this comes with W10 and is available to normal developers. Even if your app had to go through more checks to make sure this wouldn't be exploited. How else are we meant to get apps for smart watches etc that can handle the sending a receiving of texts."},{"user":"https://wpdev.uservoice.com/users/78642843","datetime":"2015-05-29","body":"Yury, that api: <a rel=\"nofollow noreferrer\" href=\"https://msdn.microsoft.com/cs-cz/windows.devices.sms.smsdevice2\">https://msdn.microsoft.com/cs-cz/windows.devices.sms.smsdevice2</a>"},{"user":"https://wpdev.uservoice.com/users/76131969-vinod-kulkarni","datetime":"2015-05-13","body":"Just want to send one sms without user interaction. Please help ."},{"user":"https://wpdev.uservoice.com/users/74443452-social-developer","datetime":"2015-05-02","body":"Does Nadella know why there are no WP developers? Because you guys treat us with such contempt. Just look at all the issues here..."}]}