{"id":"19226020","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/19226020-class-not-registered-with-packagedcomserver-clien","title":"CLASS_NOT_REGISTERED with PackagedCOMServer client app","body":"How can we ensure registration is complete for the COM server without adding regsvr32 command in post build and setting linker value for “Register Output” to false. We can see the entries added in the registry, but client cannot access the interfaces.  We see an error CLASS_NOT_REGISTERED message. Saw the same issue with client app in PackagedComServer sample with those 2 settings changed. (removal of regsvr32 in post build, and register output to false).\n<br>Link to the sample: <a rel=\"nofollow noreferrer\" href=\"https://github.com/Microsoft/DesktopBridgeToUWP-Samples/tree/master/Samples/PackagedComServer\">https://github.com/Microsoft/DesktopBridgeToUWP-Samples/tree/master/Samples/PackagedComServer</a>","votes":"3","user":"https://wpdev.uservoice.com/users/371593489-pranav","datetime":"2017-05-10","comments":[{"user":"https://wpdev.uservoice.com/users/170319330-windows-project-centennial-team","datetime":"2018-01-02","body":"Pranav - If the appx package is installed, then all the registry entries specified in the manifest are registered in the catalog for Packaged COM.  Applications that access your classes through standard COM calls (CoCreateInstance, etc) will work as the COM apis look in both the public registry and the Packaged COM catalog."},{"user":"https://wpdev.uservoice.com/users/371593489-pranav","datetime":"2017-06-22","body":"I have installed the appx package and then tried to create a client application that uses the COM binary"},{"user":"https://wpdev.uservoice.com/users/170319330-windows-project-centennial-team","datetime":"2017-05-15","body":"Pranav,\n<br>The PackagedCOM Server can be installed on a Windows 10 Creators Update drop and it will register the public classes and interfaces thru Packaged COM.  Then an existing client can be deployed that uses those classes &amp; interfaces.\n<br>  \n<br>If you are seeing CLASS_NOT_REGISTERED errors, can you confirm you've deployed the appx package (either by double clicking the appx file or running \"add-appxpackage &lt;packagename.appx&gt;\"?  If you've only done a build in VS, then nothing gets registered on the system.  "}]}