{"id":"19635991","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/19635991-speech-recognition-performance-when-the-grammar-i","title":"Speech Recognition performance (when the grammar is local and the device is connected to a network)","body":"If the device is connected to a network, speech recognition with local SRGS custom grammar, it behaves exactly as if it did not have the local grammar and starts to communicate to the \"websockets.platform.bing.com:443\" endpoint, increasing by tens of times the waiting-time for the result... But if the device is disconnected from any network then the waiting time between \"SpeechRecognizer StateChanged starts “SoundEnded”\" and \"the ResultGenerated event is invoked\" is very small, less than 10ms! it should always be this way, since the grammar is on the device.","votes":"5","user":"https://wpdev.uservoice.com/users/397324024-claudio-castagnetti","datetime":"2017-06-18","comments":[{"user":"https://wpdev.uservoice.com/users/397324024-claudio-castagnetti","datetime":"2017-06-20","body":"Thanks for your collaboration. I understand but in the full local grammar scenario to wait for the answer from an end-point, **which will then be discarded**, before raising the ResultGenerated event by increasing this time several tens of times, it should also be avoided to appreciate the excellent speed performance of the UWP Speech Recognizer engine.\n<br>You also send the data to improve the service but in the meantime raise the ResultGenerated event.\n<br>Alternatively, the developer should be given a choice by setting a parameter: high speed in \"full local mode\" or low speed in \"hybrid mode\" and, of course, in the latter case, account should also be really taken of remote server response.\n<br>Here I have described in detail the current behavior:\n<br><a rel=\"nofollow noreferrer\" href=\"https://social.msdn.microsoft.com/Forums/en-US/329a9274-1671-400c-8677-4154ace2d5f2/uwp-speech-recognition-performance\">https://social.msdn.microsoft.com/Forums/en-US/329a9274-1671-400c-8677-4154ace2d5f2/uwp-speech-recognition-performance</a>"},{"user":"https://wpdev.uservoice.com/users/397324024-claudio-castagnetti","datetime":"2017-06-20","body":"build 15063, this issue occurs on every platform: from Raspberry PI with Windows 10 IoT Core to Desktop PC with Windows 10 Professional"},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2017-06-19","body":"what build of windows are you on?"}]}