{"id":"2032347","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/2032347-convert-an-individual-account-into-a-company-one","title":"Convert an individual account into a company one","body":"I started as a sole developer, and now there's a group of us, and we are registered as a business with IRS. I would like to be able to convert my individual account in the Marketplace into a company one without losing my publisher name, my brand, my app portfolio and my user base. It is a common scenario in the \"real\" world, so why should it be impossible in the Marketplace?","votes":"148","user":"https://wpdev.uservoice.com/users/14334158-arkady-elterman","datetime":"2011-07-13","comments":[{"user":"https://wpdev.uservoice.com/users/392522821-muhammad-touseef","datetime":"2018-04-20","body":"sadly this feature is still not available, I am also an indie developer and in order to use some restricted capabilities, I have to upgrade to a company account, but sadly I cant because this feature is still not imlemented. just look at the votes people do want it. "},{"user":"https://wpdev.uservoice.com/users/733040155-joshua-todd-cowper","datetime":"2018-01-03","body":"It is very inconvenient that once an individual account has been closed, the same Microsoft account can't be used to open the new company account."},{"user":"https://wpdev.uservoice.com/users/277367599","datetime":"2016-11-05","body":"So far that is not truth, you cannot transfer from a individual account tio a company account. The process of opening a company windows developer account requires to have a Microsoft account, but in order to have a Microsoft account you have to use a public email address (not a company email address). Even if we paid the subscription as a company, we are trying to break the link between the individual email address (used to login into company developer account), but the suppport is simulate that it guide us, while in fact they mockup of us. Shame you Microsoft! "},{"user":"https://wpdev.uservoice.com/users/214918980-dt","datetime":"2016-08-10","body":"This feature is currently in Preview. \n<br>When will this feature implemented from \"In Preview\" to \"Implemented\" state?\n<br>Also what about the investigation of apps with IAP to transfer to another account?"},{"user":"https://wpdev.uservoice.com/users/156569496-gobi-m","datetime":"2016-04-04","body":"it possible to Individual account to company  account bcz i wrongly create Individual account, so please inform to   change account process"},{"user":"https://wpdev.uservoice.com/users/142030212-vf","datetime":"2016-02-04","body":"Also if you have no IAP you could not transfer your app, because it is still \"in preview\""},{"user":"https://wpdev.uservoice.com/users/49184845-joshros","datetime":"2016-01-21","body":"\"The feature is available to every app, except if the app has IAP – support for IAP is being investigated for the future.\" "},{"user":"https://wpdev.uservoice.com/users/127509018-gg","datetime":"2015-12-03","body":"What is the current state of this?"},{"user":"https://wpdev.uservoice.com/users/83343796-sebastien-moulin","datetime":"2015-06-25","body":"As I misread and realized to let that I wrongly created a company account instead of a individual account I would like to be possible to change the developer account type that I request. I the mean time I had to create another email dedicated just to that, this is not a solution for me. I still don't understand why it is still not possible since any legal procedure will have to be validated and checked before the account being activated in either case."},{"user":"https://wpdev.uservoice.com/users/83321455-kjetil-kristoffer-solberg","datetime":"2015-06-25","body":"I made the mistake of registering a dev account using the type company instead of individual. Now I cannot change it to individual. This is not good enough. I have to be able to change dev account type. Please make this happen as soon as possible."},{"user":"https://wpdev.uservoice.com/users/58063979","datetime":"2014-10-10","body":"Wendoz\n"},{"user":"https://wpdev.uservoice.com/users/53591385-greg","datetime":"2014-07-11","body":"we did this move on ios and android and it was very easy. Developers definitly need a way to migrate from an individual account to company account because this is a very usual issue when business is growing. I think both Microsoft and us want the business to grow, right ???"},{"user":"https://wpdev.uservoice.com/users/52035617","datetime":"2014-06-05","body":"If you start out as an individual developer account and then later incorporate into a company, it should be possible to convert your account and change your publisher name without having to create an entirely different account.  The current way you are supposed to do it is to make a new account and transfer the apps however, if you use the Windows Push Notification system then it is not possible to transfer an app at all.  This problem does not exist on any of the other mobile platforms.  On Android Google Play store you can change your publisher name instantly and for iOS Store you can make the change with only a couple days lag time.  And on neither of them does it ruin your push notifications."},{"user":"https://wpdev.uservoice.com/users/45547858-pratik-chheda","datetime":"2014-01-10","body":"<a rel=\"nofollow noreferrer\" href=\"http://wpdev.uservoice.com/forums/110711-dev-center-store/suggestions/5337075-come-up-with-an-alternative-non-creditcard-method\">http://wpdev.uservoice.com/forums/110711-dev-center-store/suggestions/5337075-come-up-with-an-alternative-non-creditcard-method</a>"},{"user":"https://wpdev.uservoice.com/users/43401494-jesse","datetime":"2013-11-19","body":"dev.windowsphone.com accounts should be able to downgrade form Company to Individual. Alternatively, to allow multiple accounts per Microsoft account. "},{"user":"https://wpdev.uservoice.com/users/20512601-andrii","datetime":"2013-06-27","body":"You can transfer apps by contacting support and you can change name from one account to another.\n<br>However I wonder too why I can't switch country and account type!"},{"user":"https://wpdev.uservoice.com/users/36704527-daniel","datetime":"2013-05-28","body":"I'm having the same problem with my \"Windows Phone\" version. For my 'iPhone' version, it was a matter of simple call to Apple support and the problem was solved within 2 business days. I don't see why it is not possible with Windows Marketplace."}]}