{"id":"2282240","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/2282240-xaml-for-live-tiles","title":"XAML for live tiles","body":"Allow developers to implement an interface(s) on a user control and \"submit\" that instead of just filling in a tile data structure. This will make tiles truly \"live\" and open up the live of WP7 to new applications. This is also completely secure because the runtime can analyze the class (and it's IL) being submitted. A bevy of restrictions can also be heaped on the said user control in order to maintain performance and not sap battery life. Let Live tiles be live, please.","votes":"494","user":"https://wpdev.uservoice.com/users/16555219-ananth-balasubramaniam","datetime":"2011-09-28","comments":[{"user":"https://wpdev.uservoice.com/users/26802775-andrew-bares","datetime":"2015-08-25","body":"Update: Adaptive Tile Templates have been added in Windows 10, partially addressing this issue. Adaptive is a lightweight XML way to define your tile notification's appearance. It isn't as powerful as XAML, and it isn't animated, but it's a step in the right direction."},{"user":"https://wpdev.uservoice.com/users/19277761-evilsushi","datetime":"2015-03-05","body":"Couldn't you default back to ordinary live tiles on memory or resource constrained systems?"},{"user":"https://wpdev.uservoice.com/users/54077101-lukas","datetime":"2014-10-22","body":"Wow this would be so amazing!! Please do this!! Especially for Windows Desktop where resource constrains are much less of an issue..."},{"user":"https://wpdev.uservoice.com/users/36360515-martin-anderson","datetime":"2014-08-12","body":"If the designer/developer is able to generate XAML (in the background thread) and then the OS generates that XAML as an image or Animated PNG file before displaying that on the Tile."},{"user":"https://wpdev.uservoice.com/users/34377407-adriano","datetime":"2014-07-29","body":"Light-weight XAML would be fantastic! On other mobile-OS the Tile is activated only once it is visible, this could be a nice solution for a good performance :)"},{"user":"https://wpdev.uservoice.com/users/18903846-hanno","datetime":"2013-10-31","body":"you can do this allready. Create a live tile with XAML, render it and use it as Background. There are a lot examples out there"},{"user":"https://wpdev.uservoice.com/users/38223928-i-have-many","datetime":"2013-07-09","body":"Also allow local updating of faster than 30 minutes as per iOS and Android, they can update the badge numbers on the home screen icons in real time ala timer apps so Windows Phone should be able to do the same!"},{"user":"https://wpdev.uservoice.com/users/27165535-daniel","datetime":"2013-04-04","body":"Needed. Currently, there are Live Tiles for 1st party apps (people, Xbox, etc.) but third party apps are just a template where we can provide data. This is pretty dump in my opinion. Even the counter for notifications on the tile for third party apps (small circle with a number) makes my app look amateurish because first party apps can use big fonts with animated numbers. On iOS and Android, third party apps have a similar look and feel as first party apps. Only in Windows Phone, Microsoft has decided to make third party app developers look bad. "},{"user":"https://wpdev.uservoice.com/users/16555219-ananth-balasubramaniam","datetime":"2012-01-28","body":"Alternate way: Let’s suppose the API allowed us to pass in the URI to a XAML file instead, one that wasn’t allowed to link to any assembly namespaces (so it couldn’t run custom code or require the OS to load in any other assemblies). The OS would load the XAML file from the given URI, verify that it didn’t require or link to any assemblies and set its content root into a “tile”, allowing the XAML to run any animation it needed. Any URI’s that referred to the application’s isolated storage would be redirected to access the appropriate location. Battery life concerns could be addressed by suspending ALL (and I mean ALL) live tile animations when battery saver is enabled. This would allow flexible, really live tiles that would be on par with OS live tiles."},{"user":"https://wpdev.uservoice.com/users/17925924-fyter","datetime":"2011-12-16","body":"System can do, App can do too.\n<br>Like 'People' tile animation, like SMS's number, like picture tile animation."},{"user":"https://wpdev.uservoice.com/users/13472422-alex-f","datetime":"2011-10-12","body":"I think you confused WP7's live tiles with Android's widgets. No thanks."},{"user":"https://wpdev.uservoice.com/users/16555219-ananth-balasubramaniam","datetime":"2011-09-28","body":"Such live tiles can also interact with background agents by being passed in to OnInvoke via ScheduledTask."}]}