{"id":"2431302","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/2431302-add-a-grantaccountaccesstask-for-obtaining-tempora","title":"Add a GrantAccountAccessTask for obtaining temporary access to social media accounts","body":"Social networking APIs, like Facebook, are constantly adding new features. Proving access to the authentication directly (even if it were temporary) would allow applications to use the most up-to-date social networking SDK to provide better features for their users.","votes":"361","user":"https://wpdev.uservoice.com/users/13519857-richard-szalay","datetime":"2011-12-04","comments":[{"user":"https://wpdev.uservoice.com/users/13519857-richard-szalay","datetime":"2011-12-12","body":"I am familiar with ShareStatus/Link, but they don't include custom features such as \"like\" or accessing the user's friend list. The core API will never be able to match the Twitter/Facebook/LinkedIn SDKs feature-for-feature, so allowing the application to obtain an access token (with user approval, noting permissions) would allow them to do more."},{"user":"https://wpdev.uservoice.com/users/14085782-brandon","datetime":"2011-11-30","body":"Removing my votes since ShareStatus/Link Tasks satisfy me"},{"user":"https://wpdev.uservoice.com/users/12895898-mithril","datetime":"2011-08-15","body":"As Solace already mentioned, this Feature is available (could be \"better\" though). It is called ShareStatusTask or ShareLinkTask. Look here: <a rel=\"nofollow noreferrer\" href=\"http://msdn.microsoft.com/en-us/library/ff769550%28v=vs.92%29.aspx\">http://msdn.microsoft.com/en-us/library/ff769550%28v=vs.92%29.aspx</a>"},{"user":"https://wpdev.uservoice.com/users/13472984-solace","datetime":"2011-07-21","body":"Mango does introduce the start of this with the phone task \"ShareStatusTask\" and \"ShareLinkTask\" but I would like to see delegation when the phone prompts the user to deligate permission to the application to post on their behalf without the need of pull update dialog after dialog."},{"user":"https://wpdev.uservoice.com/users/14333170-hassan-hassoun","datetime":"2011-07-13","body":"end yahoo ?\n"},{"user":"https://wpdev.uservoice.com/users/14194124-lyubomir-dokov","datetime":"2011-07-06","body":"I think this would distinguish the platform from others. I am not sure, but I think no other platforms has this - you input your credentials for certain services in a central place, and every application can use them, after it asks your permission."},{"user":"https://wpdev.uservoice.com/users/14107570-steven-sporen","datetime":"2011-07-01","body":"This would simplify the process greatly for the end user who could manage permissions for the apps through Facebook however not have to enter username/passwords every time they want to post something from a game or app."},{"user":"https://wpdev.uservoice.com/users/12907145-tiago","datetime":"2011-06-08","body":"and Skype in the future..."},{"user":"https://wpdev.uservoice.com/users/12955574-chris-patterson","datetime":"2011-05-24","body":"That really would be great.  All of the different apps that have differing implementation of sharing to facebook, twitter etc and making me login for each of those apps is a huge pain.  The phone already has these accounts and I simply want to give permission to an app to allow me to share through those accounts"},{"user":"https://wpdev.uservoice.com/users/12932483-joelmartinez","datetime":"2011-04-21","body":"this would be awesome"},{"user":"https://wpdev.uservoice.com/users/12932474-matthias","datetime":"2011-04-19","body":"Every other client I have wants some kind of social networking connection. Given that the user has already trusted their phone with that data, adding some kind of API access would help make the overall app experience feel more holistic. No reason to reinvent the wheel with every new app."},{"user":"https://wpdev.uservoice.com/users/12895898-mithril","datetime":"2011-04-17","body":"Yes! The phone is deep connected with Windows Live and Facebook and 3rd parties don't have access... kinda really stupid :("}]}