{"id":"2470000","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/2470000-remove-search-restrictions","title":"Remove Search Restrictions","body":"Remove the 50 apps limit from the phone and 100 app limit from the marketplace web site when users search for an app with a search term.  If an app can not be found with its ideal keyword (becuase over a hundred apps already have used that search term) then new apps cannot be found with their ideal search terms.  The concept of paging using skip and take very easily resolves this issue.  It's quite dissapointing that a Bible app cannot be found with the search term bible.","votes":"28","user":"https://wpdev.uservoice.com/users/18903752-charles-brewer","datetime":"2011-12-22","comments":[{"user":"https://wpdev.uservoice.com/users/132224892-wangshan","datetime":"2015-12-22","body":"The irony is that the number of windows store apps is not much when they make such a restriction."},{"user":"https://wpdev.uservoice.com/users/124884948-claus","datetime":"2015-11-23","body":"The whole store has an atmosphere of emptiness...and you are ruining the investment of people who develop apps for your platform or buy a phone or computer with windows and look desperately for apps!"},{"user":"https://wpdev.uservoice.com/users/47193675-jz","datetime":"2015-01-14","body":"This is ridiculous. 50 items on the search list. I have spent the last 2 years trying to change the keywords. My app is still invisible. My motivation for a new app is below zero !!"},{"user":"https://wpdev.uservoice.com/users/58816159-robert-lewis","datetime":"2014-10-24","body":"When you do a search in the marketplace by keyword the query only shows the top 50 results."},{"user":"https://wpdev.uservoice.com/users/57505646-richard-moore","datetime":"2014-09-29","body":"Couldn't agree more! Limiting Marketplace searches to 50 results basically means that the Market place is broken."},{"user":"https://wpdev.uservoice.com/users/57011141-valerio","datetime":"2014-09-19","body":"Almost 4 years and still nothing has changed! What are you waiting for?!?!?\n<br>This is a great problem for ALL the new developers or new Apps. "},{"user":"https://wpdev.uservoice.com/users/46636215-pitchlab","datetime":"2014-02-17","body":"The ability to filter by paid or free might help a little, purely because there is likely to be a mix of payment models, thus squeezing a bit more mileage out of the 50 result limit."},{"user":"https://wpdev.uservoice.com/users/47193675-jz","datetime":"2014-02-16","body":"Same Problem here. My App is absolutely invisible in the store. Can anyone tell me what is the intention behind the limited search list. Until then, i quit every engagement for this platform."},{"user":"https://wpdev.uservoice.com/users/35851125-max-meng","datetime":"2014-02-12","body":"oh dear, so this is a suggestion 3 years ago, where is the support.."},{"user":"https://wpdev.uservoice.com/users/46636215-pitchlab","datetime":"2014-02-04","body":"I second this suggestion."},{"user":"https://wpdev.uservoice.com/users/18903752-charles-brewer","datetime":"2011-12-31","body":"Many people have told me that they are sticking with the Android system because it has more apps.  If I do a search for the term bible on an android, I get over 1500 results ( it implements paging),  WP7 I get 50?  This doesn't just apply to a Bible app, it applies to almost anything that has ideal search keywords.   I apologize for nagging but 50?  C'mon! Where's the vision?"}]}