{"id":"2635883","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/2635883-fix-the-way-the-marketplaces-uses-key-word-tags-fo","title":"Fix the way the marketplaces uses key word tags for apps","body":"Start by expanding the number of apps that can use a certain key word, such as \"childrens stories\" so that new apps who innovate can displace those who got their first with potentially crappy apps.   Secondly, you need to limit the number of apps that a publisher can submit with a particular key word.  For instance, if I build a children's book app and then submit that same app 50 times, each time with a different name and book loaded, i have essentially used up all the available space on the marketplace app search results screen, thereby stifling competition and innovation through use of questionable practices and a bad app design.   All subsequent children's book apps will be essentially \"undiscoverable\" no matter how good they are...","votes":"4","user":"https://wpdev.uservoice.com/users/21397149-mikem","datetime":"2012-02-28","comments":[{"user":"https://wpdev.uservoice.com/users/39261576-vince","datetime":"2013-08-08","body":"I recently released my first app a month ago. I spent several months and used many Windows Phone features such as Live Tiles, Skydrive, Camera, GPS, loop selectors, pivot pages, panorama pages to name a few. I built nice tools for editing images and created visual effects to provide a pleasant experience for the user. I spent the extra time to polish and test to deliver a first quality piece of software. I created detailed help for every page in my app which consists of about 20 pages. I published my app with no issues and provided a detailed description what my app was all about, also uploaded 9 nice images of my app.  Now the dishearten part, you can't find my app when searching on the phone unless  you know the name 'FishBone'. If you search by 'fishing' you get a list of apps that have little or nothing to do with fishing, and many apps are very low quality, pure descriptions one or two screenshot, very few downloads or few or no comments. \n<br>I have developed for Windows since the early 90's and have gone through many of Microsoft technologies. I used an iPhone for several years until Windows 8 came out and switched as soon as I was able to. The main statement I get from most people who use other phone technologies (iPhone and Android) is they don't switch to Windows because there are NO apps even though they are interested in the new interface Windows provides. It would seem to me that Microsoft would be concerned about this position and want to provide visibility to those developers who spend the time to provide a quality experience. Search for ‘fishing’ and checkout some of the app you find. \n<br>One other suggestion would be to modify the search system; iPhone has a far more robust search to find apps by category, type, games, sports, etc. I want to build more application for this platform but I am discouraged by the lack of visibility."}]}