{"id":"2778723","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/2778723-provide-developers-and-api-to-access-default-syste","title":"Provide developers and API to access default system sounds (such as those found in Settings - ringtones+sounds)","body":"It would be really helpful if, for example, a developer makes an app that takes advantage of the schedule alarm API, and would like to enable the user to select a custom ringtone for that alarm. This API proposal would enable the user to select from many ringtones already available on the phone, and save developers the trouble of having to implement their own custom ringtones.","votes":"51","user":"https://wpdev.uservoice.com/users/23417084-oliver-kevin-fuh","datetime":"2012-04-18","comments":[{"user":"https://wpdev.uservoice.com/users/55295652","datetime":"2014-08-17","body":"Hello fellow Windows Platform Developers, please refer to this similar thread requesting for an improved Alarm/Reminder APIs:\n<br><a rel=\"nofollow noreferrer\" href=\"http://wpdev.uservoice.com/forums/110705-dev-platform/suggestions/6281055-need-improved-alarm-reminder-apis-in-wp8-1-run\">http://wpdev.uservoice.com/forums/110705-dev-platform/suggestions/6281055-need-improved-alarm-reminder-apis-in-wp8-1-run</a>"},{"user":"https://wpdev.uservoice.com/users/49452979-shashi","datetime":"2014-04-07","body":"Agree. I was thinking about something like that which works in a emergency situation. Seems like currently we cannot do it. It would have been very good if this was possible."},{"user":"https://wpdev.uservoice.com/users/45729173-jeffr","datetime":"2014-01-14","body":"Yes, access the sounds in the system, for crying out loud. Blackberry, iOS, and Android can all do this. Why do we have to force the user to pick OUR sounds, when they're, like, \"I have the perfect sound clip for this...but I can't use it?\""},{"user":"https://wpdev.uservoice.com/users/41192696-brian-elgaard","datetime":"2013-10-02","body":"I absolutely agree. I am surprised that each alarm app needs to provide its own set of sound files."}]}