{"id":"2854511","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/2854511-provide-api-to-lock-unlock-the-screen-and-provi","title":"Provide API to lock & unlock the screen, and provide API to display customized window to replace the default unlocking window","body":"The customized unlock apps are very popular on android and symbian, we hope that we could do the same on WP7.","votes":"32","user":"https://wpdev.uservoice.com/users/24671410-anderson","datetime":"2012-05-15","comments":[{"user":"https://wpdev.uservoice.com/users/869140144-arun-singh-rawat","datetime":"2018-11-14","body":"Please provide this feature as soon as possible"},{"user":"https://wpdev.uservoice.com/users/869140069","datetime":"2018-11-14","body":"Please provide this feature as soon as possible."},{"user":"https://wpdev.uservoice.com/users/763940932","datetime":"2018-05-17","body":"please provide this feature as soon as possible"},{"user":"https://wpdev.uservoice.com/users/215048127","datetime":"2016-08-24","body":"Any news on that ? A uwp api would be good to lock screen on both desktop or mobile device. It would allow lot of new ideas for applications"},{"user":"https://wpdev.uservoice.com/users/184642965-charles-walker","datetime":"2016-06-30","body":"Any news on that ? A uwp api would be good to lock screen on both desktop or mobile device. It would allow lot of new ideas for applications"},{"user":"https://wpdev.uservoice.com/users/154518594-tristan","datetime":"2016-03-27","body":"The old Silverlight way of doing things in 8.1 involved Obscured and Unobscured events. But for W10 Phones there is no equivalent. No way to detect when the user just entered their password and unlocked the device."},{"user":"https://wpdev.uservoice.com/users/50567604","datetime":"2014-07-26","body":"I would like the ability to programmatically lock the screen.  "},{"user":"https://wpdev.uservoice.com/users/22315827-anonymous","datetime":"2012-08-05","body":"I'm developing an app containing data that a user might want to keep in view for a while, without worrying about accidentally pressing any of the hardware buttons, thereby exiting the current view.  It would be great if I could display an option to lock the screen, which would basically lock the screen, but show my own page as the lock screen. Maybe the normal screen timeout would apply here as well, rather than the lock screen timeout.  If the screen turned off, pressing the unlock button would again display my page, maybe with a built-in label at the bottom, instructing the user to slide to unlock."}]}