{"id":"2976742","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/2976742-custom-keyboard-via-code","title":"Custom keyboard via code","body":"Allow to developers create a custom keyboard. eg. choose letters and numbers together","votes":"1,877","user":"https://wpdev.uservoice.com/users/24636434","datetime":"2012-07-04","comments":[{"user":"https://wpdev.uservoice.com/users/672097090-amila-thushara","datetime":"2017-09-20","body":"Can i create custom keyboard in sinhala language"},{"user":"https://wpdev.uservoice.com/users/252511918-muhammad-naveed-jamali","datetime":"2016-09-24","body":"if windows phone does not authorize developers to develop custom keyboard apps then it must provide bulletin Keyboards for languages which may be enabled or disabled by user. Specially Social media is entirely used in Native languages. "},{"user":"https://wpdev.uservoice.com/users/203766084","datetime":"2016-07-28","body":"Tibetans are appearing on windows phones with no problem, but still have no keyboard. Needs improve it. even android and OS have it."},{"user":"https://wpdev.uservoice.com/users/172378341-rolf-van-kuijen","datetime":"2016-06-02","body":"As long as the custom keyboard is only inside the app (and not outside like Android) I wouldn't mind having this for a better internation app.\n<br>When it goes outside the App there will be a lot of security issues!\n"},{"user":"https://wpdev.uservoice.com/users/169104930","datetime":"2016-05-22","body":"We really need the APIs to develop a custom keyboard for Windows Mobile!\n<br>Thanks, Simeone Vilardo."},{"user":"https://wpdev.uservoice.com/users/148469865-ashraful-haque-tushar","datetime":"2016-02-28","body":"Custom Keyboard is very important. Specially for Bengali language. Here we use Three types of keyboard in Bangladesh - Bijoy, Provati &amp; Phonetic. In India they have also different keyboard layout."},{"user":"https://wpdev.uservoice.com/users/130213548-sebastian-forman","datetime":"2015-12-14","body":"First word works.\n<br>Next word doesn't work, but only adds a space\n<br>Second attempt works."},{"user":"https://wpdev.uservoice.com/users/118794489-fawad-hussain","datetime":"2015-11-05","body":"Still no response?"},{"user":"https://wpdev.uservoice.com/users/101464734-alexis","datetime":"2015-09-08","body":"Try getting more apps snap chat etc, and allow custom keyboard apps. "},{"user":"https://wpdev.uservoice.com/users/67197968-mike-eee","datetime":"2015-09-01","body":"Wow... 4700+ votes, and it's been over a year since the last MSFT response on this... what is the status of this (very popular -- currently rated #2) feature request?"},{"user":"https://wpdev.uservoice.com/users/98407146","datetime":"2015-08-27","body":"This feature would be very interesting. It would allow me to create a Hiragana/Katakana keyboard! =)"},{"user":"https://wpdev.uservoice.com/users/94657770-roger-siegenthaler","datetime":"2015-08-12","body":"This would be great, it would ease the transition for users from iOS/Android significantly if they didn't have to learn how to use a new keyboard. Also the current standard for winphone8.1 is very sub-standard. For me personally the problem is I would like to make smaller keyboards (less height) to show more content as well as have shorter distances between the keys."},{"user":"https://wpdev.uservoice.com/users/83822353-anonymous","datetime":"2015-06-28","body":"Has there been any developments on this since it was marked as \"ON THE BACKLOG\" over a year ago?"},{"user":"https://wpdev.uservoice.com/users/80573871-balaji-soundrarajan","datetime":"2015-06-10","body":"This would be an amazing addition to WP. Customized keyboards addressing different phone users(work related, SMS senders, etc)"},{"user":"https://wpdev.uservoice.com/users/80249226-chet-murphy","datetime":"2015-06-08","body":"I too need at least one custom keyboard for my app. I can get by during testing but not being able to customize the keyboard will make it more difficult for my customers,"},{"user":"https://wpdev.uservoice.com/users/77866560-javid-yagubali","datetime":"2015-05-24","body":"Still waiting for this feature"},{"user":"https://wpdev.uservoice.com/users/74126490-mick","datetime":"2015-04-30","body":"Now that android and iOS apps can be easily ported to Windows store, it must be availiable to WP develpers as well"},{"user":"https://wpdev.uservoice.com/users/57694876-kagami-sascha-rosylight","datetime":"2015-04-30","body":"I need this feature to customize Korean Hangul keyboard. There are several custom keyboards in Android but not in Windows Phone."},{"user":"https://wpdev.uservoice.com/users/72395526-john-nunn","datetime":"2015-04-19","body":"In my opinion this is the best keyboard for touch. It would ideal if MS incorporated it and its features (i.e. sliding, glossary, macros) into Win10."},{"user":"https://wpdev.uservoice.com/users/72395526-john-nunn","datetime":"2015-04-19","body":"I have been using Android solely because Android allows the creation of custom keyboards; Android supplies a custom keyboard sample in its SDK.  I use the FITALY keyboard in my android phone (Samsung Note 2).  I use the FITALY keyboard in my Win8.1 tablet (Dell Venue 8.1 Pro) in desktop and use the tablet in desktop mode mode exclusively since it runs the actual FITALY keyboard .exe that was created for Windows x86 tablets about a decade ago.  I used FITALY in Windows Mobille before the OS became obsolete."}]}