{"id":"33940351","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/33940351-swipecontrol-should-support-mouse-input","title":"SwipeControl should support mouse input","body":"The SwipeControl control should support mouse input as well as touch input. Currently it only supports touch input.","votes":"28","user":"https://wpdev.uservoice.com/users/776699707-matt-p","datetime":"2018-04-12","comments":[{"user":"https://wpdev.uservoice.com/users/785674432-yulia-klein","datetime":"2019-05-17","body":"I created a new GitHub issue to track this feature request - <a rel=\"nofollow noreferrer\" href=\"https://github.com/microsoft/microsoft-ui-xaml/issues/727\">https://github.com/microsoft/microsoft-ui-xaml/issues/727</a>. Please comment and upvote on GitHub."},{"user":"https://wpdev.uservoice.com/users/785674432-yulia-klein","datetime":"2018-12-11","body":"SwipeControl and other Xaml controls have been open sourced, and the best place to propose changes similar to this one is on our <a rel=\"nofollow noreferrer\" href=\"https://github.com/Microsoft/microsoft-ui-xaml\">https://github.com/Microsoft/microsoft-ui-xaml</a> repo. Can someone create a new feature request using the template on GitHub, <a rel=\"nofollow noreferrer\" href=\"https://github.com/Microsoft/microsoft-ui-xaml/issues/new/choose\">https://github.com/Microsoft/microsoft-ui-xaml/issues/new/choose</a>"},{"user":"https://wpdev.uservoice.com/users/862691110-c-taylor","datetime":"2018-10-25","body":"This is yet another example how the UWP platform enforces its UX on developers. WPF is an amazing platform that has no UX enforcements built into its platform. \n<br>ContentDialog  Flyout limitations are other controls that enforce UX. This is why I always suggest WPF instead of UWP for business application development. "},{"user":"https://wpdev.uservoice.com/users/862691110-c-taylor","datetime":"2018-10-25","body":"I would love to use this control. But I don't want to have to introduce code that has a special case for when my app is running on a non-touch device. This is completely stupid that there is no option to allow the mouse to work with this feature. Instead I will not use this control, which is a shame. "},{"user":"https://wpdev.uservoice.com/users/215233704-ianier-munoz","datetime":"2018-10-07","body":"+1 for this feature. However, swiping with the mouse doesn't feel natural, so I suggest that right-clicking the SwipeControl show a pop-up menu with the list of commands."},{"user":"https://wpdev.uservoice.com/users/823222249-tim","datetime":"2018-07-12","body":"SwipeControl seems kind of broken.\n<br>If you use the trackpad of the Surfacebook and scroll vertically through a list, it just randomly activates Swipe on elemets without interaction. It even happens in the XAML Gallery app. Hope the old SlidableListItem will not be replaced soon."},{"user":"https://wpdev.uservoice.com/users/155049774-pinox","datetime":"2018-04-12","body":"Agree, totally crazy form MS. Consequence is that you also can't test your apps (swipe action) on the desktop anymore (in development). I use the old swipe control from UWPtoolkit but they also want do deprecate this as the new MS swipe control replaces it, but sadly without the desktop swipe functionality."}]}