{"id":"3403895","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/3403895-screenshots-all-resolutions-and-languages-at-onc","title":"Screenshots - all resolutions and languages at once","body":"Now on Windows Phone 8 when we have 3 resolutions taking screenshots may take a lot of time. You have to run one emulator, take screenshots, close it and run another and so on. We can scale wxga to wvga(it still requires some work), because they have the same ratio, but we can't do this with 720p. Emulators are even slower than the WP7.1 ones, so the process is really long.\n<br>Consider also option where you have application in several languages. You have to take screenshots in one language, change it to another, wait until emulator reloads and so on. It takes a lot of time. \n<br>I would like to ask Microsoft to give us a tool(option in emulator) with which we can take screenshots once, in one emulator and it will produce screenshots in all resolutions and all languages supported by our app. It would save us a lot of time.","votes":"15","user":"https://wpdev.uservoice.com/users/19217957-tom","datetime":"2012-11-30","comments":[{"user":"https://wpdev.uservoice.com/users/65391196-bruno-lemos","datetime":"2015-02-24","body":"We always lose a lot of time updating an app because:"},{"user":"https://wpdev.uservoice.com/users/726447649--deleted-user","datetime":"2013-07-08","body":"FYI - I moved this to the Store forum and tweaked the title a bit"},{"user":"https://wpdev.uservoice.com/users/38112777-andreas-t","datetime":"2013-07-05","body":"We recently submitted six in-app products for two of our apps.\n<br>As we support nine languages, we had to upload that product icon for each language. \n<br>You can do the math:\n<br>6 products x 9 languages x 2 apps = 108\n<br>I had to upload the same icon 108 times, so please provide an option to use a product icon for all supported languages.\n<br>Also the interface could be improved, e.g. a list of fields with all languages, because also the switching between different languages takes some time and you need to remember which languages you already entered. In our case we only had to enter the translated name and upload the product icon then wait while the browser switched to the next language and saved the content."},{"user":"https://wpdev.uservoice.com/users/38112777-andreas-t","datetime":"2013-07-04","body":"Same problem here, although the screenshot resolution issue was improved, it is very time consuming taking screenshots for each language."}]}