{"id":"36306085","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/36306085-mediaplayer-does-not-play-on-calling-play-method-w","title":"MediaPlayer does not play on calling Play method when app is minimized","body":"I want to start a sound, even when the app is minimized. The play action can be initiated from an App Service (Desktop Bridge). My app has the background audio capability and uses extended execution. So the app is not suspended and keeps running in the background. But if I start a sound using MediaPlayer when the app is minimized, the sound does not play. As soon as I open the app, the sound starts. Minimizing again will not affect the sound: it keeps playing. ","votes":"2","user":"https://wpdev.uservoice.com/users/189335055-wim-bokkers","datetime":"2018-12-18","comments":[{"user":"https://wpdev.uservoice.com/users/189335055-wim-bokkers","datetime":"2019-04-26","body":"Some more context: I am using a Desktop Bridge app. The win32 companion app is using a SIP phone library dll (P/Invoke) and communicates through an App Service with the UWP part. The UWP app contains the business logic and UI of our soft phone software. When there's an incoming phone call, the win32 app get's notified by the SIP layer and in turn notifies the UWP app using an App Service connection. The soft phone decides if and what kind of ring tone needs to be played. \n<br>Most of the time our apps does all its work in the background (SIP audio and signaling).  This means that playing the ring tone must be done from the background. It is even possible that the UWP app has been auto started and never was in the foreground before.  "},{"user":"https://wpdev.uservoice.com/users/189335055-wim-bokkers","datetime":"2019-04-26","body":"Sorry, I missed your question. Yes, I try to play via MediaPlayer while the app is minimized. The play action is invoked by an App Service from the win32 part."},{"user":"https://wpdev.uservoice.com/users/189335055-wim-bokkers","datetime":"2018-12-19","body":"I also included the extendedExecutionBackgroundAudio capability. This doesn't fix this issue, unfortunately. "}]}