{"id":"3727247","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/3727247-not-allowed-to-sell-my-app-regional-info-payout","title":"Not allowed to sell my app. (Regional info Payout)","body":"According to your registration portal, people form some countries are not allowed to sell apps or use the advertising service for Microsoft.\n<br>Since I’m from Lebanon, I’m not allowed to SELL my apps or to use the advertising service for Microsoft, but THANKS you allowed me to register and pay the $99 fees annually and to help you increase your AppStore apps.\n<br>I have lots of ideas and prefinished apps, but I hold the dev. because I’m from your banned country list.\n<br>This is not fair, I have to pay as any other pay and I have to develop as any other ppl do, but at the end I have to publish my app for free and even not allowed to put advertisement.\n<br>You have to reconsider your rules and to include more countries, I have no idea why Lebanese ppl are not allowed to sell apps, or any other banned country.\n<br>Thanks","votes":"3","user":"https://wpdev.uservoice.com/users/30962763-sameh","datetime":"2013-03-08","comments":[{"user":"https://wpdev.uservoice.com/users/30962763-sameh","datetime":"2013-03-18","body":"Thank you Dave for your feedback, \n<br>Anyway, I can list you thousand of US companies registered In USA and allow trading with my country, Lebanon is not listed in the Trade Embargo countries for USA, and you may check this article : <a rel=\"nofollow noreferrer\" href=\"http://en.wikipedia.org/wiki/United_States_embargoes\">http://en.wikipedia.org/wiki/United_States_embargoes</a>\n<br>Anyway, if there is is gov problem and not the MS problem, it is not fair form MS to take the same fees from all countries, $99 is nothing and it is not the problem.  but it is fair if they take $98 from banned countries! \n<br>As they called us the \"Developing countries\" at least they should allow us to Develop !"},{"user":"https://wpdev.uservoice.com/users/34147738-dave-gordon","datetime":"2013-03-18","body":"This may not be an MS problem - it could be because the USA government has these countries on a trade embargo. As MS is a US company they have to obey the rules. Even their branches that are outside the US must obey the rules of the USA."}]}