{"id":"3759120","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/3759120-remove-the-restricted-file-types-for-file-associat","title":"Remove the restricted file types for file association.","body":"The most important file types are being restricted from being opened by any application aka devs can not register to use .mp3, .txt, .etc. Without this functionality how can we make apps that allow users to do anything useful with their files.","votes":"19","user":"https://wpdev.uservoice.com/users/14836034-ankur-vashi","datetime":"2013-03-18","comments":[{"user":"https://wpdev.uservoice.com/users/164986944-jos%C3%A9-pedretti-neto","datetime":"2016-05-06","body":"I have a UWP app that opens pdf, jpg, png and bmp. On PC, I can right-click an image file and my app is shown in the list, but at Mobile, Windows always open with the native app (except for pdf). I think this behavior kind of breaks the idea that the user must have the same experience, despite of the device the user is using and in my case, the app will have limited experience."},{"user":"https://wpdev.uservoice.com/users/50034825-ssamedi","datetime":"2014-04-21","body":"This is one of the worst limitations of Windows Phone. Microsoft decides by their own what file types are reserved or not."},{"user":"https://wpdev.uservoice.com/users/17489489-oliver-weichhold","datetime":"2013-07-27","body":"Sorry for the rant but THIS is probably the most short-sighted limitation of the platform."},{"user":"https://wpdev.uservoice.com/users/34181360-corey-bonnell","datetime":"2013-03-18","body":"I have an app in the works that allows the user to listen to .wav files that use codecs that the stock media player does not currently support, such as A-law, Mu-law, etc. Such an app would be highly useful for many users who use the phone for business, as many corporate voicemail systems send voicemails as .wav file attachments to the recipient's e-mail address. Often, these messages cannot be played on Windows Phone 8 due to the lack of codec support for compressed formats. As you can imagine, this lack of functionality is a deal-breaker for many users who use their phone for business."}]}