{"id":"38426701","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/38426701-windows-gaming-os","title":"windows gaming os","body":"Hi my name is Alex and I'm not sure if this is the right forum or site to share my idea on but here it goes I have been a pc gamer for six-plus years and have built many customs pcs with enthusiast/gaming-grade hardware and I was wondering if a new windows os could be specially designed for gamers, game server owners big and small and enthusiasts who build custom and high end computers who need better performance, hardware compatibility.  And network security that does not cause games to suffer and affect ping times and latency.  And also new fancy windows look and feel and the os would have support for custom component manufacturers.  Such as Msi, Nvidia, Ati, Evga Gigabyte, Intel,  AMD,  Crucial,  Asus and many others as well.  Giving server owners and non-server os owners tools built-in that provide servers and non-servers with better network performance and security as well as native game support for league of legends, overwatch, Minecraft, apex legends, team fortress 2, counterstrike go, and other games new and old. Including retro games.  Such as Half-Life 1998, Half-Life 2, Unreal Tournament,  Counterstrike 1.6. And many others to reduce ping and latency to their customers and to smoothen gameplay. To my current knowledge, Microsoft is associated with Mineplex and other Minecraft server owners and companies sorry if I'm wrong. My main worry is that the possible new windows os would give its users an advantage over other users who are using another os like win 10 and the soon to hit the dust win7.  My thought is that users who have these os's would have some sort of discount on upgrading or purchasing the new os but also people who play on affiliated servers that have custom computers or prebuilt gaming pc and laptops that have special hardware such as Bigfoot Networks Killer ethernet or wifi adapters that play on servers such as Mineplex or other affiliated servers would get a discount on a new gaming computer or hardware. But for people who are getting a disadvantage in games because of the new os while playing on affiliated servers would also get a discount on a new gaming pc or hardware to compete with the others who have newer hardware or the new os since gaming and esports is such a growing multibillion-dollar industry in culture and society. I believe that a windows os designed for enthusiasts, custom builders, overclockers, server owners and gamers would benefit greatly over a new os that is ready to go when new and existing games or hardware come out to the market.  Even I would be greatly interested in the new os, considering that I have two game servers running in my gaming room that I play on with my friends all the time and four custom-built gaming PCs for LAN-parties.  I would be greatly interested in trying a possible experimental version of the new windows os thanks for hearing my ideas.","votes":"1","user":"https://wpdev.uservoice.com/users/915603991-alex","datetime":"2019-08-21","comments":[]}