{"id":"5045521","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/5045521-api-to-send-sms-via-code-without-user-input","title":"API to send SMS (via code without user input)","body":"Me and two friends of mine created an app that won in a Windows Hackathon held by Microsoft Cyprus. We actually won the Hackathon without finishing our app due to limitations of Windows phone API. We need some sort of API to automatically send an SMS. The reason for it to be automatic is because this is for cases when the owner of the phone is unable (asleep or something similar) to do so. If you are concerned about security reasons a good implementation of this API would be to always notify the user that a message from that application has been sent and where it was sent. Also apps like these must be forced to get access from the user on their first run to send SMS on their own. Their are many ways to keep the security under check and still provide this functionality","votes":"167","user":"https://wpdev.uservoice.com/users/43529832-ioannis-demetriou","datetime":"2013-11-22","comments":[{"user":"https://wpdev.uservoice.com/users/172378341-rolf-van-kuijen","datetime":"2017-05-10","body":"Any automated sending of SMS without confirmation of the user in any way is a security concern that should not be taken lightly which cannot be migitated with asking permission once at startup or even all proposed solutions.\n<br>The most simple reason for the concern is that for SMS are costs involved and need permission of the user, any automation can be seen as period payments and will result in violation in transaction in many countries and other areas making it a lot more than a security issue."},{"user":"https://wpdev.uservoice.com/users/84642349-andrew","datetime":"2015-10-01","body":"Hi John,\n<br>I think this request is asking to be able to send an SMS with using the SMS composer, but rather via line of code without a user prompt. Though being able to send an image via the composer would still be a very useful feature :)\n"},{"user":"https://wpdev.uservoice.com/users/16552162-john-egbert","datetime":"2015-10-01","body":"The important difference needed here is the ability to add an image to a SMS. Right now you can add text and launch the SMS composer with the text, but I would like to be able to launch the SMS composer with an image defaulted. It is still up to the user to edit and hit send. So I don't understand why this would be a security issue?"},{"user":"https://wpdev.uservoice.com/users/16552162-john-egbert","datetime":"2015-10-01","body":"I need to be able to attach and image to a new SMS message from code."},{"user":"https://wpdev.uservoice.com/users/84642349-andrew","datetime":"2015-09-23","body":"So its there, but no one but MS and mobile operators get to use it? Can there please be a way to request?"},{"user":"https://wpdev.uservoice.com/users/105399792-sohail-hirani","datetime":"2015-09-23","body":"Universal SMS API in windows 10 can be used to send and receive SMS. Here is the link for the sample application: <a rel=\"nofollow noreferrer\" href=\"https://github.com/Microsoft/Windows-universal-samples/tree/master/Samples/SmsSendAndReceive\">https://github.com/Microsoft/Windows-universal-samples/tree/master/Samples/SmsSendAndReceive</a> . It requires the restricted capability \"cellularMessaging\" to be included in the application manifest. While verifying the changes check if the device is unlocked: <a rel=\"nofollow noreferrer\" href=\"https://msdn.microsoft.com/library/windows/apps/xaml/dn706236.aspx\">https://msdn.microsoft.com/library/windows/apps/xaml/dn706236.aspx</a>."},{"user":"https://wpdev.uservoice.com/users/92220781-fafu","datetime":"2015-08-03","body":"Did Microsoft has provided the API to send SMS directly? Because in Windows 10 setting and even Windows Phone 8.1 setting I have a page which ask 'manage which have access to SMS' but I still can't find any API to access SMS"},{"user":"https://wpdev.uservoice.com/users/69736702-h4xpace","datetime":"2015-04-01","body":"Microsoft really really needs to enable this, and a lot more around SMS and Cellular development. If the actual phone subsystem is going to be crippled then whats the point of even writing code for Windows \"Phone\" in the first place? Without better system apps all these game developers for Windows are going to be ****** when the whole thing gets shut down because 8 people use it."},{"user":"https://wpdev.uservoice.com/users/65339924-aloaha","datetime":"2015-02-16","body":"Is that the strategy of Microsoft to force developers to Android? It is really a pity."},{"user":"https://wpdev.uservoice.com/users/61368644-franck-nguessan","datetime":"2014-12-09","body":"Hi I would like my application to \"send SMS \" to the user of my app as reminder"},{"user":"https://wpdev.uservoice.com/users/58185760-m-amin","datetime":"2014-10-13","body":"Mobile Banking Apps need this feature."},{"user":"https://wpdev.uservoice.com/users/51917207-brevdd","datetime":"2014-06-03","body":"Really basic feature..."},{"user":"https://wpdev.uservoice.com/users/46512992","datetime":"2014-05-12","body":"I've been wanting and needing this for ages"},{"user":"https://wpdev.uservoice.com/users/45449302","datetime":"2014-01-08","body":"Could you please elaborate on the description posted above."},{"user":"https://wpdev.uservoice.com/users/43974748-giannis-demetriou","datetime":"2013-12-03","body":"There are many ways to tackle security concerns.\n<br>Number 1: User is notified whenever an SMS is sent and which app sent it, and to whom so he knows to uninstall the app if he does not like it\n<br>Number 2: User must give access to the app, whether through the store before installation or on the first run of the app.\n<br>Number 3: Screen apps before publishing them on the store to check what sms will they be sending and to where. If it's for example a future sms app in which the app will send an SMS only to a number the user has defined then allow it"},{"user":"https://wpdev.uservoice.com/users/43529832-ioannis-demetriou","datetime":"2013-11-22","body":"android and iOS already have it"},{"user":"https://wpdev.uservoice.com/users/42817995-peter-andersson","datetime":"2013-11-05","body":"For security reasons this is very bad idea!!!!!"},{"user":"https://wpdev.uservoice.com/users/37312864-tulasi-ram","datetime":"2013-06-16","body":"some applications needs to be send SMS on one click (also user want to do like that only) but here it is just composing and navigates to user and user needs again click send button here consuming more time..and there is a chance for user to be modify read only text. and some OS like andriod they are providing api for sending sms with out user interaction. people who loves Microsoft suffering from these kind of problems"},{"user":"https://wpdev.uservoice.com/users/37312864-tulasi-ram","datetime":"2013-06-15","body":"provide us API to send messages directly without user interacton"},{"user":"https://wpdev.uservoice.com/users/37019203-grygorii-shkliaruk","datetime":"2013-06-06","body":"Please add this API. For protected user form viruses, you can allow use this application installed from market."}]}