{"id":"6090442","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/6090442-api-for-manipulating-the-search-key-inside-apps-to","title":"API for manipulating the Search key inside apps to search for content (app content, settings etc)","body":"Right now, if you single press the Search button inside an app (or anywhere else in the phone), Cortana is launched muted while with a double tap Cortana is launched waiting to here the user speaking. I think that a wise addition would be to create a \"Universal\" search platform that when enabled, a single tap on the Search button will bring up only a search bar and with that, the user would search for content inside the app (and by \"content\" I'm talking specifically for app content).","votes":"92","user":"https://wpdev.uservoice.com/users/52826878-lefteris","datetime":"2014-06-23","comments":[{"user":"https://wpdev.uservoice.com/users/53189739-drew-hoffman","datetime":"2014-07-01","body":"The search button, as it is now, is useless for apps. I don't think we need to regress back to WP7 to make it useful to apps, but a search \"receiver\" (contract?) might help. Say you ask Cortana to search for \"Harry Potter\". In addition to hitting Bing for search results and getting Harry Potter on Amazon, she should be able to search a book lending app on your phone to see that you lent your copy of Harry Potter to Joe Belfiore."},{"user":"https://wpdev.uservoice.com/users/52860660-sinuh%C3%A9-coronel-s","datetime":"2014-06-24","body":"Yeah, no. Even if it's highly voted, I'm pretty sure it won't come out as this has impact in usability. As far as I can tell, all you'll be able to do is attach yourself to Cortana."},{"user":"https://wpdev.uservoice.com/users/52845869-wayne-sebbens","datetime":"2014-06-24","body":"@Lefteris\n<br>Grzegorz is right, WP7 did indeed have this behaviour, but it changed in WP8 because the experience was inconsistent amongst 3rd party apps (only some apps launched a search page in the app when the Search key was pressed. Any that didn't implement it, the default behaviour took over and launched the built-in Bing search app)."},{"user":"https://wpdev.uservoice.com/users/52826878-lefteris","datetime":"2014-06-24","body":"@Grzegorz\n<br>I think that in WP7 by pressing the search button you were just launching Bing Search. I don't think that by pressing it inside Phone, the user could instantly search for contacts, numbers etc. The feature I am proposing works kinda like the Search button on the Windows Charms Bar when in app."},{"user":"https://wpdev.uservoice.com/users/52839419-grzegorz-wid%C5%82a","datetime":"2014-06-24","body":"We've been there. Windows Phone 7 worked this way. I don't think we will see it back."}]}