{"id":"6091990","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/6091990-airdrop-equivalent","title":"AirDrop equivalent","body":"This is more than an API, it's a feature for windows 8 and windows phone 8. \n<br>An equivalent to airdrop so all those users using your platforms could send any file easily. It should work over wifi ad-hoc (wifi direct), Bluetooth Ethernet zigbee or other. \n<br>Just imagine all all those apps on all devices could have a way to communicate with each other. \n<br>You could use this to make the win phone office remote app connect to the laptop without the need of a wifi hotspot.","votes":"126","user":"https://wpdev.uservoice.com/users/52842701-cristian","datetime":"2014-06-24","comments":[{"user":"https://wpdev.uservoice.com/users/279531319-shawn","datetime":"2016-12-22","body":"I'm don't think this is a missing API, but rather an API request.  FYI, I believe you may already today communicate freely via wifi, bluetooth, and NFC, so I don't personally see a reason for this."},{"user":"https://wpdev.uservoice.com/users/52842701-cristian","datetime":"2014-06-26","body":"You could also implement the ability to respond to sms and calls you get on Windows Phone from Windows 8 or Xbox like I posted here: \n<br><a rel=\"nofollow noreferrer\" href=\"http://wpdev.uservoice.com/forums/110705-dev-platform/suggestions/6101653-respond-to-windows-phone-calls-and-sms-from-window\">http://wpdev.uservoice.com/forums/110705-dev-platform/suggestions/6101653-respond-to-windows-phone-calls-and-sms-from-window</a>"},{"user":"https://wpdev.uservoice.com/users/52842701-cristian","datetime":"2014-06-24","body":"And because this has to be about missing APIs, the API would let apps from one device connect with apps from other ( much like proximity for win 8) but with the support for all Microsoft platforms: win phone 8, win 8 and xbox would be great."},{"user":"https://wpdev.uservoice.com/users/52844480-cd","datetime":"2014-06-24","body":"Also ... this could enable us to test from visual studio the windows phone apps remote without a cable connexion.\n<br>And make it a mesh network.\n<br>It would be great if Apple allows it, to make it compatible with the Apple's AirDrop"}]}