{"id":"6093042","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/6093042-interactive-live-tiles","title":"Interactive live tiles","body":"Maybe there is a way to create an API to allow us to make the live tiles really interactive (with buttons and other controls)","votes":"162","user":"https://wpdev.uservoice.com/users/52854181-julian","datetime":"2014-06-24","comments":[{"user":"https://wpdev.uservoice.com/users/338088304-kai","datetime":"2017-02-28","body":"An equivalent to ToastNotificationActionTrigger for SecondaryTiles would be great, so that we could use SecondaryTiles together with a BackgroundTasks."},{"user":"https://wpdev.uservoice.com/users/327702529-marek-%C5%A1uplata","datetime":"2017-02-09","body":"* Basically what we need are only (custom design) buttons "},{"user":"https://wpdev.uservoice.com/users/54077101-lukas","datetime":"2017-02-08","body":"At least support for buttons would be awesome, to trigger Tasks in apps. Control of music or video players is one of the first things that comes to my mind, but I am pretty sure that a lot of apps would make use of it. This could even be done without XAML, just by extending the tile XML format. Buttons would have a Task and a Parameter, plus a font or image icon..."},{"user":"https://wpdev.uservoice.com/users/18392706-anonymous","datetime":"2014-04-28","body":"I hope I can pause or play music on live tiles。"},{"user":"https://wpdev.uservoice.com/users/24851228-jean-claude-perraux","datetime":"2013-11-29","body":"Open the customization of the live tile to have a possibility to control the volume of the phone and other thing. Directly with a slider in a Live Tile.  THIS IS REALY IMPORTANT YOUR OPEN YOUR API TO THE COMMUNITY TO HELP YOU."},{"user":"https://wpdev.uservoice.com/users/25377395-clive-jefferies","datetime":"2012-06-08","body":"Isn't this just an Android widget?"},{"user":"https://wpdev.uservoice.com/users/13725664-matteo-marcian%C3%B2","datetime":"2012-02-08","body":"User defined tile size is insane. How could a programmer bear with that, given a Tile which shows a picture?"},{"user":"https://wpdev.uservoice.com/users/19648912-hugo","datetime":"2012-02-03","body":"this is great, i think it could bennefit a lot of WP7 users. id like a larger tile in some cases as i hate to have my screen un-even or with a gap.  To be able to create your own tile would allow us to personalise our device a lot more. I though of having the freedom to select individual tile colour abd also more available colours or a custom colour slider."},{"user":"https://wpdev.uservoice.com/users/18899246-czaxon","datetime":"2011-12-22","body":"yea.  let us scroll thru the calendar using 2 fingers on the calendar tile."},{"user":"https://wpdev.uservoice.com/users/18901884-graham-r","datetime":"2011-12-22","body":"wow awesome idea! voted "},{"user":"https://wpdev.uservoice.com/users/17310639-riyazhyder","datetime":"2011-10-31","body":"Why couldn't the tiles be interactive, like dismissing a  calendar event right from the tile or switching on wifi in the tile inself instead of going to the wifi control screen.. Or better still would be the power to create my own tile with a slideshow or app updates or app groups (apps executable from the tile itself) the size of the tile shouls also be user definable..  "}]}