{"id":"6127765","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/6127765-datagrid-control-for-winrt","title":"DataGrid Control for WinRT","body":"Some business applications require this type of control!!!\n<br>Windows Store Apps for the line-of-business (LOB) apps need help.","votes":"23","user":"https://wpdev.uservoice.com/users/51533988-daniel","datetime":"2014-07-02","comments":[{"user":"https://wpdev.uservoice.com/users/16781667-jmagaram","datetime":"2017-08-31","body":"I have to add my 2 cents here. Displaying data in a grid with columns and resizable headers is exceptionally useful for a wide range of applications - which is why smart people at Microsoft included it in WPF version 1.0. So yes I believe the UWP platform should include a basic version of this control. If you need automatically sorting, group-by drag drop support, etc. then maybe you need to buy/use a 3rd party control or extend the one in the box. It is inexplicable to me why UWP is so CRIPPLED compared to WPF and in some cases Silverlight - no WrapPanel, DockPanel, TreeView, hierarchical data templates, implicit data templates, data triggers, adorners for drag/drop and error handling support, menu items without arbitrary content, lists with multiple-level grouping, especially when the code for these things has already been written and could presumably be migrated to support touch. It leads me to believe that Microsoft is not really committed to platform and assumes everyone is going to write iPhone or web apps instead - which is what we'll probably do."},{"user":"https://wpdev.uservoice.com/users/169710432-windows-xaml-team","datetime":"2017-02-23","body":"Thanks @Mark for your comment.  Our ISVs (Telerik, Infragistics, DevExpress, Xceed, ActiPro, Syncfusion, etc) have always delivered way more functional DataGrids in every UI platform we've ever created.  Our own information shows that these are used far more than any in-box components because of the capabilities they serve.  I realize that there is a desire for everything to be in a core platform, but when we look at things like this, and especially given the vast ecosystem of free, Open Source and royalty-free licensed) can you help us understand why you would still want a 'simple' platform one?  Having been on the XAML team for quite some time, nothing is simple :-) -- and DataGrid is quite possibly one of the more complex.  Does simple mean display, sort, editable, groupable, virtualized?  Yeah, that's not simple :-) I hope you can appreciate.  This is where we've always loved how the ISV community has delivered far more flexibility for our customer demands.  By the way, this isn't a 'no' but we just want to prioritize the most high-value platform capabilities above commodities."},{"user":"https://wpdev.uservoice.com/users/336267877-mark-wilson","datetime":"2017-02-23","body":"The Telerik DataGrid has a large range of features.  However it is important for developers to have a basic DataGrid that they can extend themselves.  This is what Microsoft has been good at providing in the past, basic controls that developers can build out in the way that their app and user demand.  I understand that the Telerik control can be customised and I have played with it, but for much of our usage it restricts us."},{"user":"https://wpdev.uservoice.com/users/53577093-jack-bond","datetime":"2017-02-08","body":"Silverlight had it.\n<br>WPF has it.\n<br>WP Dev Experience Team suggests buying it."},{"user":"https://wpdev.uservoice.com/users/158611122-thomas-claudius-huber","datetime":"2016-09-15","body":"If you want UWP as a serious platform for LOB-apps, it should contain a DataGrid. This allows devs to build LOB-apps with UWP. 3rd party solutions should come into the game if the DataGrid requires filtering via headers, master-detail-records etc."},{"user":"https://wpdev.uservoice.com/users/119531922-mike-sage","datetime":"2016-05-24","body":"For me, I would like to try re-creating the app that I work on as a Windows 10 UWP app, probably in C++.  In our current high data volume app written in .Net and C#, we notice when a full garbage collection takes place and suspends every thread.  One of the main things I need for this is a good data grid, but for this kind of try it out and convince my superiors this is the way to go, having to purchase a 3rd party solution adds to the uphill battle that I face."}]}