{"id":"6146901","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/6146901-fix-name-reservation","title":"fix name reservation","body":"I have a wp8.0 game and decided to update it to wp8.1.\n<br>Technically everything went smoothly but when I tried to submit the update it required that I reserved a name.\n<br>I thought \"fine, I'll just reserve the existing name because I've build a fan base around it\". Then all hell broke loose: The name had been reserved by someone else!!\n<br>I went to the wp store and searched for the name and it only showed my app, no other app. Went to the windows store, same thing. Someone had reserved the name of a game that has been in the store for months with seemingly no intention of releasing an app!\n<br>I had chat with Microsoft support, twice, to no avail. You are only covered if you have a copyright for that name. Most small developers do not.\n<br>So how can this issue be avoided?\n<br>Several suggestions:\n<br>- First and foremost (this should had already been implemented):  Automatic reservation for existing apps when there is only one app with that name.\n<br>- Reduce the reservation period from 1 year to 3 months.\n<br>- Do not allow the same publisher from reserving the same name more than once per year.","votes":"2","user":"https://wpdev.uservoice.com/users/53441296-imperial-dynamics","datetime":"2014-07-08","comments":[{"user":"https://wpdev.uservoice.com/users/101982234-rick-keeney","datetime":"2015-09-10","body":"Same complaint.  When that change was made, the fair way to do it would have been to grant the name to the first user of the name in the store.  Because if the policy had already been in place, they would have had that name exclusively to begin with.  Instead the process was one of randomization based on who was the first to notice the announcements and take action.  A free for all that is undoubtedly going to make many developers of apps for the Windows store unhappy.  What a bad plan.   "}]}