{"id":"6156677","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/6156677-throttle-emulator-to-hardware-specs-of-phone-cpu","title":"Throttle emulator to hardware specs of phone CPU + GPU","body":"Create an option to simulate hardware specs like CPU+GPU.\n<br>Dual-core, quad-core, 1.2GHz, 1.5GHz, 2.2GHz, ...\n<br>The emulator is very very fast when I'm using it on my i7 4770. It would be good if we can at least optionally reduce the speed of the emulator to better reproduce real world devices.","votes":"357","user":"https://wpdev.uservoice.com/users/53542471","datetime":"2014-07-10","comments":[{"user":"https://wpdev.uservoice.com/users/99264381-mcfly","datetime":"2015-08-31","body":"I prefer having a choice to select full speed or emulate low devices.\n<br>Best of both worlds"},{"user":"https://wpdev.uservoice.com/users/12932642-morten-nielsen","datetime":"2015-08-28","body":"Perhaps stating the obvious here, but you should always test performance and render critical things on real hardware. No emulation of the speed will be true to running on real hardware. To be honest I prefer having a fast emulator to speed dev time."},{"user":"https://wpdev.uservoice.com/users/70667554","datetime":"2015-04-07","body":"La respuesta no esta en  que si un celular tenga  o no  4 ó 5 procesadores  o hasta 10 nucleos, esa no es la respuesta para un celular eficiente. \n<br>Con 512 en ram  y un procesador es suficiente,  lo que tiene que hacer Microsoft  es  investigación científica de la calidad de los materiales.\n<br>Usar código fuente  eficiente y mejora el sistema operativo de WP.\n<br>Tienen que entrar a la carrera contra  APPLE  Y  EL IPHONE......\n<br>Por el momento WP  en america latina y  en los países del 3er mundo se le considera un producto americano malisimo, peor que un producto chino de los años 80tas  es casi equivalente a las licuadoras chinas que cuando se ponian a funcionar las aspas salian volando y se insertaban en el techo con el filo.\n"},{"user":"https://wpdev.uservoice.com/users/24636434","datetime":"2014-09-11","body":"Yes, number of cores should be easy to implement in emulator, because its a virtual machine."}]}