{"id":"6458288","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/6458288-support-to-new-applications-new-rising-list","title":"Support To New Applications (New & Rising list)","body":"Platform should support new applications that are not big companies'. In these days all new applications don't appear in New+Rising category, and some new applications are dying. We have communicate with Microsoft Support about this situation and they said \"We don't promise \"New applications always enter New+Rising category\" to developers. It is so embarrassing for small companies or freelance developers. You should support new applications, you should support us.","votes":"65","user":"https://wpdev.uservoice.com/users/56987897-tu%C4%9Frul-emre-atalay","datetime":"2014-09-18","comments":[{"user":"https://wpdev.uservoice.com/users/177677829-gigac","datetime":"2016-06-17","body":"So huge problem!!!!!!!!!!!!!"},{"user":"https://wpdev.uservoice.com/users/145978434","datetime":"2016-02-16","body":"The new and rising category is a joke! Most new apps and games are never seen. I've asked several times how the apps are selected on these lists only to get a ??????// answer from Microsoft. Why not just have a new apps or games list? The rising part of the equation is unnecessary and apparently to difficult for Microsoft to quantify."},{"user":"https://wpdev.uservoice.com/users/124884948-claus","datetime":"2015-11-29","body":"The issue is not only with the New And Rising list. It's also keyword search in general. Many apps cannot be discovered by their keywords or texts in the descriptions, meaning they cannot be discovered in any way, other than the app name or a direct link."},{"user":"https://wpdev.uservoice.com/users/125531169-cole-sorensen","datetime":"2015-11-25","body":"Also in regards to the ADMIN's comment a simple solution would be keep the (new + rising) but also have a list for just New. I realize that a ton of apps become available each day but why not let the customer decide how they want to discover new apps and games? It's an easy and obvious solution.\n"},{"user":"https://wpdev.uservoice.com/users/125531169-cole-sorensen","datetime":"2015-11-25","body":"I am a huge supporter of Microsoft but after experiencing issues with the new and rising category as a small developer I don't know why I would continue to do so. My game is in the puzzle and trivia section and for the last 4 days the app at the top of that list has now reviews while mine has 8 reviews all 5 star. The only way I was able to get my app out there was to give away free download codes on reddit. While I don't expect to be at the top of the list by any means I would like to at least be included somewhere on the 20+ pages. All the forums I read about this issue seam to state that the algorithm that determines the result is a mystery even to Microsoft. No wonder no one wants to use Bing as I hear it uses a similar algorithm. I think if someone from Microsoft took 2 seconds to look at the results the store is putting in the search they would recognize almost immediately that there is a problem. I understand that the algorithm needs to be kept some what of a secret in the interest of fairness but I mean come on maybe a little common since is warranted in this situation. But I guess the 2% market share Microsoft has in the mobile phone area is good enough for them and they see no reason to improve or assist those of us who have been so loyal despite all back turning Microsoft has done over the years to its indie developers. That's my 2 cents anyone else as frustrated as I?"},{"user":"https://wpdev.uservoice.com/users/123077505-anonymous","datetime":"2015-11-17","body":"me too"},{"user":"https://wpdev.uservoice.com/users/60342789","datetime":"2015-09-19","body":"Yes, 2 of our apps have been completely dropped from being searchable on the store, even though one of them has 45,000 reviews with a 4.6 rating.  It's been a support nightmare telling our users where to find a link to download the app.  It's ridiculous that any developer would think this algorithm is a good idea for a mobile store."},{"user":"https://wpdev.uservoice.com/users/74743491-jeff-paries","datetime":"2015-05-04","body":"I just had an app that I purchased Unity assets for and spent several hundred hours developing pretty much killed by not ever showing in the \"new &amp; rising\" bucket, essentially making it undiscoverable other than keyword searches. When I inquired when it would show I was told that the only guarantee is that it will go into the store. Every app should push through \"new &amp; rising.\" Help customers connect with applications. "},{"user":"https://wpdev.uservoice.com/users/57156957-koray-arar","datetime":"2014-09-22","body":"<a rel=\"nofollow noreferrer\" href=\"http://www.windowsphone.com/en-us/store/app/paint-trek/d2901849-69e0-43d9-b57a-b73ca4e3e0a6\">http://www.windowsphone.com/en-us/store/app/paint-trek/d2901849-69e0-43d9-b57a-b73ca4e3e0a6</a> I really need support too,here is my indie game"},{"user":"https://wpdev.uservoice.com/users/17073751-masaki-katata","datetime":"2014-09-20","body":"Really."},{"user":"https://wpdev.uservoice.com/users/55610554-nick-watros","datetime":"2014-08-23","body":"I seem to be experiencing a bug with how my app is placed on New+Rising section. I submitted the first live build of my app to the store on 08/20/2014. The next day I attempted to find my app on in Games&gt;New+Rising, but after searching through several pages I narrowed it down to Role Playing games. When I did find my app, it was at the bottom of the ninth page."},{"user":"https://wpdev.uservoice.com/users/54668154-dr-hu","datetime":"2014-08-04","body":"Our app iradio plus rank 50 on New+Rising of music last week. But after an update of the app, it is not even listed on the same category.\n<br>I think there is some bug on the algorithm since it happens on other apps also. Does aanyone has the same issue?"},{"user":"https://wpdev.uservoice.com/users/53919079","datetime":"2014-07-18","body":"Hello ,\n<br>I have just experienced and investigated that paid apps don't appear on windows phone store in new+rising category , when accessed through windows phone devices.  However, it do appears on windowsphone.com . \n<br>Fellow developers might also experiencing the issues as my friends are experiencing this issue too. \n<br>This issue need to be resolved immediately as it is effecting our app badly in store."}]}