{"id":"6560596","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/6560596-fight-spam-fraud-apps-more-aggresively","title":"Fight spam/fraud apps more aggresively","body":"There are several developers using dishonest methods to boost their apps, including fake ratings. Those apps are as good as useless to consumers (cheap website wrappers etc.) and still have dozens of maximum ratings shortly after being released. Those apps get ranked high in the listings and take away the place of the few others that actually are good.","votes":"337","user":"https://wpdev.uservoice.com/users/58221475-bill-hill","datetime":"2014-10-14","comments":[{"user":"https://wpdev.uservoice.com/users/121266588","datetime":"2015-11-11","body":"There are some devs that are making multiple Windows Store accounts to spam the same repackaged apps.  This is unfair to devs and cheapens the Windows Store experience.  For instance the following dev accounts have the same apps spammed under multiple accounts:"},{"user":"https://wpdev.uservoice.com/users/99663759-payshieh","datetime":"2015-09-01","body":"I agree. There are also many apps that are repetitive. App quality is more solid than app quantity. Having set a solid foundation in the app store is what will actually keep users engaged. I believe users would want to see more practical use of a good app compared to seeing numerous non-beneficial apps. I hope to one day see Microsoft offer more commercial apps working with grocery stores, coffee shops, pharmacy, retail stores, etc. "},{"user":"https://wpdev.uservoice.com/users/20628507-d-clark","datetime":"2012-02-10","body":"I was going to suggest giving each user their own personal \"ban list\" to blacklist publishers they don't personally want to see anymore, but that's probably something only a few of the more savvy phone users would actually discover and use. I think I have to agree with the OP that a more rigorous screening during the certification process to prevent these apps getting published in the first place is the only thing that will really work."},{"user":"https://wpdev.uservoice.com/users/20628507-d-clark","datetime":"2012-02-10","body":"I hate working for months to make a quality app that actually does something only to see it pushed down the New list by bulk-published do-nothing app clones."},{"user":"https://wpdev.uservoice.com/users/14698668-aschettler","datetime":"2011-07-30","body":"The amount of spam applications, apps that are split out into several regions (i.e.: MyTranspo series), the ridiculous feed readers for all different musicians and whatnot, single book applications, and do-nothing apps (i.e.: the stuff published by \"Eric_rulz\")... This is just absolutely ridiculous. You already promised to take care of this, but it didn't work. We've still useless applications flooding the Marketplace, and there are no signs of it slowing. I believe that, instead of limiting the amount of certifications per user per day, the Marketplace should be a little better curated. Spam applications should not be approved. They should never pass certification, and should never be published. Bulk publishers should be made to consolidate their apps, and the rest should not pass."}]}