{"id":"7168298","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/7168298-provide-fix-for-c101a7d1-when-updating-80004005-w","title":"Provide fix for c101a7d1 when updating, 80004005 when installing, license reset on reinstall","body":"Microsoft Support recommended me to post the issue here. There seems to be a long-standing serious issue with the Store (or possibly the dev portal) which needs to be addressed urgently. There's a history of apps affected by this issue and possibly more apps to be affected in the future if the issue goes unfixed.","votes":"310","user":"https://wpdev.uservoice.com/users/66243300-jason-ong","datetime":"2015-03-04","comments":[{"user":"https://wpdev.uservoice.com/users/167992434-manni","datetime":"2016-05-18","body":"Since 2 Years I used \"Run.GPS\", and now appeared this \"c101a7d1\" -Code. First attempts led to running in circles. Then deleted the APP, to Reinstall it, and now I have nothing. \n<br>Once upon a time... Content Customers had priority. \n<br>And now M.S. in Germany is only the short form for Micro.Schrott."},{"user":"https://wpdev.uservoice.com/users/151381074-fiorenzo-formichi","datetime":"2016-03-13","body":"I had the \"ultimate converter\" app but since it is no longer free I am not able to get updates. I also changed mobile so I'am not able to get the app even if I would pay for it because Windows doesn't permit the download"},{"user":"https://wpdev.uservoice.com/users/133825629","datetime":"2015-12-30","body":"So, what has happened till today?  Has microsoft solved this issue yet?  I believe it's almost 1 year already and still not solve yet... Why?"},{"user":"https://wpdev.uservoice.com/users/99526053","datetime":"2015-09-01","body":"I love it"},{"user":"https://wpdev.uservoice.com/users/67197968-mike-eee","datetime":"2015-07-19","body":"... when a bug makes it on a feature request forum. :/"},{"user":"https://wpdev.uservoice.com/users/87810325-ilya","datetime":"2015-07-15","body":"Oh, i have this problem (("},{"user":"https://wpdev.uservoice.com/users/83910442-faxe-system","datetime":"2015-06-29","body":"Same problem here with EmiPSX.. Very annoying bug that needs to be fixed!"},{"user":"https://wpdev.uservoice.com/users/17357884-anonymous","datetime":"2015-06-04","body":"I am in contact with a support member from MS and yes: This problem cannot and will not be solved for WP 8.x.\n<br>This makes me quite angry since after all MS takes 30% of app revenue for providing the store infrastructure. Now this store has a major bug but it does not get fixed.\n<br>This also means: My app will continue to get bad ratings because of a store problem that has nothing to do with the app itself and I will have to continue answering emails from angry users that are complaining to me that they cannot update the app. :(\n<br>So that’s how the world’s largest tech company handles problems.\n"},{"user":"https://wpdev.uservoice.com/users/54394691-dino-borogovac","datetime":"2015-05-31","body":"Hi there, i have found out something useful regarding this case. On my purchase history at commerce.microsoft.com i see apps that have 0$ value so Microsoft bills them now! This is the right way to do because this error above happend to be caused by not billing apps that where downloaded for free then got paid. Where the Store searched for the billing entry and didnt find it (of course!). Now we have billed items on the purchase history like it hsould be from day 1! paid items and free items are there and i think this issue will be resolved with Windows 10 Mobile because i see free apps there but just apps that i have downloaded with my Windows 10 Mobile device."},{"user":"https://wpdev.uservoice.com/users/17357884-anonymous","datetime":"2015-05-20","body":"I am the developer of \"Week View\" and today I got an email according to this problem from MS Support: \n<br>Thank you for your patience throughout this process.  I wanted to let you know that we have completed our investigation.  In order for users to be able to update or re-install the app they will need to back up their phone and reset to factory defaults.  Users should contact consumer support, if they need assistance backing up their data and then resetting their phones, as this is not a developer issue.  Some data may be lost even if the phone is backed up so users should take this into consideration before resetting their phones.  Please let me know if you have any questions over this."},{"user":"https://wpdev.uservoice.com/users/54394691-dino-borogovac","datetime":"2015-05-17","body":"This issue is still not fixed even if it was promissed to be within one week, this was 3 months ago. Im losing my patience and i will not support Windows Phone as developer further till this is fixed. I dont want to explain t oa lot of users why they have issues with the store, this is not my task here. My task is to make great apps, publish them - Microsofts task is to maintain the store and its funcionality."},{"user":"https://wpdev.uservoice.com/users/74693703","datetime":"2015-05-04","body":"You are causing a lot of grief tor your customers with this stupid error where licenses get\n<br>reset. Put someone competent on it to fix this and stop pointing fingers at the developers.\n<br>They cannot alleviate this problem because it is not their problem - it's your problem. I wonder what Satya Nadella would say if he were aware of this long long ongoing Problem \n<br>with the store that never gets fixed.  MAALOO Outdoor in my case. Store Error - 80004005"},{"user":"https://wpdev.uservoice.com/users/70728955","datetime":"2015-04-27","body":"still no change for me..."},{"user":"https://wpdev.uservoice.com/users/66623951-hannes-biribauer","datetime":"2015-04-15","body":"MS finally admitted that it is not a problem caused by the developers but by the store. MS support told that they are working on a fix of this issue. Please let them know, if the problem still exists: <a rel=\"nofollow noreferrer\" href=\"https://social.msdn.microsoft.com/Forums/windowsapps/en-US/3e439a36-5843-450b-9997-9b9642a1ef10/redownloading-apps-and-licensing?forum=wpsubmit\">https://social.msdn.microsoft.com/Forums/windowsapps/en-US/3e439a36-5843-450b-9997-9b9642a1ef10/redownloading-apps-and-licensing?forum=wpsubmit</a>"},{"user":"https://wpdev.uservoice.com/users/71796135-%D0%B0%D0%BB%D0%B5%D0%BA%D1%81%D0%B5%D0%B9-%D1%80%D0%BE%D0%BB%D0%B5%D0%BD%D0%BA%D0%BE","datetime":"2015-04-15","body":"The same trouble with Media Downloader. MS is losing ground!"},{"user":"https://wpdev.uservoice.com/users/53518592-efthymios-kalyviotis","datetime":"2015-04-13","body":"Wow!!!\n<br>Microsoft is becoming really insulting! Their partners are loosing hundreds of euros (or USDs, etc.) because of this issue and they are trying to make it up to them by offering them store credits or music subscription or Live subscription."},{"user":"https://wpdev.uservoice.com/users/70728955","datetime":"2015-04-08","body":"same problem here w/ week view - since feb. 20th!!!"},{"user":"https://wpdev.uservoice.com/users/70633648-rasoul-jourmand","datetime":"2015-04-07","body":"I have the same Problems with RuntasticPro and Phototag and the suggested solution also don't work for me"},{"user":"https://wpdev.uservoice.com/users/70618840-arman-keyvannia","datetime":"2015-04-07","body":" I had installed PocketFileManager when it was free but to reinstall it againe I get this error 80004005 constantly. tanx"},{"user":"https://wpdev.uservoice.com/users/70522786","datetime":"2015-04-07","body":"c101a7d1 error with \"il convertitore\" italian."}]}