{"id":"7874598","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/7874598-api-access-for-quick-access-area-in-file-explorer","title":"API Access for Quick Access Area in file explorer","body":"On Pre Windows 10 (tested XP-8.1) i was able to create a link in the favourite section of the file explorer (done with WshShellClass). With the quick access bar in windows 10 it's not working anymore since quick access is something new (like it so far).","votes":"165","user":"https://wpdev.uservoice.com/users/75400926-sebastian-kr%C3%BCmling","datetime":"2015-05-08","comments":[{"user":"https://wpdev.uservoice.com/users/718107044-hicsy","datetime":"2017-11-30","body":"Hi @Clint Rutkas - A good example would be to \"Pin\" an important folder for all staff. In our example we would like to run a powershell script to pin the Scanner folder for all staff, so they don't have to dig through 3 levels in \"MyDocuments\" to find it.\n<br> Most current work-arounds invoke \"pintohome\" as the user, but it would be much less-complicated it we could apply it as another user via ps-remoting"},{"user":"https://wpdev.uservoice.com/users/690770299-vernon-birdy","datetime":"2017-10-18","body":"\nWorking solution to add remove here !"},{"user":"https://wpdev.uservoice.com/users/675940168-y-cho","datetime":"2017-09-27","body":"We are still hopping for a solution to that problem, any news on your \"investigations\" ?"},{"user":"https://wpdev.uservoice.com/users/221104617-kenneth-lefebvre","datetime":"2017-06-29","body":"Clint, you've been investigating this for a year, now. Have you learned anything? Have you made any decisions? What are the obstacles you're facing to providing a solution?"},{"user":"https://wpdev.uservoice.com/users/379796989-sean-hasling","datetime":"2017-05-22","body":"I would like to be able to access it through an API accessible to powershell. An issue that I have is that I have pinned several network locations to the quick access, yet currently these locations are not accessible to me. Because of this, my Windows explorer now has to check all of the quick access as still being reachable, which takes about 10 minutes. It then times out and says the network sites can't be reached. So, I figured I would just remove them for now prior to figuring out the issue. No can do, my friend. It makes me wait for that time out and then nothing pops up. I know this thread is old but it is still a valid point. I need to be able to remove something, at least temporarily, so that I can continue to work. I access other shares on the network, and this completely locks up Windows Explorer."},{"user":"https://wpdev.uservoice.com/users/363078646-juan-miguel","datetime":"2017-04-25","body":"Same as others. Using Favorites in Windows 7 in enterprise environment to add shortcuts to the shared folders the user has access to.\n<br>Missing this functionality on Win 10"},{"user":"https://wpdev.uservoice.com/users/347367481","datetime":"2017-03-23","body":"Saving files to SharePoint. Currently, to save an open file to SharePoint Online you have to go to file &gt; save as &gt; and paste the url of the SharePoint site's document library in the top bar. Once there you can pin the SharePoint site's document library to Quick Access so files can be saved there easily by users in the future. Having to deploy this solution manually to 300+ users has been nightmare, would have loved to write a script to pin \"<a rel=\"nofollow noreferrer\" href=\"https://contoso.sharepoint.com/documents&amp;quot\">https://contoso.sharepoint.com/documents&amp;quot</a>; to everyone's Quick Access."},{"user":"https://wpdev.uservoice.com/users/342110338-mark-white","datetime":"2017-03-09","body":"We simply need to add something here (from c#) the way Favorites used to work!"},{"user":"https://wpdev.uservoice.com/users/330442582-rob-millerd","datetime":"2017-02-12","body":"I just moved files shares from one server to a new server with a different name and have users with links pointing at the old file server in the quick access list in Win 10.  I'm writing a powershell logon script to update the MRU list for Office and was about to add a function to update the Quick Access list, when i found this.  It would be really handy for an domain admin to be able to update a users items in Explorer's Quick Access list.  Will be using DFS for the updated UNC path so I don't have to worry about this next time."},{"user":"https://wpdev.uservoice.com/users/319609195-ludvig-f-aarstad","datetime":"2017-02-02","body":"The ability to programmatically add items to quick access is a much needed feature for any big company. Our users are used to accessing their sharepoint-sites from the windows 7 favourites in the top-left area of windows explorer. In windows 10, the favourites part has been replaced by this Quick Access thing, and users can manually pin things to quick access, but for us it is important that we can pin things to quick access programmatically..."},{"user":"https://wpdev.uservoice.com/users/285629948-computermensch","datetime":"2016-11-20","body":"But for inspiration take a look of some of my legacy posts on Windows 8 quality testing ... Finder vs Explorer. I did the Finder vs Explorer, Apple UI friendliness vs MS UI friendliness stuff and pushed that. Guess it did an impression."},{"user":"https://wpdev.uservoice.com/users/285629948-computermensch","datetime":"2016-11-20","body":"So another thing here, would be a new way or compatible way, to easily provision something like shell namespace ... but across the cloud as well (however this are just locally observable views). But while at it - folder views."},{"user":"https://wpdev.uservoice.com/users/285629948-computermensch","datetime":"2016-11-20","body":"Hi"},{"user":"https://wpdev.uservoice.com/users/271954792-roger-h","datetime":"2016-10-27","body":"How about for the administrators out there, where we want to do imaged installs, with appropriate shortcuts."},{"user":"https://wpdev.uservoice.com/users/264946423-tom-spettigue","datetime":"2016-10-17","body":"Yeah, I gotta say, I'm amazed that this isn't a thing already."},{"user":"https://wpdev.uservoice.com/users/236183149-david-patow","datetime":"2016-09-09","body":"My scenario is that my program establishes a turnkey development workspace for a developer (we have 400), laying down all the tools and source code on their machine.  Our product is huge (300,000 files) and complex.  It's normal for a developer to have 5+ workspaces, each for a product release.  As release branches occur, workspaces are added."},{"user":"https://wpdev.uservoice.com/users/124226043-chris-johnson","datetime":"2016-08-24","body":"@Clint, The particular application that I would like to use this feature in allows a user to save files to their choice of destination. This is done through the SaveFile dialog in .NET (WinForms). The application currently enumerates through the drives on the user's machine, as well as providing shortcuts to their Desktop and Documents virtual folders, since these can currently be accessed through Environment.GetFolderPath(Environment.SpecialFolder). We would also like to be able to offer them the option of choosing the \"Quick access\" targets (i.e. foreach (var target in Environment.QuickAccessFolders)...). We woudn't need to be able to modify the targets, we would only like to enumerate them and get their basic properties (i.e. Name and Path) so that we can save files to those locations when the user selects them."},{"user":"https://wpdev.uservoice.com/users/225924718-praveen-kumar","datetime":"2016-08-23","body":"There is a virtual folder we would like to be part of the quick access automatically, the moment a windows users installs the client and completes the configuration steps, the virtual folder should be seen in the Quick Access section."},{"user":"https://wpdev.uservoice.com/users/68344437-clint-rutkas-msft","datetime":"2016-07-19","body":"@saa, i personally would suggest filing a new UserVoice request for that.  Related but different"},{"user":"https://wpdev.uservoice.com/users/194541282-milen","datetime":"2016-07-19","body":"I mean \"File Explorer\" -&gt; \"Quick access\" -&gt; \"Recent Files\" "}]}