{"id":"8304513","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/8304513-dev-center-store-description-translation","title":"Dev Center Store description translation","body":"I think the new dev center is a great step. What I would like to see is a button on the language description pages that are supported for an app. That would take your default language description and fields and then use Microsoft's Translator to translate all the fields to the language.\n<br>I spend a few hours at least each time I update the app using online translators and copying and pasting between all of the fields and a online translator. I understand that having a translation is important but I am not a linguist (I honestly think I learned programming before proper grammar), I am a individual person making apps on my own and spending almost a whole day just to post the app descriptions is a big pain. (maybe have a button next to each field where it would take the text from the primary description page. and put it onto the description field for Japanese for example) For my app I have it in about 36 language/Country descriptions which is a big task to handle. The user could then review the translations, as best as they could. And if Microsoft couldn't translate it, it could just copy over the original text.","votes":"4","user":"https://wpdev.uservoice.com/users/56279515-kyle-weir","datetime":"2015-06-09","comments":[{"user":"https://wpdev.uservoice.com/users/69659827-cameron","datetime":"2015-04-01","body":"The Multilingual App Toolkit created by Microsoft does exactly this.  Check out the demo video for Windows Phone @ <a rel=\"nofollow noreferrer\" href=\"http://aka.ms/matphone\">http://aka.ms/matphone</a>.  The video shows v3.1, but I would recommend using v4.0 Technical Preview as it have added benefits over the v3x approach as well as UAP support.  Here are the links: v4.0 TP <a rel=\"nofollow noreferrer\" href=\"http://aka.mat/matinstallv4\">http://aka.mat/matinstallv4</a> or v3.1 <a rel=\"nofollow noreferrer\" href=\"http://aka.ms/matinstall\">http://aka.ms/matinstall</a>"},{"user":"https://wpdev.uservoice.com/users/56677984-sam-baldwin","datetime":"2014-09-13","body":"it can be applyed to both windows store and wp store. the key is \"translate\".\n<br>     many nice apps are realeased in various market while those apps are not as popular or get used by people in the areas speaking a different language from the developer. MS can offer help to translate the app. it's beneficial and useful due to the following reasons:\n<br>1. the problem offen happens in indivisual developers, who offen doesn't want to bother to translate.a little help is vey pleasing.\n<br>2.the translation is an easy job.maybe it can be done by some plug-in components in VS.\n<br>3.not translate all the apps, just those with good remarks. and don't need translate it to all kind languages, just important markets.\n<br>4.by doing this easy job, people can get in touch with more high quality apps , in other words, the high-quality apps gets more and the app gaps with ios or andriod seems less."},{"user":"https://wpdev.uservoice.com/users/48478764-cameron","datetime":"2014-03-16","body":"Have you looked at the Multilingual App Toolkit?  <a rel=\"nofollow noreferrer\" href=\"http://msdn.microsoft.com/en-us/windows/apps/bg127574\">http://msdn.microsoft.com/en-us/windows/apps/bg127574</a>"},{"user":"https://wpdev.uservoice.com/users/726447649--deleted-user","datetime":"2013-10-02","body":"Google is creating a service where the developers of Android apps can purchase translations for their apps (see, for example, <a rel=\"nofollow noreferrer\" href=\"https://support.google.com/googleplay/android-developer/answer/3125566?hl=en\">https://support.google.com/googleplay/android-developer/answer/3125566?hl=en</a>, the last section, or <a rel=\"nofollow noreferrer\" href=\"http://developer.android.com/distribute/googleplay/publish/localizing.html#gp-trans)\">http://developer.android.com/distribute/googleplay/publish/localizing.html#gp-trans)</a>. It would be great if a similar service were created for Windows Phone, only more accessible for translation service providers, including freelancers (though, before being able to communicate with the developers, translation service providers might have to pass a test for Microsoft to ensure the quality of their translations). "}]}