{"id":"8482078","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/8482078-maskedtextbox-control","title":"MaskedTextBox Control","body":"The TextBox control is the most used control in a Windows program. It also cause a lot of problem either from QA or the user because of invalid data that was entered. Using a masked control will save a lot of time for the developer and reduce the complaints and bugs","votes":"220","user":"https://wpdev.uservoice.com/users/82209490-frank-mur","datetime":"2015-06-19","comments":[{"user":"https://wpdev.uservoice.com/users/57741400-deltakosh","datetime":"2017-01-31","body":"Hello, in the meantime you can find this one in the UWP Community Toolkit: <a rel=\"nofollow noreferrer\" href=\"http://docs.uwpcommunitytoolkit.com/en/dev/controls/TextBoxMask/\">http://docs.uwpcommunitytoolkit.com/en/dev/controls/TextBoxMask/</a> and <a rel=\"nofollow noreferrer\" href=\"http://docs.uwpcommunitytoolkit.com/en/dev/controls/TextBoxRegex/\">http://docs.uwpcommunitytoolkit.com/en/dev/controls/TextBoxRegex/</a>"},{"user":"https://wpdev.uservoice.com/users/162734280-kiran","datetime":"2016-04-26","body":"d* + for this idea. now a days I am also searching for the same. there are couple of third party controls but nothing from ms!"},{"user":"https://wpdev.uservoice.com/users/27214787-nathan-sokalski","datetime":"2015-07-22","body":"I agree. I have had many situations in which I have had to manually detect what keys were pressed or continuously view and/or edit a TextBox's text. I don't think it is unusual for a TextBox to want to limit what characters are valid, and having an easy built-in way to do this would be very helpful. Sure, we would have a list of predefined options (similar to InputScope), but one of those options should be Custom, in which we specify what characters are valid (maybe as a character array?). We could also be given the choice between preventing or not preventing the character from being entered, but we could also have something like an InvalidTextEntered event so that we can easily display a message informing the user so that they do not get confused as to why their input is not being displayed. But regardless of what the new control looks like, I think it is a necessary one."},{"user":"https://wpdev.uservoice.com/users/82272841-michael-d","datetime":"2015-06-19","body":"It's a must have! +3 for this!!!"}]}