{"id":"9295188","link":"https://wpdev.uservoice.com/forums/110705-universal-windows-platform/suggestions/9295188-allow-windows-runtime-public-class-inheritance","title":"Allow Windows Runtime public class inheritance","body":"Windows Runtime is a great platform, but it lacks some really basic things.","votes":"34","user":"https://wpdev.uservoice.com/users/49772332-alex-ovchin","datetime":"2015-08-12","comments":[{"user":"https://wpdev.uservoice.com/users/211182684-gavin-williams","datetime":"2018-11-24","body":"Don't hold WRC back on account of JS, I recently looked at WRC as a solution for my game engine and the restrictions over normal C# make it just too difficult to even bother with. Tens of thousands of changes were needed in my C# engine to make it work, god only knows what such an API would look like, and if it would actually be useable or understandable. I just couldn't be bothered with such an experiment. WinRT Components need to be as close to natural C# (and C++) as possible, otherwise I don't see many people bothering with it."},{"user":"https://wpdev.uservoice.com/users/351033478","datetime":"2018-10-27","body":"No inheritance?  I'm sure lots of C#/C++ developers are lining up to make Windows Runtime components with this limitation in place..."},{"user":"https://wpdev.uservoice.com/users/297085771-michael","datetime":"2017-08-19","body":"I feel like if the WinRT could use TypeScript as an intermediary to JavaScript, then this could solve the inheritance and generic issues that are currently blocked."},{"user":"https://wpdev.uservoice.com/users/54077101-lukas","datetime":"2017-02-08","body":"It is very annoying that public inheritance is not supported. I often create native WinRT components, and the workarounds required due to this limitation makes the code very ugly. Since JS is the only reason why it is not allowed, please give us a way to opt-out of JS, this could be done via an attribute. Classes with this attribute would not be visible in JS but would allow public inheritance..."},{"user":"https://wpdev.uservoice.com/users/12932642-morten-nielsen","datetime":"2015-08-28","body":"This was actually supported in the early previews of WinRT 8.0, but was removed in final. We ended up building a .NET library rather than a Windows Runtime Component library, simply because this limitation forces a very ugly sdk to work against.\n<br>Wrt to the comment that this is a limitation to support JavaScript: I've heard similar things, and would love for us to create runtime components that just JS doesn't support (but then again there's ways in JS to create inheritance)."},{"user":"https://wpdev.uservoice.com/users/49772332-alex-ovchin","datetime":"2015-08-14","body":"According to this answer by Larry Osterman, it's definitely possible and supported by Windows Runtime: <a rel=\"nofollow noreferrer\" href=\"http://stackoverflow.com/a/7500544\">http://stackoverflow.com/a/7500544</a>"}]}