{"id":"2644759","link":"https://wpdev.uservoice.com/forums/427690-windows-presentation-foundation-wpf/suggestions/2644759-provide-better-directx-support-in-wpf","title":"Provide Better DirectX support in WPF","body":"These DirectX support classes are new in WinRT / Metro.  Please provide them in WPF.","votes":"275","user":"https://wpdev.uservoice.com/users/251674831-dan-at-bentley","datetime":"2012-03-02","comments":[{"user":"https://wpdev.uservoice.com/users/251675059-denis","datetime":"2017-02-10","body":"Forget about something new in WPF. Its dead completely."},{"user":"https://wpdev.uservoice.com/users/18856033-anonymous","datetime":"2017-02-10","body":"Any luck guys with SwapChainBackgroundPanel for WPF?"},{"user":"https://wpdev.uservoice.com/users/251675350-anonymous","datetime":"2014-07-03","body":"Totally agree here.   WPF could be the defacto Win7/Win8/Win9 desktop UI environment, but problems with D3DImage / Render/UI thread stutter / lack of developer transparency will force visualization apps towards Qt unless resolved.  "},{"user":"https://wpdev.uservoice.com/users/38405683-john-schroedl","datetime":"2014-03-13","body":"@Mario One issue with that is that it implies Windows 8 and newer. We need this for Windows 7 and newer at least (and Vista if possible)."},{"user":"https://wpdev.uservoice.com/users/251675305-mario-pintaric","datetime":"2014-03-13","body":"Given that some non-trivial parts of WinRT are now accessible from the desktop as of Windows 8.1, perhaps the path of least resistance would be to allow the WinRT rendering engine to be available as a D3DImage surface with hooks to managed events?"},{"user":"https://wpdev.uservoice.com/users/251669641-eric-hill","datetime":"2013-07-26","body":"+1 on needing SwapChainBackgroundPanel for WPF on the desktop.  WPF retained mode graphics are completely useless for applications other than database forms apps.  WPF needs high-performance immediate mode graphics.  It was a massive architectural failure that it wasn't provided from day one."},{"user":"https://wpdev.uservoice.com/users/251675080-denis","datetime":"2013-07-18","body":"We need new D3DImage class! Please, give us possibility to painless interop with DirectX 11 wrote on C++!!!"},{"user":"https://wpdev.uservoice.com/users/251675056-chris-davies","datetime":"2013-06-15","body":"Even if D3DImage has some enhancements that would help -\n<br>Lock (or TryLock) has to be on the UI thread, so you can't update the surface in the background without a transition to the UI thread just to take the Lock.\n<br>No notification of when the WPF rendering system is attempting to lock the image so its tricky to be insync with WPF render of the UI. \n"},{"user":"https://wpdev.uservoice.com/users/251675035-denis","datetime":"2013-02-13","body":"Yes, please, make a normal way to use native DirectX C++ in WPF applications. It would be very helpful writing level editor for games, for example."},{"user":"https://wpdev.uservoice.com/users/251674894-simon-bond","datetime":"2012-04-26","body":"We desperately need SwapChainBackgroundPanel for WPF so that we have control over presentation timing for video applications. If it were in (or even planned for the next release) we wouldn't have had to abandon WPF as an otherwise perfect desktop application framework for serious multimedia applications."},{"user":"https://wpdev.uservoice.com/users/12932642-morten-nielsen","datetime":"2012-03-20","body":"D3DImage is a pain to work with, and doesn't work very well. I've found that SurfaceImageSource resolves all those issues, but I wish it was available in WPF as well."}]}