{"id":"6736332","link":"https://wpdev.uservoice.com/forums/427690-windows-presentation-foundation-wpf/suggestions/6736332-modify-the-language-to-allow-for-observable-proper","title":"Modify the language to allow for observable properties rather than requiring explicit INPC","body":"Something more like:","votes":"153","user":"https://wpdev.uservoice.com/users/203420667-pete-brown","datetime":"2014-11-18","comments":[{"user":"https://wpdev.uservoice.com/users/877059691-%E9%B5%9C%E9%87%8E%E5%BB%BA%E6%AC%A1","datetime":"2018-12-26","body":"WPF native observable support will be great!"},{"user":"https://wpdev.uservoice.com/users/784315840-steven-r","datetime":"2018-05-05","body":"It would be nice if C# properties were first-class objects.  Their \"property container\" objects by default might just be a pass-through getter and setter, but other implementations such as one with an INPC side effect or a vetoable setter could be swapped in.  Without first-class properties, you just have boilerplate and Java Beans-style handling conventions to work with them."},{"user":"https://wpdev.uservoice.com/users/251673082-lewis-westbury","datetime":"2016-09-04","body":"This would be extraordinarily helpful to remove a large amount of boilerplate code across just about every project I've worked on."},{"user":"https://wpdev.uservoice.com/users/144747591","datetime":"2015-09-16","body":"This request is duplicated higher up in the list (is there any way to merge suggestions?)"},{"user":"https://wpdev.uservoice.com/users/251696938-mendel-monteiro-beckerman","datetime":"2015-06-02","body":"It would be great if the properties were actually of type IObservables of T as this would make the composition of properties much more declarative. This would require changes to the binding mechanism in WPF and the designer. In the designer it and in converters we would want the type to be T whereas in the ViewModel we would want it to be IObservable of T."},{"user":"https://wpdev.uservoice.com/users/57706756-natan-vivo","datetime":"2015-02-23","body":"I think this should be proposed on the Roslyn issue tracker: <a rel=\"nofollow noreferrer\" href=\"https://github.com/dotnet/roslyn\">https://github.com/dotnet/roslyn</a>"},{"user":"https://wpdev.uservoice.com/users/251672788-jeremy-wilkins","datetime":"2014-12-29","body":"This design is automated by tools like Resharper, but I agree that making it part of the language makes more sense to promote the MVVM pattern."}]}