{"id":"6736395","link":"https://wpdev.uservoice.com/forums/427690-windows-presentation-foundation-wpf/suggestions/6736395-make-it-easier","title":"Make it easier!","body":"XAML is very (very!) difficult to learn and use.  It is largely undiscoverable (unlike the .NET framework) and often produces error messages that border on mystical.  I know this stuff can be difficult and that everyone is trying hard but everytime I try to do anything \"outside the box\" in XAML it's tremendously difficult.  Run of the mills stuff is pretty easy, but one foot outside the line and wham!.  At my last employer I hand-coded (and code the generation of postscript) and Ive done similarly with HTML, so Im use to the idea of rendering and declarative syntax (I currently work heavily in XML).  With XAML its as if you have to have the entire schema in your head just to get started.  Recently Ive been trying to use Expression Blend 3, I think its actually much harder than just typing in the XAML, but it does make creating (copying!) custom styles and templates easier.  Let me give you an example of two things that Im sure are possible now, but seem to me wildly difficult to figure out from scratch.  \n<br>1)\tIve been working on an idea, where I want have a non-rectangular base window and supply my own decoration (min, max, close, icon, etc.).  I started very simply, using Expression to create a window with a WindowStyle of None then I placed a Border as the contained control of the window.  I set a CornerRadius on the border, then attempted to set the Background on the window to Transparent.  The only way I could find to do this in Expression was to type in the text in the XAML.  That in itself isnt a huge deal, but it suggests that people who use Expression, wont be needing anything transparent.  I then wanted to change the border color based on whether or not the window has focus.  Im sure there is a way to do this and Im sure it will literally take 20 hours to ferret it out.  I could catch the event in c# and set the properties in a few minutes (were I not trying to learn the XAML way)  which makes it especially frustrating since Id be using exactly the same framework as XAML.\n<br>2)\tAnother task I was looking at is drawing an icon.  Using an icon that is in a jpg is pretty darn easy.  If however you draw an icon using a Path, it seems impossible to use this as a resource and apply RenderTransforms at the point of use (say like putting it on a button).  Im sure its possible, but it sure isnt discoverable. \n<br>It is very difficult for a developer to do anything interesting with XAML without making a career of it.  I dont have the time to specialize in doing or learning nothing but XAML for a year (or three).  You pretty much have to be willing to hand edit the XAML to do anything interesting, but having to copy large templates and styles to make simple changes makes understanding the XAML that much harder (large redundant declaration are what developers are trained to avoid).  Im really beginning to wonder if we need a different language where developers can express GUI relationships that will compile into XAML (BAML).","votes":"1","user":"https://wpdev.uservoice.com/users/136529031-greg-granger","datetime":"2014-11-18","comments":[]}