{"id":"7810488","link":"https://wpdev.uservoice.com/forums/427690-windows-presentation-foundation-wpf/suggestions/7810488-implement-x-bind-for-wpf","title":"Implement x:Bind for WPF","body":"Please implement the x:Bind feature from Universal Windows Apps in WPF.","votes":"632","user":"https://wpdev.uservoice.com/users/251676307-brian","datetime":"2015-05-04","comments":[{"user":"https://wpdev.uservoice.com/users/919576108-jallen","datetime":"2019-09-12","body":"With WPF getting all sorts of cool .net core 3.0 hotness...can we get some x:Bind love too?"},{"user":"https://wpdev.uservoice.com/users/904163872-tamilmaran","datetime":"2019-06-04","body":"Is the plan dropped or still in progress?"},{"user":"https://wpdev.uservoice.com/users/786546325-roland-harrison","datetime":"2018-05-12","body":"Any comment from Microsoft? "},{"user":"https://wpdev.uservoice.com/users/741510346-lutz-fritsche","datetime":"2018-01-16","body":"We develop a large ERP software with a metadata based generated WPF client. \n<br>x:Bind would be very important for us."},{"user":"https://wpdev.uservoice.com/users/357625396-branko-radosevic","datetime":"2017-04-12","body":"Dont like UWP, WPF is much better way i like the file system and local resurce small country and small bussines and family and privacy is  imperative to protect.\n<br>Big corporative intrest of few mega rich people who leading big countrys around world and want to control the all world destroy world we know.Only for this people all must be on his cloud regardless of the cost and only he be the one to make money.Microsoft please correct this unjustice."},{"user":"https://wpdev.uservoice.com/users/291808672-shujaat","datetime":"2016-12-03","body":"It's a shame that we don't even have a comment from MS on this highly voted feature. They seem to be fed up with WPF much earlier than WinForms."},{"user":"https://wpdev.uservoice.com/users/251677528-steve","datetime":"2016-08-09","body":"Agree with Raffaele Rialdi (below)."},{"user":"https://wpdev.uservoice.com/users/251696848-stefan-koell","datetime":"2016-07-15","body":"Please don't stop innovation on WPF. UWP is not there yet and still has many limitations (interop, elevation, etc). Also Win10 as a min. requirement is still a showstopper. Innovations like this are badly needed!"},{"user":"https://wpdev.uservoice.com/users/251677405-kelly-elias","datetime":"2016-02-24","body":"WPF needs the x:bind and x:phase enhancements badly. Implementing those would solve so many problems I'm currently dealing with. All these look solid and really should be part of WPF. "},{"user":"https://wpdev.uservoice.com/users/251677312-joe-bussell","datetime":"2015-12-30","body":"This remains a critical need for WPF.  Anything that can be done in a UWP program should be available an a WPF program.  WPF &gt; UWP for our needs, but we are feeling a bit neglected seeing all the shiny new toys going exclusively out to UWP devs."},{"user":"https://wpdev.uservoice.com/users/251673001-sven","datetime":"2015-10-16","body":"Why not compile normal WPF bindings where x:DataType is set? "},{"user":"https://wpdev.uservoice.com/users/103537635-raffaele-rialdi","datetime":"2015-09-02","body":"Good idea, but please not x:Bind as it is not MVVM friendly.\n<br>Since WPF allows markup extensions and the use of code generation (Linq Expressions), I would opt for something *better* than x:Bind.\n<br>I mean something that is MVVM-friendly (x:Bind is not) allowing decoupling View from ViewModel (x:Bind requires the binding is done on the code-behind)"},{"user":"https://wpdev.uservoice.com/users/251696926-vip-paa-gmail-ru","datetime":"2015-08-02","body":"We need it! "},{"user":"https://wpdev.uservoice.com/users/251684437-anonymous","datetime":"2015-07-31","body":"Yes this is needed.  \n<br>My existing customers are not ready to move from Windows7 any time soon and have no interest in developing apps for the store.  They want line of business applications developed in WPF and for these to be fast, memory efficient and stable."},{"user":"https://wpdev.uservoice.com/users/251676616-anonymous","datetime":"2015-07-25","body":"Add it please"},{"user":"https://wpdev.uservoice.com/users/251676595-jeff-arnett","datetime":"2015-05-29","body":"Either re-invest into WPF or make UWP app model be able to escape out to service/system level access (file system, drivers, registry, etc.).\n<br>With the WinIoT flavor of Windows 10 having an \"embedded\" flag to allow this will the desktop flavors of Windows 10 follow suit? If so maybe adding the system access and powerful WPF features to UWP is the way to go?"},{"user":"https://wpdev.uservoice.com/users/251668144-birbilis","datetime":"2015-05-09","body":"...when I say \"backport\" below, they don't need to be compiled at WPF/Silverlight in my opinion, just allow the new syntax and fallback to implementing it internally using the old latebound way for starters, then later consider if will fully implement at compile time"},{"user":"https://wpdev.uservoice.com/users/251668144-birbilis","datetime":"2015-05-09","body":"all such additions to XAML (and especially the \"using\" at the namespaces that breaks older XAML) should be backported to both WPF and Silverlight. Especially with \"using\" means that you can't share XAML between WPF/Silverlight and Universal apps, thus you have to maintain separate XAML with no way to implement that support as a compatibility layer yourself"},{"user":"https://wpdev.uservoice.com/users/251676418-john-bowen","datetime":"2015-05-06","body":"@Jim Fielding - x:Defer has already been announced as a coming WPF feature. <a rel=\"nofollow noreferrer\" href=\"http://channel9.msdn.com/Events/Visual-Studio/Connect-Live/Visual-Studio-WPF-Team-What-we-are-up-to\">http://channel9.msdn.com/Events/Visual-Studio/Connect-Live/Visual-Studio-WPF-Team-What-we-are-up-to</a>"},{"user":"https://wpdev.uservoice.com/users/251671720-jim-fielding","datetime":"2015-05-05","body":"Along with the other two XAML performance improvements for Universal Windows Apps announced at build2015, x:Phase &amp; x:DeferLoadStrategy."}]}